export const SLIDES = [
  {
    title: 'مرحبا!',
    description: 'مرحبا بك في تطبيق المصحف',
    image: require('@/assets/images/icon-large.png'),
  },
  {
    title: 'المصحف',
    description: `يمكنك التنقل بين الصفحات عن طريق السحب نحو اليمين أو نحو اليسار`,
    image: require('@/assets/tutorial/mushaf.png'),
  },
  {
    title: 'القائمة العلوية',
    description: [
      {
        text: 'تعرض القائمة العلوية معلومات الصفحة الحالية مثل اسم السورة، رقم الجزء، وموضع الثمن في الجزء.',
        align: 'center',
      },
      {
        text: 'يمكنك تتبع تقدم وردك اليومي من خلال مؤشر التقدم الدائري.',
        align: 'start',
      },
      {
        text: 'أيقونة التنقل: تتيح لك الانتقال السريع إلى صفحة أو آية معينة.',
        align: 'start',
      },
      {
        text: 'أيقونة البحث: تتيح لك البحث في نص القرآن الكريم.',
        align: 'start',
      },
      {
        text: 'أيقونة ملء الشاشة: تقوم بإظهار أو إخفاء القائمة السفلية لعرض الصفحة بشكل كامل.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/top-menu.png'),
  },
  {
    title: 'التفسير',
    description: [
      {
        text: 'يمكنك إظهار قائمة التفسير بالضغط مطولا على صفحة المصحف.',
        align: 'center',
      },
      {
        text: 'تحتوي القائمة على عدة تفاسير معتمدة يمكنك الاختيار من بينها.',
        align: 'start',
      },
      {
        text: 'يمكنك التبديل بين التفاسير المختلفة بسهولة من خلال الأزرار العلوية.',
        align: 'start',
      },
      {
        text: 'يعرض التفسير معاني الآيات وشرحها بشكل واضح ومفصل.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/tafseer.png'),
  },
  {
    title: 'البحث',
    description: [
      {
        text: 'يمكنك الوصول إلى صفحة البحث من القائمة العلوية في المصحف، وتتيح لك البحث في نص القرآن الكريم.',
        align: 'center',
      },
      {
        text: 'البحث البسيط: يعرض نتائج مطابقة للنص المدخل مباشرة.',
        align: 'start',
      },
      {
        text: 'خاصية البحث المتقدم: يمكن تفعيلها بالضغط على أيقونة البحث، وتوفر خيارات بحث أكثر دقة.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/search.png'),
  },
  {
    title: 'التنقل',
    description: [
      {
        text: 'يمكنك الوصول إلى صفحة التنقل من القائمة العلوية في المصحف.',
        align: 'center',
      },
      {
        text: 'تتيح لك الانتقال السريع إلى سورة محددة من خلال قائمة السور.',
        align: 'start',
      },
      {
        text: 'يمكنك الانتقال بسهولة بين الصفحات والآيات المحددة في أي سورة من القرآن الكريم.',
        align: 'start',
      },
      {
        text: 'تساعدك هذه الميزة على التنقل بسرعة وسهولة في المصحف الكريم.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/navigation.png'),
  },
  {
    title: 'الورد اليومي',
    description: [
      {
        text: 'تابع تقدمك اليومي في قراءة القرآن من خلال شريط التقدم الذي يعرض نسبة الإنجاز.',
        align: 'center',
      },
      {
        text: 'يعرض لك التطبيق عدد الأحزاب أو الصفحات التي قرأتها من الورد اليومي.',
        align: 'start',
      },
      {
        text: 'يمكنك تعديل هدف الورد اليومي بسهولة باستخدام أزرار الزيادة أو النقصان.',
        align: 'start',
      },
      {
        text: 'يعرض التطبيق آخر صفحة توقفت عندها بالأمس لمساعدتك على الاستمرار.',
        align: 'start',
      },
      {
        text: 'يمكنك إظهار واجهة الورد اليومي عن طريق الضغط من القائمة العلوية للتطبيق.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/tracker.png'),
  },
  {
    title: 'الإعدادات',
    description: [
      {
        text: 'يمكنك تخصيص تجربة استخدام التطبيق من خلال صفحة الإعدادات.',
        align: 'center',
      },
      {
        text: 'تتضمن الإعدادات: تفعيل أو تعطيل صوت قلب الصفحة، تنبيه الورد اليومي، ضبط سطوع الوضع الليلي، تفعيل التنبيهات (جزء/حزب/تعطيل)، اختيار الرواية (حفص/ورش)، وإعادة ضبط التطبيق.',
        align: 'start',
      },
      {
        text: 'يمكنك الوصول إلى صفحة الإعدادات من القائمة السفلية.',
        align: 'start',
      },
    ],
    image: require('@/assets/tutorial/settings.png'),
  },
];
