import { OnBoardingSlide } from '@/types';

export const SLIDES: OnBoardingSlide[] = [
  {
    id: 1,
    title: 'مرحبا!',
    description: 'مرحبا بك في تطبيق المصحف',
    image: require('@/assets/images/icon-large.png'),
  },
  {
    id: 2,
    title: 'المصحف',
    description: `يمكنك التنقل بين الصفحات عن طريق السحب نحو اليمين أو نحو اليسار`,
    image: require('@/assets/tutorial/mushaf.png'),
  },
  {
    id: 3,
    title: 'القائمة العلوية',
    description:
      'تعرض القائمة العلوية معلومات الصفحة الحالية مثل اسم السورة ورقمها، ورقم الجزء واسمه الترتيبي.',
    features: [
      {
        text: 'يمكنك تتبع تقدم وردك اليومي من خلال مؤشر التقدم الدائري الواحد.',
      },
      {
        text: 'أيقونة الانتقال: تتيح لك الانتقال السريع إلى صفحة أو آية معينة.',
      },
      {
        text: 'أيقونة البحث: تتيح لك البحث في نص القرآن الكريم.',
      },
      {
        text: 'أيقونة التكبير: تقوم بإظهار أو إخفاء القائمة السفلية لعرض الصفحة بشكل كامل.',
      },
    ],
    image: require('@/assets/tutorial/top-menu.png'),
  },
  {
    id: 4,
    title: 'التفسير',
    description: 'يمكنك إظهار قائمة التفسير بالضغط مطولا على صفحة المصحف.',
    features: [
      {
        text: 'تحتوي القائمة على عدة تفاسير معتمدة يمكنك الاختيار من بينها.',
      },
      {
        text: 'يمكنك التبديل بين التفاسير المختلفة بسهولة من خلال الأزرار العلوية.',
      },
      {
        text: 'يعرض التفسير معاني الآيات وشرحها بشكل واضح ومفصل.',
      },
    ],
    image: require('@/assets/tutorial/tafseer.png'),
  },
  {
    id: 5,
    title: 'البحث',
    description:
      'يمكنك الوصول إلى صفحة البحث من القائمة العلوية في المصحف، وتتيح لك البحث في نص القرآن الكريم.',
    features: [
      {
        text: 'البحث البسيط: يعرض نتائج مطابقة للنص المدخل مباشرة.',
      },
      {
        text: 'خاصية البحث المتقدم: يمكن تفعيلها بالضغط على أيقونة البحث، وتوفر خيارات بحث أكثر دقة.',
      },
    ],
    image: require('@/assets/tutorial/search.png'),
  },
  {
    id: 6,
    title: 'التنقل',
    description: 'يمكنك الوصول إلى صفحة التنقل من القائمة العلوية في المصحف.',
    features: [
      {
        text: 'تتيح لك الانتقال السريع إلى سورة محددة من خلال قائمة السور.',
      },
      {
        text: 'يمكنك الانتقال بسهولة بين الصفحات والآيات المحددة في أي سورة من القرآن الكريم.',
      },
      {
        text: 'تساعدك هذه الميزة على التنقل بسرعة وسهولة في المصحف الكريم.',
      },
    ],
    image: require('@/assets/tutorial/navigation.png'),
  },
  {
    id: 7,
    title: 'الورد اليومي',
    description:
      'تابع تقدمك اليومي في قراءة القرآن من خلال شريط التقدم الذي يعرض نسبة الإنجاز.',
    features: [
      {
        text: 'يعرض لك التطبيق عدد الأحزاب أو الصفحات التي قرأتها من الورد اليومي.',
      },
      {
        text: 'يمكنك تعديل هدف الورد اليومي بسهولة باستخدام أزرار الزيادة أو النقصان.',
      },
      {
        text: 'يعرض التطبيق آخر صفحة توقفت عندها بالأمس لمساعدتك على الاستمرار.',
      },
      {
        text: 'يمكنك إظهار واجهة الورد اليومي عن طريق الضغط من القائمة العلوية للتطبيق.',
      },
    ],
    image: require('@/assets/tutorial/tracker.png'),
  },
  {
    id: 8,
    title: 'الإعدادات',
    description: 'يمكنك تخصيص تجربة استخدام التطبيق من خلال صفحة الإعدادات.',
    features: [
      {
        text: 'تتضمن الإعدادات: تفعيل أو تعطيل صوت قلب الصفحة، تنبيه الورد اليومي، ضبط سطوع الوضع الليلي، تفعيل التنبيهات (جزء/حزب/تعطيل)، اختيار الرواية (حفص/ورش)، وإعادة ضبط التطبيق.',
      },
      {
        text: 'يمكنك الوصول إلى صفحة الإعدادات من القائمة السفلية.',
      },
    ],
    image: require('@/assets/tutorial/settings.png'),
  },
];
