/**
* الكتاب: أسباب نزول القرآن
* المؤلف: أبو الحسن علي بن أحمد بن محمد بن علي الواحدي، النيسابوري، الشافعي (ت ٤٦٨هـ)
* المحقق: عصام بن عبد المحسن الحميدان
* https://shamela.ws/book/11314
*/
[
  {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text":"[٣] القولُ في آية التسمية وبيان نزولها«١٥» - أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بن إبراهيم المقري، أَخْبَرَنَا أَبُو الْحُسَيْنِ عَلِيُّ بْنُ مُحَمَّدٍ الْجُرْجَانِيُّ، أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْجَوْهَرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مَنْدَهْ، حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَارَةَ عَنْ أَبِي رَوْقٍ، عَنِ الضَّحَّاكِ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ:أَوَّلُ مَا نَزَلَ بِهِ جِبْرِيلُ عَلَى النَّبِيِّ- صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ- قَالَ: يَا مُحَمَّدُ اسْتَعِذْ، ثُمَّ قُلْ:بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.«١٦» - أَخْبَرَنَا أَبُو عَبْدِ اللَّهِ بن [أَبِي] إِسْحَاقَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَحْمَدَالقولُ في آية   
الخلال قال، أَخْبَرَنَا أَبُو مُحَمَّدٍ عَبْدُ اللَّهِ بْنُ زَيْدٍ الْبَجَلِيُّ، حَدَّثَنَا أَبُو كُرَيْبٍ. حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ:كَانَ رَسُولُ اللَّهِ- صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ- لَا يَعْرِفُ خَتْمَ السُّورَةِ حَتَّى يَنْزِلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.«١٧» - أَخْبَرَنَا عَبْدُ الْقَاهِرِ بْنُ طَاهِرٍ الْبَغْدَادِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ مَطَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ عَلِيٍّ الذُّهْلِيُّ، حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَمْرُو بْنُ الْحَجَّاجِ الْعَبْدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، ذَكَرَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ:كُنَّا لَا نَعْلَمُ فَصْلَ مَا بَيْنَ السُّورَتَيْنِ حَتَّى تَنْزِلَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.«١٨» - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ جَعْفَرٍ، أَخْبَرَنَا جَدِّي، أَخْبَرَنَا أَبُو عَمْرٍو أَحْمَدُ بْنُ مُحَمَّدٍ الْحَرَشِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ أَبِي فُدَيْكٍ، عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ قَالَ:نَزَلَتْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فِي كل سورة.

والبيهقي في الأسماء والصفات (١/ ٣٦٧) .
وأخرجه الطبراني في الكبير (ج ٢٢/ ٧٥- رقم ١٨٥) .
وقال الهيثمي في المجمع (١/ ١٩٧) رواه أحمد والطبراني في الكبير والأوسط وفيه عمران القطان ضعفه يحيى ووثقه ابن حبان وقال أحمد: أرجو أن يكون صالح الحديث وبقية رجاله ثقات.
وزاد السيوطي نسبته في الدر (١/ ١٨٩) لمحمد بن نصر والبيهقي في شعب الإيمان والأصبهاني في الترغيب.
(١٥) إسناده ضعيف: بشر بن عمارة: قال الحافظ في التقريب: ضعيف [تقريب ١ ١٠٠] ، المجروحين [١/ ١٨٨] ، الميزان [١/ ٢٣١] .
وفيه انقطاع: الضحاك لم يسمع من ابن عباس، [انظر ترجمة الضحاك في تهذيب الكمال للمزي] .
(١٦) إسناده صحيح، أخرجه أبو داود في الصلاة (٧٨٨) والحاكم في المستدرك (١/ ٢٣١) وصححه ووافقه الذهبي.
وأخرجه البزار (٢١٨٧ كشف) وقال الهيثمي في المجمع (٦/ ٣١٠) : رواه البزار بإسنادين ورجال أحدهما رجال الصحيح.
وعزاه السيوطي في الدر (١/ ٧) لأبي داود والبزار والطبراني والحاكم والبيهقي في الدلائل.
(١٧) في إسناده مجهول حيث إنه قال: ذُكر عن عبد اللَّه بن مسعود.
وعزاه السيوطي في الدر (١/ ٧) للواحدي والبيهقي في شعب الإيمان.
(١٨) إسناده ضعيف: عبد اللَّه بن نافع ضعيف، تقريب [١/ ٤٥٦] مجروحين [٢/ ٢٠]- التاريخ الكبير [٥/ ٢١٤]- ميزان [٢/ ٥١٣] ."
  }, {
    "id": 2,
    "sura": 1,
    "aya": 2,
    "text": "أَخْبَرَنَا أَبُو عَمْرٍو الْحِيرِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَارِثِ وَعَلِيُّ بْنُ سَهْلِ بْنِ الْمُغِيرَةِ قَالَا: حَدَّثَنَا يَحْيَى بْنُ [أَبِي] بُكَيْرٍ، حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي مَيْسَرَةَ:أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا بَرَزَ سَمِعَ مُنَادِيًا يُنَادِيهِ: يَا مُحَمَّدُ، فَإِذَا سَمِعَ الصَّوْتَ انْطَلَقَ هَارِبًا، فَقَالَ لَهُ وَرَقَةُ بْنُ نَوْفَلٍ: إِذَا سَمِعْتَ النِّدَاءَ فَاثْبُتْ حَتَّى تَسْمَعَ مَا يَقُولُ لَكَ. قَالَ: فَلَمَّا بَرَزَ سَمِعَ النِّدَاءَ: يَا مُحَمَّدُ، فَقَالَ: لَبَّيْكَ، قَالَ: قُلْ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أشهد وأن مُحَمَّدًا رَسُولُ اللَّهِ، ثُمَّ قال: قل: بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَنِ الرَّحِيمِ مَالِكِ يَوْمِ الدِّينِ حتى فرع مِنْ فَاتِحَةِ الْكِتَابِ.وَهَذَا قَوْلُ عَلِيِّ بْنِ أَبِي طَالِبٍ.«٢٠» - أَخْبَرَنَا أَبُو إِسْحَاقَ أَحْمَدُ بْنُ مُحَمَّدٍ الْمُفَسِّرُ، أَخْبَرَنَا الْحَسَنُ بْنُ جَعْفَرٍ الْمُفَسِّرُ، قَالَ: أَخْبَرَنَا أَبُو الْحَسَنِ بْنُ مُحَمَّدِ بْنِ مَحْمُودٍ الْمَرْوَزِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَحْمُودٍ السَّعْدِيُّ، حَدَّثَنَا أَبُو يَحْيَى الْقَصْرِيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنِ الْعَلَاءِ بْنِ الْمُسَيَّبِ، عَنِ الْفُضَيْلِ بْنِ عَمْرٍو، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ:نَزَلَتْ فَاتِحَةُ الْكِتَابِ بِمَكَّةَ مِنْ كَنْزٍ تَحْتَ الْعَرْشِ.«٢١» - وَبِهَذَا الْإِسْنَادِ عَنِ السَّعْدِيِّ: حَدَّثَنَا عَمْرُو بْنُ صَالِحٍ، حَدَّثَنَا أَبِي، عَنِ الْكَلْبِيِّ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ:قَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَقَالَ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ. فَقَالَتْ قُرَيْشٌ: دَقَّ اللَّهُ فَاكَ أَوْ نَحْوَ هَذَا، قَالَهُ الْحَسَنُ وَقَتَادَةُ.وَعِنْدَ مُجَاهِدٍ: أَنَّ الْفَاتِحَةَ مَدَنِيَّةٌ. قَالَ الْحُسَيْنُ بْنُ الْفَضْلِ: لِكُلِّ عَالِمٍ هَفْوَةٌ،

وَهَذِهِ بَادِرَةٌ مِنْ مُجَاهِدٍ، لِأَنَّهُ تَفَرَّدَ بِهَذَا الْقَوْلِ، وَالْعُلَمَاءُ عَلَى خِلَافِهِ. وَمِمَّا يُقْطَعُ بِهِ عَلَى أَنَّهَا مَكِّيَّةٌ قَوْلُهُ تَعَالَى: وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي وَالْقُرْآنَ الْعَظِيمَ يَعْنِي الْفَاتِحَةَ.«٢٢» - أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ النَّحْوِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ عَلِيٍّ الْحِيرِيُّ، أَخْبَرَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ:قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَرَأَ عَلَيْهِ أُبَيُّ بْنُ كَعْبٍ أُمَّ الْقُرْآنِ فَقَالَ: وَالَّذِي نَفْسِي بِيَدِهِ، مَا أَنْزَلَ اللَّهُ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَلَا فِي الزَّبُورِ وَلَا فِي الْقُرْآنِ مِثْلَهَا، إِنَّهَا لَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ.وَسُورَةُ «الْحِجْرِ» مكية بلا اختلاف، وَلَمْ يَكُنِ اللَّهُ لِيَمْتَنَّ عَلَى رَسُولِهِ بِإِيتَائِهِ فَاتِحَةَ الْكِتَابِ وَهُوَ بِمَكَّةَ ثُمَّ يُنْزِلُهَا بِالْمَدِينَةِ. وَلَا يَسَعُنَا الْقَوْلُ: بِأَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ بِمَكَّةَ بِضْعَ عَشْرَةَ سَنَةً يُصَلِّي بِلَا فَاتِحَةِ الْكِتَابِ. هَذَا مِمَّا لَا تقبله العقول.

وهو عند ابن أبي شيبة (١٤/ ٢٩٢) ولم أهتد إليه في دلائل البيهقي.
(٢٠) في إسناده انقطاع: الفضيل بن عمرو لم يسمع من علي والحديث أخرجه الديلمي في الفردوس بمأثور الخطاب رقم (٦٨١٦) من طريق فضيل بن عمرو، وفي كنز العمال (٢٥٢١) وعزاه للديلمي.
وعزاه في الدر (١/ ٥) لإسحاق بن راهويه عن علي مرفوعاً.
(٢١) إسناده ضعيف: في إسناده الكلبي، وقد مرت ترجمته في رقم (١٠) .
(٢٢) أخرجه الترمذي في التفسير (٣١٢٥) والحاكم في المستدرك (٢/ ٢٥٨) وصححه ووافقه الذهبي على شرط مسلم.
وأخرجه عبد اللَّه بن أحمد في زوائد المسند (٥/ ١١٤) من طريق عبد الحميد بن جعفر به."
  }, {
    "id": 3,
    "sura": 2,
    "aya": 1,
    "text": "[٥] قَوْلُهُ تَعَالَى: الم ذَلِكَ الْكِتَابُ. [١، ٢] .
«٢٤» - أَخْبَرَنَا أَبُو عُثْمَانَ [الثَّقَفِيُّ] الزَّعْفَرَانِيُّ، أَخْبَرَنَا أَبُو عَمْرِو بْنُ مَطَرٍ، أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ اللَّيْثِ، حَدَّثَنَا أَبُو حُذَيْفَةَ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ قَالَ:
أَرْبَعُ آيَاتٍ مِنْ أَوَّلِ هَذِهِ السُّورَةِ نَزَلَتْ فِي الْمُؤْمِنِينَ، وَآيَتَانِ بَعْدَهَا نَزَلَتَا في الكافرين، وثلاث عَشْرَةَ بَعْدَهَا نَزَلَتْ فِي المنافقين.

(٢٤) الأربع آيات التي نزلت في المؤمنين هي من أول السورة حتى قوله تعالى وَأُولئِكَ هُمُ الْمُفْلِحُونَ في قراءة من لم يعتبر الم آية.
والآيتان بعدها في الكافرين، والثلاثة عشر آية التي بعدها حتى قوله تعالى إِنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ نزلت في المنافقين."
  }, {
    "id": 4,
    "sura": 2,
    "aya": 2,
    "text": "[٦] قوله تعالى: إِنَّ الَّذِينَ كَفَرُوا سَواءٌ عَلَيْهِمْ. [٦] .«٢٥» - قَالَ الضَّحَّاكُ: نَزَلَتْ فِي أَبِي جَهْلٍ وَخَمْسَةٍ مِنْ أَهْلِ بَيْتِهِ. وَقَالَ الْكَلْبِيُّ: يَعْنِي الْيَهُودَ.

(٢٥) أثر الضحاك مرسل، والكلبي ضعيف."
  }, {
    "id": 5,
    "sura": 2,
    "aya": 14,
    "text": "[٧] قَوْلُهُ تَعَالَى: وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا. [١٤] 
.«٢٦» - أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، أَخْبَرَنَا شَيْبَةُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ قُرَّةَ، حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نَصْرٍ، حَدَّثَنَا يُوسُفُ بْنُ بِلَالٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ عَنِ الْكَلْبِيِّ، عَنْ صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ:نَزَلَتْ هَذِهِ الْآيَةُ فِي عَبْدِ اللَّهِ بْنِ أُبَيٍّ وَأَصْحَابِهِ، وَذَلِكَ: أَنَّهُمْ خَرَجُوا ذَاتَ يَوْمٍ فَاسْتَقْبَلَهُمْ نَفَرٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ: انْظُرُوا كَيْفَ أَرُدُّ هَؤُلَاءِ السُّفَهَاءَ عَنْكُمْ، فَذَهَبَ فَأَخَذَ بِيَدِ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ:مَرْحَبًا بِالصِّدِّيقِ سَيِّدِ بَنِي تَيْمٍ، وَشَيْخِ الْإِسْلَامِ، وَثَانِي رَسُولِ اللَّهِ فِي الْغَارِ، الْبَاذِلِ نَفْسَهُ وَمَالَهُ. ثُمَّ أَخَذَ بِيَدِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ: مَرْحَبًا بِسَيِّدِ بَنِي عَدِيِّ بْنِ كَعْبٍ، الْفَارُوقِ الْقَوِيِّ فِي دِينِ اللَّهِ، الْبَاذِلِ نَفْسَهُ وَمَالَهُ لِرَسُولِ اللَّهِ. ثُمَّ أَخَذَ بِيَدِ عَلِيٍّ كَرَّمَ اللَّهُ وَجْهَهُ فَقَالَ: مَرْحَبًا بِابْنِ عَمِّ رَسُولِ اللَّهِ وَخَتَنِهِ، سَيِّدِ بَنِي هَاشِمٍ مَا خَلَا رَسُولَ اللَّهِ. ثُمَّ افْتَرَقُوا. فَقَالَ عَبْدُ اللَّهِ لِأَصْحَابِهِ: كَيْفَ رَأَيْتُمُونِي فَعَلْتُ؟ فَإِذَا رَأَيْتُمُوهُمْ فَافْعَلُوا كَمَا فَعَلْتُ فَأَثْنَوْا عَلَيْهِ خَيْرًا. فَرَجَعَ الْمُسْلِمُونَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَخْبَرُوهُ بِذَلِكَ. فَأَنْزَلَ اللَّهُ هَذِهِ الآية.

(٢٦) إسناده واه جداً: محمد بن مروان بن السائب عن الكلبي عن أبي صالح، أطلق العلماء على هذا الإسناد: سلسلة الكذب أ. هـ.
والأثر ذكره السيوطي في الدر (١/ ٣١) وعزاه للواحدي والثعلبي بسند واه."
  }, {
    "id": 6,
    "sura": 2,
    "aya": 21,
    "text": "قوله: يا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ. [٢١] .«٢٧» -[أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الزَّاهِدُ، أخبرنا أبو عَلِيُّ بْنُ أَحْمَدَ الْفَقِيهُ، أَخْبَرَنَا أَبُو تُرَابٍ الْقُهُسْتَانِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ] ، [عَنْ عَلْقَمَةَ قَالَ:كُلُّ شَيْءٍ نَزَلَ فِيهِ يَا أيها الناس، فهو مكي، ويا أَيُّهَا الذين آمنوا، فهو مدني.][يعني أن يَا أَيُّهَا الناس خِطَابُ أهل مكة، ويا أيها الذين آمنوا خطاب أَهْلِ المدينة. فقوله: يا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ خِطَابٌ لِمُشْرِكِي مَكَّةَ إِلَى قَوْلِهِ:وَبَشِّرِ الَّذِينَ آمَنُوا. وَهَذِهِ الْآيَةُ نَازِلَةٌ فِي الْمُؤْمِنِينَ، وَذَلِكَ: أَنَّ اللَّهَ تَعَالَى لَمَّا ذَكَرَ جَزَاءَ الْكَافِرِينَ بِقَوْلِهِ: النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ ذَكَرَ جَزَاءَ الْمُؤْمِنِينَ] .

(٢٧) عزاه في الدر (١/ ٣٣) لأبي عبيد وابن أبي شيبة وعبد بن حميد وابن الضريس وابن المنذر وأبي الشيخ."
  }, {
    "id": 6,
    "sura": 2,
    "aya": 26,
    "text": "[٩] قوله تعالى: / بقره ٢٦ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا. [٢٦] .«٢٨» -[[قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ أَبِي صَالِحٍ] : لَمَّا ضَرَبَ اللَّهُ تَعَالَى هَذَيْنِ الْمَثَلَيْنِ لِلْمُنَافِقِينَ، يَعْنِي قَوْلَهُ: مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا وَقَوْلَهُ: أَوْ كَصَيِّبٍ مِنَ السَّمَاءِ- قَالُوا: اللَّهُ أَجَلُّ وَأَعْلَى مِنْ أَنْ يَضْرِبَ الْأَمْثَالَ. فَأَنْزَلَ اللَّهُ هذه الآية.]«٢٩» -[بقره ٢٦ وَقَالَ الْحَسَنُ وَقَتَادَةُ: لَمَّا ذَكَرَ اللَّهُ الذُّبَابَ وَالْعَنْكَبُوتَ فِي كِتَابِهِ، وَضَرَبَ لِلْمُشْرِكِينَ [بِهِ] الْمَثَلَ- ضَحِكَتِ الْيَهُودُ وَقَالُوا: مَا يُشْبِهُ هَذَا كَلَامَ اللَّهِ، فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.]«٣٠» -[أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْحَافِظُ فِي كِتَابِهِ، أَخْبَرَنَا سُلَيْمَانُ بْنُ أَيُّوبَ الطَّبَرَانِيُّ، حَدَّثَنَا بَكْرُ بْنُ سَهْلٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ سَعِيدٍ، عَنْ مُوسَى بْنِ عَبْدِ الرَّحْمَنِ عَنِ ابْنِ جُرَيْجٍ، عن عطاء،] [بقره ٢٦ عَنْ ابْنِ عَبَّاسٍ فِي قَوْلِهِ تَعَالَى:إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا قَالَ:وَذَلِكَ أَنَّ اللَّهَ ذَكَرَ آلِهَةَ الْمُشْرِكِينَ فَقَالَ وَإِنْ يَسْلُبْهُمُ الذُّبَابُ شَيْئًا وَذَكَرَ كَيْدَ الْآلِهَةِ فَجَعَلَهُ كَبَيْتِ الْعَنْكَبُوتِ، فَقَالُوا: أَرَأَيْتَ حَيْثُ ذَكَرَ اللَّهُ الذُّبَابَ وَالْعَنْكَبُوتَ فِيمَا أَنْزَلَ مِنَ الْقُرْآنِ عَلَى مُحَمَّدٍ، أَيُّ شَيْءٍ يَصْنَعُ بِهَذَا؟ فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.]

(٢٨) أبو صالح لم يسمع ابن عباس فهو منقطع.
وأخرجه ابن جرير (١/ ١٣٨) .
(٢٩) مرسل.
(٣٠) إسناده ضعيف: في إسناده ابن جريح وهو مدلس وقد عنعنه."
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  }, {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text": ""
  },]
