/**
*URL: https://shamela.ws/book/11314/120#p1
* page 133
* aya 3/181
*/
[
  {
    "id": 1,
    "sura": 1,
    "aya": 1,
    "text":"<p>[٣] القولُ في آية التسمية وبيان نزولها</p><p>«١٥» - أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بن إبراهيم المقري، أَخْبَرَنَا أَبُو الْحُسَيْنِ عَلِيُّ بْنُ مُحَمَّدٍ الْجُرْجَانِيُّ، أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْجَوْهَرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مَنْدَهْ، حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَارَةَ عَنْ أَبِي رَوْقٍ، عَنِ الضَّحَّاكِ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ:أَوَّلُ مَا نَزَلَ بِهِ جِبْرِيلُ عَلَى النَّبِيِّ- صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ- قَالَ: يَا مُحَمَّدُ اسْتَعِذْ، ثُمَّ قُلْ:بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.«١٦» - أَخْبَرَنَا أَبُو عَبْدِ اللَّهِ بن [أَبِي] إِسْحَاقَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَحْمَدَ</p><p>القولُ في آية الخلال قال، أَخْبَرَنَا أَبُو مُحَمَّدٍ عَبْدُ اللَّهِ بْنُ زَيْدٍ الْبَجَلِيُّ، حَدَّثَنَا أَبُو كُرَيْبٍ. حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ:كَانَ رَسُولُ اللَّهِ- صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ- لَا يَعْرِفُ خَتْمَ السُّورَةِ حَتَّى يَنْزِلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.</p><p>«١٧» - أَخْبَرَنَا عَبْدُ الْقَاهِرِ بْنُ طَاهِرٍ الْبَغْدَادِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ مَطَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ عَلِيٍّ الذُّهْلِيُّ، حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَمْرُو بْنُ الْحَجَّاجِ الْعَبْدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، ذَكَرَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ:كُنَّا لَا نَعْلَمُ فَصْلَ مَا بَيْنَ السُّورَتَيْنِ حَتَّى تَنْزِلَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ.</p><p>«١٨» - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ جَعْفَرٍ، أَخْبَرَنَا جَدِّي، أَخْبَرَنَا أَبُو عَمْرٍو أَحْمَدُ بْنُ مُحَمَّدٍ الْحَرَشِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ أَبِي فُدَيْكٍ، عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ قَالَ:نَزَلَتْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فِي كل سورة.</p><p>    البيهقي في الأسماء والصفات (١/ ٣٦٧) .وأخرجه الطبراني في الكبير (ج ٢٢/ ٧٥- رقم ١٨٥) .</p><p>وقال الهيثمي في المجمع (١/ ١٩٧) رواه أحمد والطبراني في الكبير والأوسط وفيه عمران القطان ضعفه يحيى ووثقه ابن حبان وقال أحمد: أرجو أن يكون صالح الحديث وبقية رجاله ثقات.</p><p>وزاد السيوطي نسبته في الدر (١/ ١٨٩) لمحمد بن نصر والبيهقي في شعب الإيمان والأصبهاني في الترغيب.</p><p>(١٥) إسناده ضعيف: بشر بن عمارة: قال الحافظ في التقريب: ضعيف [تقريب ١ ١٠٠] ، المجروحين [١/ ١٨٨] ، الميزان [١/ ٢٣١] .</p><p>وفيه انقطاع: الضحاك لم يسمع من ابن عباس، [انظر ترجمة الضحاك في تهذيب الكمال للمزي] .</p><p>(١٦) إسناده صحيح، أخرجه أبو داود في الصلاة (٧٨٨) والحاكم في المستدرك (١/ ٢٣١) وصححه ووافقه الذهبي.</p><p>وأخرجه البزار (٢١٨٧ كشف) وقال الهيثمي في المجمع (٦/ ٣١٠) : رواه البزار بإسنادين ورجال أحدهما رجال الصحيح.</p><p>وعزاه السيوطي في الدر (١/ ٧) لأبي داود والبزار والطبراني والحاكم والبيهقي في الدلائل.</p><p>(١٧) في إسناده مجهول حيث إنه قال: ذُكر عن عبد اللَّه بن مسعود.</p><p>وعزاه السيوطي في الدر (١/ ٧) للواحدي والبيهقي في شعب الإيمان.</p><p>(١٨) إسناده ضعيف: عبد اللَّه بن نافع ضعيف، تقريب [١/ ٤٥٦] مجروحين [٢/ ٢٠]- التاريخ الكبير [٥/ ٢١٤]- ميزان [٢/ ٥١٣] .</p>"
  }, {
    "id": 2,
    "sura": 1,
    "aya": 2,
    "text": "<p>أَخْبَرَنَا أَبُو عَمْرٍو الْحِيرِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَارِثِ وَعَلِيُّ بْنُ سَهْلِ بْنِ الْمُغِيرَةِ قَالَا: حَدَّثَنَا يَحْيَى بْنُ [أَبِي] بُكَيْرٍ، حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي مَيْسَرَةَ:أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا بَرَزَ سَمِعَ مُنَادِيًا يُنَادِيهِ: يَا مُحَمَّدُ، فَإِذَا سَمِعَ الصَّوْتَ انْطَلَقَ هَارِبًا، فَقَالَ لَهُ وَرَقَةُ بْنُ نَوْفَلٍ: إِذَا سَمِعْتَ النِّدَاءَ فَاثْبُتْ حَتَّى تَسْمَعَ مَا يَقُولُ لَكَ. قَالَ: فَلَمَّا بَرَزَ سَمِعَ النِّدَاءَ: يَا مُحَمَّدُ، فَقَالَ: لَبَّيْكَ، قَالَ: قُلْ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أشهد وأن مُحَمَّدًا رَسُولُ اللَّهِ، ثُمَّ قال: قل: بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَنِ الرَّحِيمِ مَالِكِ يَوْمِ الدِّينِ حتى فرع مِنْ فَاتِحَةِ الْكِتَابِ.وَهَذَا قَوْلُ عَلِيِّ بْنِ أَبِي طَالِبٍ.«٢٠» - أَخْبَرَنَا أَبُو إِسْحَاقَ أَحْمَدُ بْنُ مُحَمَّدٍ الْمُفَسِّرُ، أَخْبَرَنَا الْحَسَنُ بْنُ جَعْفَرٍ الْمُفَسِّرُ، قَالَ: أَخْبَرَنَا أَبُو الْحَسَنِ بْنُ مُحَمَّدِ بْنِ مَحْمُودٍ الْمَرْوَزِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَحْمُودٍ السَّعْدِيُّ، حَدَّثَنَا أَبُو يَحْيَى الْقَصْرِيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنِ الْعَلَاءِ بْنِ الْمُسَيَّبِ، عَنِ الْفُضَيْلِ بْنِ عَمْرٍو، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ:نَزَلَتْ فَاتِحَةُ الْكِتَابِ بِمَكَّةَ مِنْ كَنْزٍ تَحْتَ الْعَرْشِ.«٢١» - وَبِهَذَا الْإِسْنَادِ عَنِ السَّعْدِيِّ: حَدَّثَنَا عَمْرُو بْنُ صَالِحٍ، حَدَّثَنَا أَبِي، عَنِ الْكَلْبِيِّ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ:قَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَقَالَ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ. فَقَالَتْ قُرَيْشٌ: دَقَّ اللَّهُ فَاكَ أَوْ نَحْوَ هَذَا، قَالَهُ الْحَسَنُ وَقَتَادَةُ.وَعِنْدَ مُجَاهِدٍ: أَنَّ الْفَاتِحَةَ مَدَنِيَّةٌ. قَالَ الْحُسَيْنُ بْنُ الْفَضْلِ: لِكُلِّ عَالِمٍ هَفْوَةٌ،</p><p>وَهَذِهِ بَادِرَةٌ مِنْ مُجَاهِدٍ، لِأَنَّهُ تَفَرَّدَ بِهَذَا الْقَوْلِ، وَالْعُلَمَاءُ عَلَى خِلَافِهِ. وَمِمَّا يُقْطَعُ بِهِ عَلَى أَنَّهَا مَكِّيَّةٌ قَوْلُهُ تَعَالَى: وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي وَالْقُرْآنَ الْعَظِيمَ يَعْنِي الْفَاتِحَةَ.«٢٢» - أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ النَّحْوِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ عَلِيٍّ الْحِيرِيُّ، أَخْبَرَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ:قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَرَأَ عَلَيْهِ أُبَيُّ بْنُ كَعْبٍ أُمَّ الْقُرْآنِ فَقَالَ: وَالَّذِي نَفْسِي بِيَدِهِ، مَا أَنْزَلَ اللَّهُ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَلَا فِي الزَّبُورِ وَلَا فِي الْقُرْآنِ مِثْلَهَا، إِنَّهَا لَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ.وَسُورَةُ «الْحِجْرِ» مكية بلا اختلاف، وَلَمْ يَكُنِ اللَّهُ لِيَمْتَنَّ عَلَى رَسُولِهِ بِإِيتَائِهِ فَاتِحَةَ الْكِتَابِ وَهُوَ بِمَكَّةَ ثُمَّ يُنْزِلُهَا بِالْمَدِينَةِ. وَلَا يَسَعُنَا الْقَوْلُ: بِأَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ بِمَكَّةَ بِضْعَ عَشْرَةَ سَنَةً يُصَلِّي بِلَا فَاتِحَةِ الْكِتَابِ. هَذَا مِمَّا لَا تقبله العقول.</p><p>وهو عند ابن أبي شيبة (١٤/ ٢٩٢) ولم أهتد إليه في دلائل البيهقي.</p><p>(٢٠) في إسناده انقطاع: الفضيل بن عمرو لم يسمع من علي والحديث أخرجه الديلمي في الفردوس بمأثور الخطاب رقم (٦٨١٦) من طريق فضيل بن عمرو، وفي كنز العمال (٢٥٢١) وعزاه للديلمي.</p><p>وعزاه في الدر (١/ ٥) لإسحاق بن راهويه عن علي مرفوعاً.</p><p>(٢١) إسناده ضعيف: في إسناده الكلبي، وقد مرت ترجمته في رقم (١٠) .</p><p>(٢٢) أخرجه الترمذي في التفسير (٣١٢٥) والحاكم في المستدرك (٢/ ٢٥٨) وصححه ووافقه الذهبي على شرط مسلم.</p><p>وأخرجه عبد اللَّه بن أحمد في زوائد المسند (٥/ ١١٤) من طريق عبد الحميد بن جعفر به.</p>"
  }, {
    "id": 3,
    "sura": 2,
    "aya": 1,
    "text": "<p>[٥] قَوْلُهُ تَعَالَى: الم ذَلِكَ الْكِتَابُ. [١، ٢] .</p><p>«٢٤» - أَخْبَرَنَا أَبُو عُثْمَانَ [الثَّقَفِيُّ] الزَّعْفَرَانِيُّ، أَخْبَرَنَا أَبُو عَمْرِو بْنُ مَطَرٍ، أَخْبَرَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ اللَّيْثِ، حَدَّثَنَا أَبُو حُذَيْفَةَ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ قَالَ:</p><p>أَرْبَعُ آيَاتٍ مِنْ أَوَّلِ هَذِهِ السُّورَةِ نَزَلَتْ فِي الْمُؤْمِنِينَ، وَآيَتَانِ بَعْدَهَا نَزَلَتَا في الكافرين، وثلاث عَشْرَةَ بَعْدَهَا نَزَلَتْ فِي المنافقين.</p><p>(٢٤) الأربع آيات التي نزلت في المؤمنين هي من أول السورة حتى قوله تعالى وَأُولئِكَ هُمُ الْمُفْلِحُونَ في قراءة من لم يعتبر الم آية.</p><p>والآيتان بعدها في الكافرين، والثلاثة عشر آية التي بعدها حتى قوله تعالى إِنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ نزلت في المنافقين.</p>"
  }, {
    "id": 4,
    "sura": 2,
    "aya": 2,
    "text": "[٦] قوله تعالى: إِنَّ الَّذِينَ كَفَرُوا سَواءٌ عَلَيْهِمْ. [٦] .«٢٥» - قَالَ الضَّحَّاكُ: نَزَلَتْ فِي أَبِي جَهْلٍ وَخَمْسَةٍ مِنْ أَهْلِ بَيْتِهِ. وَقَالَ الْكَلْبِيُّ: يَعْنِي الْيَهُودَ.</p><p>(٢٥) أثر الضحاك مرسل، والكلبي ضعيف."
  }, {
    "id": 5,
    "sura": 2,
    "aya": 14,
    "text": "<p>[٧] قَوْلُهُ تَعَالَى: وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا. [١٤] </p><p>.«٢٦» - أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، أَخْبَرَنَا شَيْبَةُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ قُرَّةَ، حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نَصْرٍ، حَدَّثَنَا يُوسُفُ بْنُ بِلَالٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ عَنِ الْكَلْبِيِّ، عَنْ صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ:نَزَلَتْ هَذِهِ الْآيَةُ فِي عَبْدِ اللَّهِ بْنِ أُبَيٍّ وَأَصْحَابِهِ، وَذَلِكَ: أَنَّهُمْ خَرَجُوا ذَاتَ يَوْمٍ فَاسْتَقْبَلَهُمْ نَفَرٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ: انْظُرُوا كَيْفَ أَرُدُّ هَؤُلَاءِ السُّفَهَاءَ عَنْكُمْ، فَذَهَبَ فَأَخَذَ بِيَدِ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ:مَرْحَبًا بِالصِّدِّيقِ سَيِّدِ بَنِي تَيْمٍ، وَشَيْخِ الْإِسْلَامِ، وَثَانِي رَسُولِ اللَّهِ فِي الْغَارِ، الْبَاذِلِ نَفْسَهُ وَمَالَهُ. ثُمَّ أَخَذَ بِيَدِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ: مَرْحَبًا بِسَيِّدِ بَنِي عَدِيِّ بْنِ كَعْبٍ، الْفَارُوقِ الْقَوِيِّ فِي دِينِ اللَّهِ، الْبَاذِلِ نَفْسَهُ وَمَالَهُ لِرَسُولِ اللَّهِ. ثُمَّ أَخَذَ بِيَدِ عَلِيٍّ كَرَّمَ اللَّهُ وَجْهَهُ فَقَالَ: مَرْحَبًا بِابْنِ عَمِّ رَسُولِ اللَّهِ وَخَتَنِهِ، سَيِّدِ بَنِي هَاشِمٍ مَا خَلَا رَسُولَ اللَّهِ. ثُمَّ افْتَرَقُوا. فَقَالَ عَبْدُ اللَّهِ لِأَصْحَابِهِ: كَيْفَ رَأَيْتُمُونِي فَعَلْتُ؟ فَإِذَا رَأَيْتُمُوهُمْ فَافْعَلُوا كَمَا فَعَلْتُ فَأَثْنَوْا عَلَيْهِ خَيْرًا. فَرَجَعَ الْمُسْلِمُونَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَخْبَرُوهُ بِذَلِكَ. فَأَنْزَلَ اللَّهُ هَذِهِ الآية.</p><p>(٢٦) إسناده واه جداً: محمد بن مروان بن السائب عن الكلبي عن أبي صالح، أطلق العلماء على هذا الإسناد: سلسلة الكذب أ. هـ.</p><p>والأثر ذكره السيوطي في الدر (١/ ٣١) وعزاه للواحدي والثعلبي بسند واه.</p>"
  }, {
    "id": 6,
    "sura": 2,
    "aya": 21,
    "text": "<p>قوله: يا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ. [٢١] .«٢٧» -[أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الزَّاهِدُ، أخبرنا أبو عَلِيُّ بْنُ أَحْمَدَ الْفَقِيهُ، أَخْبَرَنَا أَبُو تُرَابٍ الْقُهُسْتَانِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ] ، [عَنْ عَلْقَمَةَ قَالَ:كُلُّ شَيْءٍ نَزَلَ فِيهِ يَا أيها الناس، فهو مكي، ويا أَيُّهَا الذين آمنوا، فهو مدني.][يعني أن يَا أَيُّهَا الناس خِطَابُ أهل مكة، ويا أيها الذين آمنوا خطاب أَهْلِ المدينة. فقوله: يا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ خِطَابٌ لِمُشْرِكِي مَكَّةَ إِلَى قَوْلِهِ:وَبَشِّرِ الَّذِينَ آمَنُوا. وَهَذِهِ الْآيَةُ نَازِلَةٌ فِي الْمُؤْمِنِينَ، وَذَلِكَ: أَنَّ اللَّهَ تَعَالَى لَمَّا ذَكَرَ جَزَاءَ الْكَافِرِينَ بِقَوْلِهِ: النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ ذَكَرَ جَزَاءَ الْمُؤْمِنِينَ] .</p><p>(٢٧) عزاه في الدر (١/ ٣٣) لأبي عبيد وابن أبي شيبة وعبد بن حميد وابن الضريس وابن المنذر وأبي الشيخ.</p>"
  }, {
    "id": 6,
    "sura": 2,
    "aya": 26,
    "text": "<p>[٩] قوله تعالى: / بقره ٢٦ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا. [٢٦] .«٢٨» -[[قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ أَبِي صَالِحٍ] : لَمَّا ضَرَبَ اللَّهُ تَعَالَى هَذَيْنِ الْمَثَلَيْنِ لِلْمُنَافِقِينَ، يَعْنِي قَوْلَهُ: مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا وَقَوْلَهُ: أَوْ كَصَيِّبٍ مِنَ السَّمَاءِ- قَالُوا: اللَّهُ أَجَلُّ وَأَعْلَى مِنْ أَنْ يَضْرِبَ الْأَمْثَالَ. فَأَنْزَلَ اللَّهُ هذه الآية.]«٢٩» -[بقره ٢٦ وَقَالَ الْحَسَنُ وَقَتَادَةُ: لَمَّا ذَكَرَ اللَّهُ الذُّبَابَ وَالْعَنْكَبُوتَ فِي كِتَابِهِ، وَضَرَبَ لِلْمُشْرِكِينَ [بِهِ] الْمَثَلَ- ضَحِكَتِ الْيَهُودُ وَقَالُوا: مَا يُشْبِهُ هَذَا كَلَامَ اللَّهِ، فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.]«٣٠» -[أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْحَافِظُ فِي كِتَابِهِ، أَخْبَرَنَا سُلَيْمَانُ بْنُ أَيُّوبَ الطَّبَرَانِيُّ، حَدَّثَنَا بَكْرُ بْنُ سَهْلٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ سَعِيدٍ، عَنْ مُوسَى بْنِ عَبْدِ الرَّحْمَنِ عَنِ ابْنِ جُرَيْجٍ، عن عطاء،] [بقره ٢٦ عَنْ ابْنِ عَبَّاسٍ فِي قَوْلِهِ تَعَالَى:إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا قَالَ:وَذَلِكَ أَنَّ اللَّهَ ذَكَرَ آلِهَةَ الْمُشْرِكِينَ فَقَالَ وَإِنْ يَسْلُبْهُمُ الذُّبَابُ شَيْئًا وَذَكَرَ كَيْدَ الْآلِهَةِ فَجَعَلَهُ كَبَيْتِ الْعَنْكَبُوتِ، فَقَالُوا: أَرَأَيْتَ حَيْثُ ذَكَرَ اللَّهُ الذُّبَابَ وَالْعَنْكَبُوتَ فِيمَا أَنْزَلَ مِنَ الْقُرْآنِ عَلَى مُحَمَّدٍ، أَيُّ شَيْءٍ يَصْنَعُ بِهَذَا؟ فَأَنْزَلَ للَّهُ هَذِهِ الْآيَةَ.]</p><p>(٢٨) أبو صالح لم يسمع ابن عباس فهو منقطع.</p><p>وأخرجه ابن جرير (١/ ١٣٨) .</p><p>(٢٩) مرسل.</p><p>(٣٠) إسناده ضعيف: في إسناده ابن جريح وهو مدلس وقد عنعنه.</p>"
  }, {
    "id": 7,
    "sura": 2,
    "aya": 44,
    "text": "(١) - قَوْلُهُ تَعَالَى: {أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ} {٤٤} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الْكَلْبِيِّ عَنْ أَبِي صَالِحٍ بِالْإِسْنَادِ الَّذِي ذُكِرَ: نَزَلَتْ فِي يَهُودِ أَهْلِ الْمَدِينَةِ، كَانَ الرَّجُلُ مِنْهُمْ يَقُولُ لِصِهْرِهِ وَلِذَوِي قَرَابَتِهِ وَلِمَنْ بَيْنَهُمْ وَبَيْنَهُ رَضَاعٌ مِنَ الْمُسْلِمِينَ: اثْبُتْ عَلَى الدِّينِ الَّذِي أَنْتَ عَلَيْهِ وَمَا يَأْمُرُكَ بِهِ وهذا الرَّجُلُ يَعْنُونَ مُحَمَّدًا - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَإِنَّ أَمْرَهُ حَقٌّ، فَكَانُوا يَأْمُرُونَ النَّاسَ بِذَلِكَ وَلَا يَفْعَلُونَهُ. (١) - قد تقدم أن هذا إسناد هالك (راجع الآية: ١٤ من سورة البقرة) ويغني عنه ما أخرجه عبد بن حميد (فتح القدير: ١/٧٩) (العجاب في بيان الأسباب لابن حجر: ورقة ١٠ ب) عن قتادة أنها نزلت في أهل الكتاب. وهو مرسل صحيح الإسناد."
  }, {
    "id": 8,
    "sura": 2,
    "aya": 45,
    "text": "قَوْلُهُ تَعَالَى: {وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ} {٤٥} .عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ أَنَّ هَذِهِ الْآيَةَ خِطَابٌ لِأَهْلِ الْكِتَابِ وَهُوَ مَعَ ذَلِكَ أَدَبٌ لِجَمِيعِ الْعِبَادِ. وَقَالَ بَعْضُهُمْ: رَجَعَ بِهَذَا الْخِطَابِ إِلَى خِطَابِ الْمُسْلِمِينَ وَالْقَوْلُ الْأَوَّلُ أَظْهَرُ."
  }, {
    "id": 9,
    "sura": 2,
    "aya": 62,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا} الْآيَةَ {٦٢} .أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أحمد الحافظ قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ جعفر الحافظ قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ العسكري قال: حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ قَالَ: قَالَ ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ مُجَاهِدٍ قَالَ: لَمَّا قَصَّ سَلْمَانُ عَلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قِصَّةَ أَصْحَابِ الدَّيْرِ قَالَ: \"هُمْ فِي النَّارِ\" قَالَ سَلْمَانُ: فَأَظْلَمَتْ عَلَيَّ الْأَرْضُ فَنَزَلَتْ: {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا} إِلَى قَوْلِهِ: {يَحْزَنُونَ} قَالَ: فَكَأَنَّمَا كُشِفَ عَنِّي جَبَلٌ.</p><p>(٢) - أَخْبَرَنَا محمد بن عبد العزيز المروزي قال: أخبرنا مُحَمَّدُ بْنُ الحسين الحدادي قال: أَخْبَرَنَا أَبُو يَزِيدَ أَخْبَرَنَا إِسْحَاقُ بن إبراهيم قال: أَخْبَرَنَا عَمْرٌو عَنْ أَسْبَاطٍ عَنِ السُّدِّيِّ {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا} الْآيَةَ. قَالَ: نَزَلَتْ فِي أَصْحَابِ سَلْمَانَ الْفَارِسِيِّ لَمَّا قَدِمَ سَلْمَانُ عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - جَعَلَ يُخْبِرُ عَنْ عِبَادَتِهِمْ وَاجْتِهَادِهِمْ وَقَالَ: يَا رَسُولَ اللَّهِ كَانُوا يُصَلُّونَ وَيَصُومُونَ وَيُؤْمِنُونَ بِكَ وَيَشْهَدُونَ أَنَّكَ تُبْعَثُ نَبِيًّا. فَلَمَّا فَرَغَ سَلْمَانُ مِنْ ثَنَائِهِ عَلَيْهِمْ قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"يَا سَلْمَانُ هُمْ مِنْ أَهْلِ النَّارِ فَأَنْزَلَ اللَّهُ {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا} وَتَلَا إِلَى قَوْلِهِ: {وَلَا هُمْ يَحْزَنُونَ} \".(٣) - أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ مُحَمَّدِ بن جعفر قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بن زكرياء قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الدغولي قال: أَخ وَعَنْ نَاسٍ مِنْ أَصْحَابِ النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا} الْآيَةَ، نَزَلَتْ هَذِهِ الْآيَةُ فِي سَلْمَانَ الْفَارِسِيِّ، وَكَانَ من أهل جندي سابور مِنْ أَشْرَافِهِمْ وَمَا بَعْدَ هَذِهِ الْآيَةِ نَازِلَةٌ فِي الْيَهُودِ.ْبَرَنَا أَبُو بَكْرِ بْنُ أبي خيثمة قال: حَدَّثَنَا عَمْرُو بن حماد قال: حَدَّثَنَا أَسْبَاطٌ عَنِ السُّدِّيِّ عَنْ أَبِي مَالِكٍ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ وَعَنْ مُرَّةَ عَنِ ابْنِ مَسْعُودٍ،</p><p>(١) - صححه الحافظ ابن حجر في \"العجاب\" (ورقة ١١ أ) ولعله لتعدد طرقه، وإلا فإن فيه تدليس ابن جريج وقد عنعن (روى الحديث بصيغة: عن) ، ويشهد له الرواية القادمة.</p><p>(٢) - أخرجه ابن جربر (١/٢٥٤) وابن أبي حاتم (لباب النقول: ٢٠) من طريق عمرو بن حماد به. وقواه الحافظ ابن حجر (العجاب: ورقة ١١ أ) ولعله لتعدد الطرق، وإلا فهو ضعيف الإسناد ومعضل، وذلك لضعف أسباط (تقريب التهذيب: ١/٥٣ - رقم: ٣٦٢) ، (ديوان الضعفاء للذهبي: ١٦ - رقم: ٣٠٦) ، وانقطاع السند بين السديّ وزمن القصة. وقد ضعف هذا السند الإمام ابن جرير في تفسيره (جامع البيان: ١/١٢١) وانظر مقدمة تحقيق السيد صقر لهذا الكتاب (٢٩) .</p><p>(٣) - يقال في هذه الرواية ما قيل فيما قبلها، ويشهد للروايات السابقة: ما أخرجه ابن أبي حاتم (تفسير ابن كثير: ١/١٠٣) والعدني في مسنده (لباب النقول: ١٩) عن مجاهد نحوه مختصرا وصححه الحافظ ابن حجر (العجاب: ورقة ١١ أ) وليس هو بصحيح للانقطاع بين ابن أبي نجيح ومجاهد (تهذيب التهذيب: ٦/٥٤) بالإضافة إلى أنه لم يذكر سلمان رضي الله عنه فيمن لقيهم مجاهد (تهذيب التهذيب: ١٠/٤٢) (الجرح والتعديل لابن أبي حاتم: ٨/٣١٩ - رقم: ١٤٦٩) ، فالإسناد منقطع، وبانضمام هذه الروايات إلى بعض تتقوى وتصل لدرجة الحسن، لا الصحة، والله أعلم.</p>"
  }, {
    "id": 10,
    "sura": 2,
    "aya": 79,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ} الْآيَةَ {٧٩} .نَزَلَتْ فِي الَّذِينَ غَيَّرُوا صِفَةَ النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَبَدَّلُوا نَعْتَهُ، قَالَ الْكَلْبِيُّ بِالْإِسْنَادِ الَّذِي ذَكَرْنَا: إِنَّهُمْ غَيَّرُوا صِفَةَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي كِتَابِهِمْ وَجَعَلُوهُ آدَمَ سِبْطًا طَوِيلًا، وَكَانَ رَبْعَةً أَسْمَرَ، وَقَالُوا لِأَصْحَابِهِمْ وَأَتْبَاعِهِمْ: انْظُرُوا إِلَى صِفَةِ النَّبِيِّ، الَّذِي يُبْعَثُ فِي آخِرِ الزَّمَانِ، لَيْسَ يُشْبِهُ نَعْتَ هَذَا، وَكَانَتْ لِلْأَحْبَارِ وَالْعُلَمَاءِ مَأْكَلَةٌ مِنْ سَائِرِ الْيَهُودِ، فخافوا أن يذهبوا مَأْكَلَتُهُمْ إِنْ بَيَّنُوا الصِّفَةَ، فَمِنْ ثَمَّ غَيَّرُوا.</p><p>(١) - يغني عنه مما في معناه ما أخرجه النسائي وابن المنذر (فتح القدير: ١/١٠٦) والبخاري في \"خلق أفعال العباد\" (الصحيح المسند للوادعي: ١) عن ابن عباس رضي الله عنهما قال: نزلت في أهل الكتاب. وصححه الوادعي (المصدر السابق) ويشهد له:</p><p>ما أخرجه ابن أبي حاتم (فتح القدير: ١/١٠٦) من طريق عكرمة عن ابن عباس بمعناه مطولا نحو رواية الواحدي وقواه الحافظ ابن حجر (العجاب: ورقة ١٥/أ) .</p>"
  }, {
    "id": 11,
    "sura": 2,
    "aya": 80,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَقَالُوا لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً} {٨٠} .أَخْبَرَنَا إِسْمَاعِيلُ ابن أَبِي القاسم الصوفي قال: أَخْبَرَنَا أَبُو الْحُسَيْنِ مُحَمَّدُ بْنُ أحمد العطار قال: أَخْبَرَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ عبد الجبار قال: حدثني أَبُو الْقَاسِمِ عَبْدُ اللَّهِ بْنُ سعد الزهري قال: حَدَّثَنِي أَبِي وَعَمِّي قَالَا: حَدَّثَنَا أَبِي عَنِ ابن إسحاق قال: حدثني مُحَمَّدُ بْنُ أَبِي مُحَمَّدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ: قَدِمَ رَسُولُ الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - المدينة ويهود تَقُولُ: إِنَّمَا هَذِهِ الدُّنْيَا سَبْعَةُ آلَافِ سَنَةٍ، إنما يُعَذَّبُ النَّاسُ فِي النَّارِ لِكُلِّ أَلْفِ سَنَةٍ مِنْ أيام الدنيا يوم واحد فِي النَّارِ مِنْ</p><p>أَيَّامِ الْآخِرَةِ، وَإِنَّمَا هِيَ سَبْعَةُ أَيَّامٍ ثُمَّ يَنْقَطِعُ الْعَذَابُ، فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ مِنْ قَوْلِهِمْ: {وَقَالُوا لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً}.</p><p>(٢) - أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ مُحَمَّدٍ التَّمِيمِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ حَيَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الرَّازِيُّ حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا جُوَيْبِرٌ عَنِ الضَّحَّاكِ عَنِ ابْنِ عَبَّاسٍ: فِي قَوْلِهِ: \" وَقَالُوا لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً \" قَالَ وَجَدَ أَهْلُ الْكِتَابِ مَا بَيْنَ طَرَفَيْ جَهَنَّمَ مَسِيرَةَ أربعين عامًا قالوا: لَنْ نُعَذَّبَ فِي النَّارِ إِلَّا مَا وَجَدْنَا فِي التَّوْرَاةِ، فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ اقْتَحَمُوا فِي النَّارِ، فَسَارُوا فِي الْعَذَابِ حَتَّى انْتَهَوْا إِلَى سَقَرَ وَفِيهَا شَجَرَةُ الزَّقُّومِ، إِلَى آخِرِ يَوْمٍ مِنَ الْأَيَّامِ الْمَعْدُودَةِ، فَقَالَ لَهُمْ خَزَنَةُ النَّارِ: يَا أَعْدَاءَ اللَّهِ زَعَمْتُمْ أَنَّكُمْ لَنْ تُعَذَّبُوا فِي النَّارِ إِلَّا أَيَّامًا مَعْدُودَةً، فَقَدِ انْقَضَى الْعَدَدُ وَبَقِيَ الْأَبَدُ</p><p>(١) - أخرجه من طريق ابن إسحاق كذلك ابن جرير (١/٣٠٣) والطبراني في \"المعجم الكبير\" (١١/٩٦ - ح: ١١١٦٠) وابن أبي حاتم وابن المنذر (فتح القدير: ١/ ١٠٦) وإسناده حسن.</p><p>(٢) - إسناده ضعيف جدا لضعف جويبر (تقريب التهذيب: ١/١٣٦ - رقم: ١٣١) والانقطاع بين الضحاك وابن عباس (تهذيب التهذيب: ٤/٤٥٣) (الاتقان: ٢/١٨٩) ويغني عنه مما في معناه: ما أخرجه ابن جرير (١/٣٠٣) وعبد بن حميد وابن المنذر وابن أبي حاتم (فتح القدير: ١/١٠٦) عن عكرمة بمعناه مطوّلاً. هو مرسل ويشهد له:</p><p>١ - ما أخرجه ابن جرير (١/٣٠٢) عن قتادة بمعناه مختصرا مرسل وإسناده صحيح.</p><p>٢ - ما أخرجه ابن جرير (١/٣٠٢) من طريق الضحاك عن ابن عباس نحوه وإسناده ضعيف منقطع. وأخرج ابن جرير عن السدي وزيد بن أسلم بمعناه ومع أن كل هذه الطرق فيها ضعف فبتعضدها ببعضها تتقوى وتتحسّن والله أعلم.</p>"
  }, {
    "id": 12,
    "sura": 2,
    "aya": 85,
    "text": ""
  }, {
    "id": 13,
    "sura": 2,
    "aya": 89,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَكَانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا} {٨٩} .قَالَ ابْنُ عَبَّاسٍ كَانَتْ يَهُودُ خَيْبَرَ تُقَاتِلُ غَطَفَانَ، فَكُلَّمَا الْتَقَوْا هُزِمَتْ يَهُودُ خَيْبَرَ، فَعَاذَتِ الْيَهُودُ بِهَذَا الدُّعَاءِ وَقَالَتْ: اللَّهُمَّ إِنَّا نَسْأَلُكَ بِحَقِّ النَّبِيِّ الْأُمِّيِّ الَّذِي وَعَدْتَنَا أَنْ تُخْرِجَهُ لَنَا فِي آخِرِ الزَّمَانِ إِلَّا نَصَرْتَنَا عَلَيْهِمْ، قَالَ: فَكَانُوا إِذَا الْتَقَوْا دَعَوْا بِهَذَا الدُّعَاءِ، فَهَزَمُوا غَطَفَانَ، فَلَمَّا بُعِثَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - كَفَرُوا بِهِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {وَكَانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا} أَيْ بِكَ يَا مُحَمَّدُ، إِلَى قَوْلِهِ: {فَلَعْنَةُ اللَّهِ عَلَى الْكَافِرِينَ} وَقَالَ السُّدِّيُّ: كَانَتِ الْعَرَبُ تَمُرُّ بِيَهُودَ فَيَلْقَوْنَ مِنْهُمْ أَذًى، وَكَانَتِ الْيَهُودُ تَجِدُ نَعْتَ مُحَمَّدٍ فِي التَّوْرَاةِ، وَيَسْأَلُونَ اللَّهَ أَنْ يَبْعَثَهُ فَيُقَاتِلُونَ مَعَهُ الْعَرَبَ، فَلَمَّا جَاءَهُمْ مُحَمَّدٌ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - كَفَرُوا بِهِ حَسَدًا، وَقَالُوا: إِنَّمَا كَانَتِ الرُّسُلُ مِنْ بَنِي إِسْرَائِيلَ، فَمَا بَالُ هَذَا مِنْ بَنِي إِسْمَاعِيلَ.</p><p>(١) - يؤيده ما أخرجه ابن جرير (١/٣٢٥) وابن أبي حاتم (لباب النقول: ٢١) وأبو نعيم في \"الدلائل \" (١/١٩) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما أن يهود كانوا يستفتحون على الأوس والخزرج برسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قبل مبعثه، فلما بعثه الله من العرب كفروا به وجحدوا ما كانوا يقولون فيه ... الحديث. وإسناده حسن، ويشهد له: ما أخرجه ابن جرير (١/٣٢٥) وابن المنذر وأبو نعيم (فتح القدير: ١/١١٣) والبيهقي في \"الدلائل\" (٢/٧٥) من طريق إسحاق عن عاصم بن عمر بن قتادة عن أشياخ من الأنصار بمعناه. وحسنه الوادعي (الصحيح المسند: ٢) .</p>"
  }, {
    "id": 14,
    "sura": 2,
    "aya": 97,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {قُلْ مَنْ كَانَ عَدوًّا لِجِبْرِيلَ} الآية {٩٧} .أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أحمد الزاهد قال: أَخْبَرَنَا الْحَسَنُ بْنُ أحمد الشيباني قال: أَخْبَرَنَا الْمُؤَمَّلُ بْنُ الْحَسَنِ بن عيسى قال: حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بن سالم قال: أَخْبَرَنَا أبو نعيم قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ، عَنْ بُكَيْرٍ بن شِهَابٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: أَقْبَلَتِ الْيَهُودُ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالُوا: يَا أَبَا الْقَاسِمِ نَسْأَلُكَ عَنْ أَشْيَاءَ فَإِنْ أَجَبْتَنَا فِيهَا اتَّبَعْنَاكَ، أَخْبِرْنَا مَنِ الَّذِي يَأْتِيكَ مِنَ الْمَلَائِكَةِ؟ فَإِنَّهُ لَيْسَ مِنْ نَبِيٍّ إِلَّا يَأْتِيهِ مَلَكٌ مِنْ عِنْدِرَبِّهِ - عَزَّ وَجَلَّ - بِالرِّسَالَةِ بالوحيّ فَمَنْ صَاحِبُكَ؟ قَالَ: \"جِبْرِيلُ\" قَالُوا: ذَاكَ الَّذِي يَنْزِلُ بِالْحَرْبِ وَبِالْقِتَالِ، ذَاكَ عَدُوُّنَا لَوْ قُلْتَ مِيكَائِيلُ الذي ينزل بالمطر والرحمة اتبعناك، فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلْ مَنْ كَانَ عَدُوًّا لِجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَى قَلْبِكَ} إِلَى قَوْلِهِ: {فَإِنَّ اللَّهَ عَدُوٌّ لِلْكَافِرِينَ}</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/٧٣ - ح: ١١٥) والطبراني في \"المعجم الكبير\" (١٢/٤٥ - ح: ١٢٤٢٩) والنسائي (تفسير ابن كثير: ١/١٣٠) من طريق ابن شهاب به. وإسناده حسن بشواهده وهي:</p><p>١. ما أخرجه ابن جرير (١/٣٤٢) والإمام أحمد (الفتح الرباني: ١٨/٧٤) وعبد بن حميد (المصدر السابق) وأبو داود الطيالسي (منحة المعبود: ٢/١١ - ح: ١٩٢٣) وابن أبي حاتم وأبو نعيم (فتح القدير: ١/١١٧) والبيهقي (دلائل النبوة: ٦/٢٦٦) كلهم من طريق عبد الحميد بن بهرام عن شهر بن حوشب عن ابن عباس رضي الله عنهما نحوه وسنده حسن.</p><p>ما أخرجه الواحدي في الرواية القادمة وسيأتي تخريجها.</p>"
  }, {
    "id": 15,
    "sura": 2,
    "aya": 98,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {مَنْ كَانَ عَدُوًّا لِلَّهِ وَمَلَائِكَتِهِ} الْآيَةَ {٩٨} .أَخْبَرَنَا أَبُو بكر الأصفهاني قال: أَخْبَرَنَا أَبُو الشيخ الحافظ قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بن عثمان قال: حدثنا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنِ الشَّعْبِيِّ قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ - رَضِيَ اللَّهُ عَنْهُ - كُنْتُ آتِي الْيَهُودَ عِنْدَ دِرَاسَتِهِمُ التَّوْرَاةَ فَأَعْجَبُ مِنْ مُوَافَقَةِ الْقُرْآنِ التَّوْرَاةَ، وَمُوَافَقَةُ التَّوْرَاةِ الْقُرْآنَ، فَقَالُوا: يَا عُمَرُ مَا أَحَدٌ أَحَبُّ إِلَيْنَا مِنْكَ، قُلْتُ: وَلِمَ؟ قَالُوا: لِأَنَّكَ تَأْتِينَا وَتَغْشَانَا، قُلْتُ: إِنَّمَا أَجِيءُ لِأَعْجَبَ مِنْ تَصْدِيقِ كِتَابِ اللَّهِ بَعْضِهِ بَعْضًا وَمُوَافَقَةِ التَّوْرَاةِ الْقُرْآنَ، وَمُوَافِقَةِ القرآن التوراة، فبينما أَنَا عِنْدَهُمْ ذَاتَ يَوْمٍ إِذْ مَرَّ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - خَلْفَ ظهري، فقالوا: إن هَذَا صَاحِبُكَ فَقُمْ إِلَيْهِ، فَالْتَفَتَ إِلَيْهِ فَإِذَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَدْ دخل خوخة في الْمَدِينَةِ، فَأَقْبَلْتُ عَلَيْهِمْ فقلت: أنشدكم بالله وَمَا أَنْزَلَ عَلَيْكُمْ مِنْ كِتَابٍ أَتَعْلَمُونَ أَنَّهُ رَسُولُ اللَّهِ؟ فَقَالَ سَيِّدُهُمْ: قد نشدكم الله فَأَخْبِرُوهُ. فَقَالُوا: أَنْتَ سَيِّدُنَا فَأَخْبِرْهُ، فَقَالَ سَيِّدُهُمْ: إِنَّا نَعْلَمُ أَنَّهُ رَسُولُ الله قال: فقلت: فَأَنْتَ أَهْلَكُهُمْ إِنْ كُنْتُمْ تَعْلَمُونَ أَنَّهُ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ثُمَّ لَمْ تَتَّبِعُوهُ، قَالُوا: إِنَّ لَنَا عَدُوًّا مِنَ الْمَلَائِكَةِ وَسِلْمًا مِنَ الْمَلَائِكَةِ، فَقُلْتُ: مَنْ عَدُوُّكُمْ، وَمَنْ سِلْمُكُمْ؟ قَالُوا: عَدُوُّنَا جِبْرِيلُ وَهُوَ مَلَكُ الْفَظَاظَةِ وَالْغِلْظَةِ وَالْآصَارِوَالتَّشْدِيدِ؛ قُلْتُ: ومن سلمكم؟ قالوا: مِيكَائِيلُ وَهُوَ مَلَكُ الرَّأْفَةِ وَاللِّينِ وَالتَّيْسِيرِ قُلْتُ: فَإِنِّي أَشْهَدُ مَا يَحِلُّ لِجِبْرِيلَ أَنْ يُعَادِيَ سِلْمَ مِيكَائِيلَ، وَمَا يَحِلُّ لِمِيكَائِيلَ أَنْ يُسَالِمَ عدو جبريل، وإنهما جَمِيعًا وَمَنْ مَعَهُمَا أَعْدَاءٌ لِمَنْ عَادُوا وَسِلْمٌ لِمَنْ سَالَمُوا. ثُمَّ قُمْتُ فَدَخَلْتُ الْخَوْخَةَ الَّتِي دَخَلَهَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَاسْتَقْبَلَنِي فَقَالَ: يَا ابْنَ الخطاب ألا أقرؤك آيات نزلت عَلَيَّ قَبْلُ؟ قُلْتُ: بَلَى فَقَرَأَ: \" {قُلْ مَنْ كَانَ عَدُوًّا لِجِبْرِيلَ فَإِنَّهُ} الْآيَةَ حَتَّى بَلَغَ {وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ} \" قُلْتُ: وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا جِئْتُ إِلَّا أُخْبِرُكَ بِقَوْلِ الْيَهُودِ، فَإِذَا اللَّطِيفُ الْخَبِيرُ قَدْ سَبَقَنِي بِالْخَبَرِ. قَالَ عُمَرُ: فَلَقَدْ رَأَيْتُنِي أَشَدَّ فِي دِينِ اللَّهِ مِنْ حَجَرٍ.وَقَالَ ابْنُ عَبَّاسٍ: إِنَّ حَبْرًا مِنْ أَحْبَارِ الْيَهُودِ مِنْ فَدَكَ يُقَالُ لَهُ: عَبْدُ اللَّهِ بْنُ صوريا حاج النبيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَسَأَلَهُ عَنْ أَشْيَاءَ فَلَمَّا اتَّجَهَتِ الْحُجَّةُ عَلَيْهِ قَالَ: أيَّ ملك يأتي مِنَ السَّمَاءِ؟ قَالَ: جِبْرِيلُ: وَلَمْ يَبْعَثِ اللَّهُ نَبِيًّا إِلَّا وَهُوَ وَلِيُّهُ قَالَ: ذَاكَ عَدُوُّنَا مِنَ الْمَلَائِكَةِ، وَلَوْ كَانَ مِيكَائِيلُ مَكَانَهُ لَآمَنَّا بِكَ، إن جبريل نزل بِالْعَذَابِ والقتال والشدة، فإنه عَادَانَا مِرَارًا كَثِيرَةً، وَكَانَ أَشَدُّ ذَلِكَ عَلَيْنَا أَنَّ اللَّهَ أَنْزَلَ عَلَى نَبِيِّنَا أَنَّ بَيْتَ الْمَقْدِسِ سَيُخَرَّبُ عَلَى يَدَيْ رَجُلٍ يُقَالُ لَهُ بُخْتُنَصَّرَ، وَأَخْبَرَنَا بِالْحِينِ الَّذِي يُخَرَّبُ فِيهِ، فَلَمَّا كَانَ وَقْتُهُ بَعَثْنَا رَجُلًا مِنْ أَقْوِيَاءِ بَنِي إِسْرَائِيلَ فِي طَلَبِ بُخْتُنَصَّرَ لِيَقْتُلَهُ، فَانْطَلَقَ يَطْلُبُهُ حَتَّى لَقِيَهُ بِبَابِلَ غُلَامًا مِسْكِينًا لَيْسَتْ لَهُ قُوَّةٌ، فَأَخَذَهُ صَاحِبُنَا لِيَقْتُلَهُ فَدَفَعَ عَنْهُ جِبْرِيلُ، وَقَالَ لِصَاحِبِنَا: إِنْ كَانَ رَبُّكُمُ الَّذِي أَذِنَ في هلاككم فلا تُسَلَّطَ عَلَيْهِ، وَإِنْ لَمْ يَكُنْ هَذَا فَعَلَى أَيِّ شَيْءٍ تَقْتُلُهُ؟ فَصَدَّقَهُ صَاحِبُنَا وَرَجَعَ إِلَيْنَا، وَكَبُرَ بُخْتُنَصَّرَ وَقَوِيَ وَغَزَانَا وَخَرَّبَ بَيْتَ الْمَقْدِسِ، فَلِهَذَا نَتَّخِذُهُ عَدُوًّا فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.وَقَالَ مُقَاتِلٌ: قَالَتِ الْيَهُودُ: إِنَّ جِبْرِيلَ عَدُوُّنَا أُمِرَ أَنْ يَجْعَلَ النُّبُوَّةَ فِينَا فَجَعَلَهَا فِي غَيْرِنَا، فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (١/٣٤٣، ٣٤٤) من طريق داود به. وفيه انقطاع بين الشعبي وعمر رضي الله عنه (تفسير ابن كثير: ١/١٣١) (تهذيب التهذيب: ٥/٦٨) . وله شواهد عند ابن جرير (١/٣٤٨ ٣٤٩) وابن أبي حاتم (تفسير ابن كثير: ١/١٣١) وغيرهما، لكنها لا تخلو من مقال، وعلى كل حال فهي تدل عن أن هذا القول صدر عن اليهود، ولا مانع أن يتعدد السبب، فيكون قد حدث مرة مع النبي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ومرة مع عمر رضي الله عنه، وهو الأرجح. لا سيما وقد قوّى الحافظ ابن حجر قصة عمر مع اليهود بطرقها (فتح الباري: ٨/١٦٦) .</p>"
  }, {
    "id": 16,
    "sura": 2,
    "aya": 99,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَقَدْ أَنْزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ} {٩٩} .قَالَ ابْنُ عَبَّاسٍ: هَذَا جَوَابٌ لِابْنِ صُورِيَّا حَيْثُ قَالَ لِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يَا مُحَمَّدُ مَا جِئْتَنَا بِشَيْءٍ نَعْرِفُهُ، ما أُنْزِلَ عَلَيْكَ مِنْ آية بيّنة فنتبعك، بِهَا فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.</p><p>(١) - أسنده ابن جرير (١/٣٥٠) وابن أبي حاتم (لباب النقول: ٢٣) من طريق ابن إسحاق بسنده إلى ابن عباس رضي الله عنهما. وهو حسن.</p>"
  }, {
    "id": 17,
    "sura": 2,
    "aya": 102,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَى مُلْكِ سلَيْمَانَ} الآية {١٠٢} .أخبرني مُحَمَّدُ بْنُ عَبْدِ العزيز القنطري قال: أَخْبَرَنَا أَبُو الفضل الحدادي قال: أَخْبَرَنَا أَبُو يزيد الخالدي قال: أَخْبَرَنَا إِسْحَاقُ بن إبراهيم قال: حدثنا جرير قال: أَخْبَرَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عِمْرَانَ بْنِ الْحَارِثِ قَالَ: بَيْنَمَا نَحْنُ عِنْدَ ابْنِ عَبَّاسٍ إِذْ قَالَ: إِنَّ الشَّيَاطِينَ كَانُوا يَسْتَرِقُونَ السَّمْعَ مِنَ السَّمَاءِ، فَيَجِيءُ أَحَدُهُمْ بِكَلِمَةِ حَقٍّ فَإِذَا جَرَّبَ مِنْ أَحَدِهِمُ الصِّدْقَ كَذَبَ مَعَهَا سَبْعِينَ كَذْبَةً فَيُشْرِبُهَا قُلُوبَ النَّاسِ، فَاطَّلَعَ عَلَى ذَلِكَ سُلَيْمَانُ، فَأَخَذَهَا فَدَفَنَهَا تَحْتَ الْكُرْسِيِّ؛ فَلَمَّا مَاتَ سُلَيْمَانُ قَامَ شَيْطَانٌ بِالطَّرِيقِ فَقَالَ: أَلَا أَدُلُّكُمْ عَلَى كنز سليمان المنيع الَّذِي لَا كَنْزَ لَهُ مِثْلُهُ؟ قَالُوا: نَعَمْ قَالَ: تَحْتَ الْكُرْسِيِّ فَأَخْرَجُوهُ، فَقَالُوا: هَذَا سِحْرٌ. فَتَنَاسَخَتْهُ الْأُمَمُ فَأَنْزَلَ اللَّهُ عُذْرَ سُلَيْمَانَ {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَى مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ}وَقَالَ الْكَلْبِيُّ: إِنَّ الشَّيَاطِينَ كتبوا السحر والنارنجيات عَلَى لِسَانِ آصِفَ: هَذَا مَا عَلَّمَ آصِفُ بْنُ بَرْخِيَا الْمَلِكَ ثُمَّ دَفَنُوهَا تَحْتَ مُصَلَّاهُ حِينَ نَزَعَ اللَّهُ مُلْكَهُ، وَلَمْ يَشْعُرْ بذلك سليمان؛ ولما مَاتَ سُلَيْمَانُ اسْتَخْرَجُوهُ مِنْ تَحْتِ مُصَلَّاهُ، وَقَالُوا لِلنَّاسِ: إِنَّمَا مَلَكَكُمْ سُلَيْمَانُ بِهَذَا فَتَعَلَّمُوهُ، فَأَمَّا عُلَمَاءُ بَنِي إِسْرَائِيلَ فَقَالُوا: مَعَاذَ اللَّهِ أَنْ يَكُونَ هَذَا عِلْمَ سُلَيْمَانَ،وَأَمَّا السَّفَلَةُ فَقَالُوا: هَذَا عِلْمُ سُلَيْمَانَ، وَأَقْبَلُوا عَلَى تَعَلُّمِهِ، ورفضوا كتب أنبيائها فَفَشَتِ الْمَلَامَةُ لِسُلَيْمَانَ، فَلَمْ تَزَلْ هَذِهِ حَالُهُمْ حَتَّى بَعَثَ الله محمدًا - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وأنزل اللَّهُ، عُذْرَ سُلَيْمَانَ عَلَى لِسَانِهِ وَأَظْهَرَ بَرَاءَتَهُ مِمَّا رُمِيَ بِهِ فَقَالَ: {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ} الْآيَةَ.</p><p>(٢) - أَخْبَرَنَا سَعِيدُ بْنُ الْعَبَّاسِ الْقُرَشِيُّ كِتَابَةً أَنَّ الْفَضْلَ بْنَ زَكَرِيَّاءَ حَدَّثَهُمْ عَنْ أَحْمَدَ بْنِ نَجْدَةَ أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَتَّابُ بن بشير عن خُصَيْفٌ قَالَ: كَانَ سُلَيْمَانُ إِذَا نَبَتَتِ الشَّجَرَةُ قَالَ: لِأَيِّ دَاءٍ أَنْتِ؟ فَتَقُولُ لِكَذَا وَكَذَا؛ فَلَمَّا نَبَتَتْ شَجَرَةُ الْخُرْنُوبَةِ قَالَ: لِأَيِّ شَيْءٍ أَنْتِ؟ قَالَتْ: لِمَسْجِدِكَ أُخَرِّبُهُ قَالَ: تُخَرِّبِينَهُ؟ قَالَتْ: نَعَمْ، قَالَ: بِئْسَ الشَّجَرَةِ أَنْتِ، فَلَمْ يَلْبَثْ أَنْ تُوُفِّيَ، فَجَعَلَ النَّاسُ يَقُولُونَ فِي مَرْضَاهُمْ: لَوْ كَانَ لَنَا مِثْلُ سُلَيْمَانَ، فَأَخَذَتِ الشَّيَاطِينُ فكتبوا كتابًا وجعلوه فِي مُصَلَّى سُلَيْمَانَ وَقَالُوا: نَحْنُ نَدُلُّكُمْ عَلَى مَا كَانَ سُلَيْمَانُ يُدَاوِي بِهِ فَانْطَلَقُوا فَاسْتَخْرَجُوا ذَلِكَ الْكِتَابَ فَإِذَا فِيهِ سِحْرٌ رُقَى فَأَنْزَلَ اللَّهُ تَعَالَى: {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَى مُلْكِ سُلَيْمَانَ} إِلَى قَوْلِهِ: {فَلَا تَكْفُرْ} .قَالَ السُّدِّيُّ: إِنَّ النَّاسَ فِي زَمَنِ سُلَيْمَانَ اكْتَتَبُوا السِّحْرَ فَاشْتَغَلُوا بِتَعَلُّمِهِ فَأَخَذَ سُلَيْمَانُ تِلْكَ الْكُتُبَ وَجَعَلَهَا فِي صُنْدُوقٍ فَدَفَنَهَا تَحْتَ كُرْسِيِّهِ وَنَهَاهُمْ عن ذلك ولما مَاتَ سُلَيْمَانُ وَذَهَبَ الَّذِينَ كَانُوا يَعْرِفُونَ دفنه الكتب، فتمثل شَيْطَانٌ عَلَى صُورَةِ إِنْسَانٍ فَأَتَى نَفَرًا مِنْ بني إسرائيل وقال: هَلْ أَدُلُّكُمْ عَلَى كَنْزٍ لَا تَأْكُلُونَهُ أَبَدًا؟ قَالُوا: نَعَمْ، قَالَ: فَاحْفُرُوا تَحْتَ الْكُرْسِيِّ فَحَفَرُوا فَوَجَدُوا تِلْكَ الْكُتُبَ فَلَمَّا أَخْرَجُوهَا قَالَ الشَّيْطَانُ: إن سليمان ضبط الْجِنَّ والإنس والشياطين والطيور بِهَذَا، فَاتَّخَذَ بَنُو إِسْرَائِيلَ تِلْكَ الْكُتُبَ، فَلِذَلِكَ أَكْثَرُ مَا يُوجَدُ السِّحْرُ فِي الْيَهُودِ، فَبَرَّأَ اللَّهُ - عَزَّ وَجَلَّ - سُلَيْمَانَ مِنْ ذَلِكَ وَأَنْزَلَ هَذِهِالْآيَةَ.</p><p>(١) - انظر تخريجه وطرقه في تفسير ابن كثير (١/١٣٤ - ١٣٦).</p><p>(٢) - إسناده ضعيف لإعضاله (انقطاع أكثر من اثنين متتاليين) ولضعف خصيف (تقريب التهذيب: ١/٢٢٤ - رقم: ١٢٦) ولضعف رواية عتاب بن بشير عن خصيف خاصة (تهذيب التهذيب: ٧/٩١) .</p>"
  }, {
    "id": 18,
    "sura": 2,
    "aya": 104,
    "text": "<p>(١) - قوله تعالى: {يَا أَيّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا} الْآيَةَ {١٠٤} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ عَطَاءٍ: وَذَلِكَ أَنَّ الْعَرَبَ كَانُوا يَتَكَلَّمُونَ بِهَا، فَلَمَّا سَمِعَتْهُمُ الْيَهُودُ يَقُولُونَهَا لِلنَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَعْجَبَهُمْ ذَلِكَ وَكَانَ {رَاعِنَا} فِي كلام اليهود سبًّا قبيحًا فَقَالُوا: إِنَّا كُنَّا نَسُبُّ مُحَمَّدًا سِرًّا فَالْآنَ أَعْلَنُوا السَّبَّ لِمُحَمَّدٍ لِأَنَّهُ مِنْ كَلَامِهِمْ، فَكَانُوا يَأْتُونَ نَبِيَّ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَيَقُولُونَ: يَا مُحَمَّدُ {رَاعِنَا} وَيَضْحَكُونَ فَفَطِنَ بِهَا رَجُلٌ مِنَ الْأَنْصَارِ وَهُوَ سَعْدُ بْنُ عُبَادَةَ وَكَانَ عَارِفًا بلغة اليهود وقال: يَا أَعْدَاءَ اللَّهِ عَلَيْكُمْ لَعْنَةُ اللَّهِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَئِنْ سَمِعْتُهَا مِنْ رَجُلٍ مِنْكُمْ لَأَضْرِبَنَّ عُنُقَهُ فَقَالُوا: أَلَسْتُمْ تَقُولُونَهَا لَهُ؟ فَأَنْزَلَ الله تعالى: {يَا أَيّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا} الْآيَةَ.قَوْلُهُ تَعَالَى: {مَا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ} الْآيَةَ {١٠٥} .قَالَ الْمُفَسِّرُونَ: إِنَّ الْمُسْلِمِينَ كَانُوا إِذَا قَالُوا لِحُلَفَائِهِمْ مِنَ الْيَهُودِ: آمِنُوا بِمُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالُوا: هَذَا الَّذِي تَدْعُونَنَا إِلَيْهِ لَيْسَ بِخَيْرٍ مِمَّا نَحْنُ عَلَيْهِ وَلَوَدِدْنَا لَوْ كَانَ خَيْرًا فَأَنْزَلَ اللَّهُ تَعَالَى تَكْذِيبًا لَهُمْ هَذِهِ الْآيَةَ.</p><p>(١) - أخرج ابن جرير (١/٣٧٤) وابن أبي حاتم (العجاب: ورقة ٣٥ أ) عن عطاء قال: كانت لغة في الأنصار في الجاهلية فنزلت هذه الآية. وقواه الحافظ ابن حجر في \"العجاب\" (ورقة ٣٥ أ) ويشهد له: ما أخرجه ابن جرير (٢/٣٧٤) عن قتادة بمعناه. وهو مرسل صحيح الإسناد.</p>"
  }, {
    "id": 19,
    "sura": 2,
    "aya": 105,
    "text": "قَوْلُهُ تَعَالَى: {مَا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ} الْآيَةَ {١٠٥} .قَالَ الْمُفَسِّرُونَ: إِنَّ الْمُسْلِمِينَ كَانُوا إِذَا قَالُوا لِحُلَفَائِهِمْ مِنَ الْيَهُودِ: آمِنُوا بِمُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالُوا: هَذَا الَّذِي تَدْعُونَنَا إِلَيْهِ لَيْسَ بِخَيْرٍ مِمَّا نَحْنُ عَلَيْهِ وَلَوَدِدْنَا لَوْ كَانَ خَيْرًا فَأَنْزَلَ اللَّهُ تَعَالَى تَكْذِيبًا لَهُمْ هَذِهِ الْآيَةَ."
  }, {
    "id": 20,
    "sura": 2,
    "aya": 106,
    "text": "قَوْلُهُ تَعَالَى: {مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا} {١٠٦} .قَالَ الْمُفَسِّرُونَ: إِنَّ المشركين قالوا: أتَرَون إِلَى مُحَمَّدٍ يَأْمُرُ أَصْحَابَهُ، بِأَمْرٍ ثُمَّ يَنْهَاهُمْ عَنْهُ وَيَأْمُرُهُمْ بِخِلَافِهِ وَيَقُولُ الْيَوْمَ قَوْلًا ويرجع عنه عَنْهُ غَدًا مَا هَذَا الْقُرْآنُ إِلَّا كَلَامَ مُحَمَّدٍ يَقُولُهُ مِنْ تِلْقَاءِ نَفْسِهِ وَهُوَ كَلَامٌ يُنَاقِضُ بَعْضَهُ بَعْضًا فَأَنْزَلَ اللَّهُ: {وَإِذَا بَدَّلْنَا آيَةً مَكَانَ آيَةٍ}[النحل: ١٠١] . الْآيَةَ: وَأَنْزَلَ أَيْضًا: {مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا} الْآيَةَ."
  }, {
    "id": 21,
    "sura": 2,
    "aya": 108,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {أَمْ تُرِيدُونَ أَنْ تَسْأَلُوا رَسُولَكُمْ} الْآيَةَ {١٠٨} .قَالَ ابْنُ عَبَّاسٍ نَزَلَتْ هَذِهِ الْآيَةُ فِي عَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ وَرَهْطٍ مِنْ قُرَيْشٍ، قَالُوا: يَا مُحَمَّدُ اجْعَلْ لَنَا الصَّفَا ذَهَبًا، وَوَسِّعْ لَنَا أَرْضَ مَكَّةَ، وَفَجِّرِ الْأَنْهَارَ خِلَالَهَا تَفْجِيرًا نُؤْمِنْ بِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(٢) - وَقَالَ الْمُفَسِّرُونَ: إِنَّ الْيَهُودَ وَغَيْرَهُمْ مِنَ الْمُشْرِكِينَ تَمَنَّعُوا عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَمِنْ قائل يقول: يأتينا بِكِتَابٍ مِنَ السَّمَاءِ جُمْلَةً كَمَا أَتَى مُوسَى بِالتَّوْرَاةِ، وَمِنْ قَائِلٍ يَقُولُ - وَهُوَ عَبْدُ اللَّهِ بْنُ أَبِي أُمَية المخزومي - إئتني بِكِتَابٍ مِنَ السَّمَاءِ فِيهِ: مِنْ رَبِّ الْعَالَمِينَ، إِلَى ابْنِ أَبِي أُمية، اعلم أني قَدْ أَرْسَلْتُ مُحَمَّدًا إِلَى النَّاسِ؛ وَمِنْ قَائِلٍ يَقُولُ: لَنْ نُؤْمِنَ لَكَ أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلَائِكَةِ قَبِيلًا فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أخرج معناه ابن جرير (١/٣٨٥) وعبد بن حميد وابن المنذر وابن أبي حاتم (فتح القدير: ١/١٢٩) والفريابي (العجاب: ورقة ٣٧ أ) من طريق ابن أبي نجيح عن مجاهد مرسلا وصححه الحافظ ابن حجر (المصدر السابق) .</p><p>قلت: في سماع ابن أبي نجيح من مجاهد نظر (تهذيب التهذيب: ٦/٥٤) .</p><p>(٢) - أخرج ابن جرير (١/٣٨٥) وابن أبي حاتم (لباب النقول: ٢٥) من طريق ابن إسحاق بسنده إلى ابن عباس رضي الله عنهما أن قائل ذلك من اليهود: رافع بن حريملة ووهب بن زيد بنحو ما في الكتاب. وسنده حسن.</p>"
  }, {
    "id": 22,
    "sura": 2,
    "aya": 109,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ} الْآيَةَ {١٠٩} .قَالَ ابْنُ عَبَّاسٍ: نَزَلَتْ فِي نَفَرٍ مِنَ الْيَهُودِ قَالُوا لِلْمُسْلِمِينَ بعد وقعة بدر (١) أَلَمْ تَرَوْا إِلَى مَا أَصَابَكُمْ وَلَوْ كُنْتُمْ عَلَى الْحَقِّ مَا هُزِمْتُمْ، فَارْجِعُوا إِلَى دِينِنَا فَهُوَ خَيْرٌ لَكُمْ.(٢) - أَخْبَرَنَا <p>الْحَسَنُ بْنُ محمد الفارسي قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بن الفضل قال: أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بن الحسن قال: حَدَّثَنَا مُحَمَّدُ بن يحيى قال: حَدَّثَنَا أبو اليمان قال: حدثنا شُعَيْبٌ عن الزهريّ قال: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ أَنَّ كَعْبَ بْنَ الْأَشْرَفِ الْيَهُودِيَّ، كَانَ شَاعِرًا وَكَانَ يَهْجُو النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَيُحَرِّضُ عَلَيْهِ كُفَّارَ قُرَيْشٍ فِي شِعْرِهِ، وَكَانَ الْمُشْرِكُونَ وَالْيَهُودُ مِنْ أَهْلِ الْمَدِينَةِ حِينَ قَدِمَهَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يُؤْذُونَ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَصْحَابَهُ أَشَدَّ الْأَذَى، فَأَمَرَ اللَّهُ تَعَالَى نَبِيَّهُ بِالصَّبْرِ عَلَى ذَلِكَ وَالْعَفْوِ عَنْهُمْ وَفِيهِمْ أُنْزِلَتْ: {وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ} إِلَى قَوْلِهِ: {فَاعْفُوا وَاصْفَحُوا}</p><p>(١) - هكذا بالنسخ ولعل صوابه: أحد؛ لأن بدرًا لم يهزم فيها المسلمون.</p><p>(٢) - أخرجه أبو داود في سننه (٣/٤٠١ - ح: ٣٠٠٠) وابن أبي حاتم (تفسير ابن كثير: (١/١٥٣) وابن المنذر (فتح القدير: ١/١٢٩) والبيهقي في \"الدلائل\" ٣/١٩٧) من طريق شعيب به وسنده صحيح (العجاب: ورقة ٣٨ أ) . ورواية عبد الرحمن عن أبيه، لا يقصد به أباه عبد الله وإنما يقصد جده كعب بن مالك رضي الله عنه، كما صرّح بذلك في رواية البيهقي، وبما أن عبد الرحمن سمع من جده (تهذيب التهذيب: ٦/٢١٥) فالإسناد متصل إذًا.</p>"
  }, {
    "id": 23,
    "sura": 2,
    "aya": 113,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَى عَلَى شَيْءٍ} {١١٣} .نَزَلَتْ فِي يَهُودِ أَهْلِ الْمَدِينَةِ وَنَصَارَى أَهْلِ نَجْرَانَ وَذَلِكَ أَنَّ وَفْدَ نَجْرَانَ لَمَّا قَدِمُوا عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَتَاهُمْ أَحْبَارُ الْيَهُودِ فَتَنَاظَرُوا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمْ، فَقَالَتِ الْيَهُودُ: مَا أَنْتُمْ عَلَى شَيْءٍ مِنَ الدِّينِ وَكَفَرُوا بِعِيسَى وَالْإِنْجِيلِ وَقَالَتْ لَهُمُ النَّصَارَى: مَا أَنْتُمْ عَلَى شَيْءٍ مِنَ الدِّينِ، فَكَفَرُوا بِمُوسَى وَالتَّوْرَاةِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (١/٣٩٤) وابن أبي حاتم (فتح القدير: ١/١٣٠) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما. وسنده حسن.</p>"
  }, {
    "id": 24,
    "sura": 2,
    "aya": 114,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَمَنْ أَظْلَمُ مِمَّنْ مَنَعَ مَسَاجِدَ اللَّهِ} الْآيَةَ {١١٤} .نَزَلَتْ فِي طَطُوسَ الرُّومِيِّ وَأَصْحَابِهِ مِنَ النَّصَارَى، وَذَلِكَ أَنَّهُمْ غَزَوْا بَنِي إِسْرَائِيلَ، فَقَتَلُوا مُقَاتِلَتَهُمْ، وَسَبَوْا ذَرَارِيهِمْ، وَحَرَقُوا التَّوْرَاةَ، وَخَرَّبُوا بَيْتَ الْمَقْدِسِ، وَقَذَفُوا فِيهِ الْجِيَفَ. وَهَذَا قَوْلِ ابْنِ عَبَّاسٍ فِي رِوَايَةِ الْكَلْبِيِّ.وَقَالَ قَتَادَةُ وَالسُّدِّيُّ: هُوَ بُخَتُنَصَّرُ وَأَصْحَابُهُ غَزَوُا الْيَهُودَ وَخَرَّبُوا بَيْتَ الْمَقْدِسِ، وَأَعَانَتْهُمْ عَلَى ذَلِكَ النَّصَارَى مِنْ أَهْلِ الرُّومِ.(١) - وَقَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ عَطَاءٍ. نَزَلَتْ فِي مُشْرِكِي أَهْلِ مَكَّةَ وَمَنْعِهِمُ الْمُسْلِمِينَ مِنْ ذِكْرِ اللَّهِ تَعَالَى فِي الْمَسْجِدِ الْحَرَامِ.</p><p>(٢) - أخرجه ابن أبي حاتم (فتح القدير: ١٣٢١) من طريق ابن إسحاق بسنده إلى ابن عباس رضي الله عنهما. وسنده حسن.</p>"
  }, {
    "id": 25,
    "sura": 2,
    "aya": 115,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ} {١١٥} .اخْتَلَفُوا فِي سَبَبِ نُزُولِهَا. فَأَخْبَرَنَا أَبُو منصور المنصوري قال: أَخْبَرَنَا عَلِيُّ بْنُ عمر الحافظ قال: حَدَّثَنَا أَبُو مُحَمَّدٍ إِسْمَاعِيلُ بن عليّ قال: حَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ بْنِ شَبِيبٍ الْعُمَرِيُّ قال: حَدَّثَنَا أَحْمَدُ بْنُ عُبَيْدِ اللَّهِ بْنِ الْحَسَنِ الْعَنْبَرِيُّ قَالَ: وَجَدْتُ فِي كِتَابِ أَبِي، حَدَّثَنَا عَبْدُ الملك العرزمي قال: حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: بَعَثَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - سَرِيَّةً كَنْتُ فِيهَا فَأَصَابَتْنَا ظُلْمَةٌ فَلَمْ نَعْرِفِ الْقِبْلَةَ، فَقَالَتْ طَائِفَةٌ مِنَّا: قَدْ عَرَفْنَا الْقِبْلَةَ هِيَ هَاهُنَا قِبَلَ الشَّمَالِ، فَصَلَّوْا وَخَطُّوا خُطُوطًا وَقَالَ بَعْضُنَا: الْقِبْلَةُ هَاهُنَا قِبَلَ الْجَنُوبِ فَصَلَّوْا وَخَطُّوا خُطُوطًا فَلَمَّا أَصْبَحُوا وَطَلَعَتِ الشَّمْسُ أَصْبَحَتْ تِلْكَ الْخُطُوطُ لِغَيْرِ الْقِبْلَةِ فَلَمَّا قَفَلْنَا مِنْ سَفَرِنَا سَأَلْنَا النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَنْ ذَلِكَ، فَسَكَتَ فَأَنْزَلَ اللَّهُ تَعَالَى: {وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ}(٢) - أَخْبَرَنَا أبو منصور قال: أخبرنا علي قال: أَخْبَرَنَا يَحْيَى بن صاعد قال: حَدَّثَنَا مُحَمَّدُ بْنُ إسماعيل الأحمسي قال: حدثنا وكيع. قال: حَدَّثَنَا أَشْعَثُ السَّمَّانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ قَالَ: كُنَّا نُصَلِّي مَعَ النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي السَّفَرِ فِي لَيْلَةٍ مُظْلِمَةٍ، فَلَمْ نَدْرِ كَيْفَ الْقِبْلَةُ، فَصَلَّى كُلُّ رَجُلٍ منا على حاله، فَلَمَّا أَصْبَحْنَا ذَكَرْنَا ذَلِكَ إلى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ: {فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ} وَمَذْهَبُ ابْنِ عُمَرَ أَنَّ الْآيَةَ نَازِلَةٌ فِي التَّطَوُّعِ بِالنَّافِلَةِ. أَخْبَرَنَا أَبُو الْقَاسِمِ بن عبدان قال: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الله الحافظ قال: حَدَّثَنَا مُحَمَّدُ بن يعقوب قال: حَدَّثَنَا أَبُو الْبَخْتَرِيِّ بْنُ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بن شاكر قال: حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ قَالَ: أُنْزِلَتْ {فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ} أَنْ تُصَلِّيَ حَيْثُ تَوَجَّهَتْ بِكَ رَاحِلَتُكَ فِي التَّطَوُّعِ.وَقَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ عَطَاءٍ: إن النجاشي لما توفي قال جبريل للنبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِنَّ النَّجَاشِيَّ تُوُفِّيَ، فَصَلِّ عَلَيْهِ، فَأَمَرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَنْ يَحْضُرُوا وَصَفَّهُمْ ثُمَّ تَقَدَّمَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَقَالَ لَهُمْ: \"إِنَّ اللَّهَ أَمَرَنِي أَنْ أُصَلِّيَ عَلَى النَّجَاشِيِّ وَقَدْ تُوُفِّيَ فَصَلُّوا عَلَيْهِ\" فَصَلَّى رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَهُمْ عَلَيْهِ، فَقَالَ أَصْحَابُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي أَنْفُسِهِمْ: كَيْفَ نُصَلِّي عَلَى رَجُلٍ مَاتَ، وهو يصلي على غير قِبْلَتِنَا؟ وَكَانَ النَّجَاشِيُّ يُصَلِّي إِلَى بَيْتِ الْمَقْدِسِ حَتَّى مَاتَ وَقَدْ صُرِفَتِ الْقِبْلَةُ إِلَى الْكَعْبَةِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ} وَمَذْهَبُ قَتَادَةَ أَنَّ هَذِهِ الْآيَةَ مَنْسُوخَةٌ بِقَوْلِهِ تَعَالَى: {وَحَيْثُمَا كُنْتُمْ فَوَلُّوا وجوهَكمْ شَطْرَه} فهذا قَوْلُ ابن عباس عند عَطَاءٍ الْخُرَاسَانِيِّ وَقَالَ: أَوَّلُ مَا نُسِخَ مِنَ الْقُرْآنِ شَأْنُ الْقِبْلَةِ قَالَ اللَّهُ تَعَالَى: {فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ} قَالَ: فَصَلَّى رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - نَحْوَ بَيْتِ الْمَقْدِسِ وَتَرَكَ الْبَيْتَ الْعَتِيقَ، ثُمَّ صَرَفَهُ اللَّهُ تَعَالَى إِلَى الْبَيْتِ الْعَتِيقِ.(٣) - وَقَالَ فِي رِوَايَةِ عَلِيِّ بْنِ أبي طلحة لوالبي: إِنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لَمَّا هَاجَرَ إِلَى الْمَدِينَةِ. وَكَانَ أَكْثَرُ أَهْلِهَا الْيَهُودَ، أَمَرَهُ اللَّهُ أَنْ يَسْتَقْبِلَ بَيْتَ الْمَقْدِسِ، فَفَرِحَتِ الْيَهُودُ. فَاسْتَقْبَلَهَا بِضْعَةَ عَشَرَ شَهْرًا وَكَانَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يُحِبُّ قِبْلَةَ إِبْرَاهِيمَ، فَلَمَّا صَرَفَهُ اللَّهُ تَعَالَى إِلَيْهَا ارْتَابَ مِنْ ذَلِكَ الْيَهُودُ وَقَالُوا: مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا، فَأَنْزَلَ اللَّهُ تَعَالَى: {فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ}قَوْلُهُ تَعَالَى: {وَقَالُوا اتَّخَذَ اللَّهُ وَلَدًا} {١١٦} .نَزَلَتْ فِي الْيَهُودِ حَيْثُ قَالُوا: عُزَيْرٌ ابْنُ اللَّهِ، وَفِي نَصَارَى نَجْرَانَ حَيْثُ قَالُوا: الْمَسِيحُ ابْنُ اللَّهِ، وَفِي مُشْرِكِي الْعَرَبِ حَيْثُ قَالُوا: الْمَلَائِكَةُ بَنَاتُ اللَّهِ.</p><p>(١) - أخرجه ابن مردويه (لباب النقول: ٢٧) وإسناده منقطع (العجاب لابن حجر: ورقة ٤٠ أ) ويشهد له: الرواية الآتية.</p><p>(٢) - أخرجه الترمذي (٢/١٧٦ - ح: ٣٤٥) وابن ماجه (١/٣٢٦ - ح: ١٠٢٠) والدارقطني (١/٢٧٢ - ح: ٥) وابن جرير (١/٤٠١) والطيالسي (منحة المعبود: ١/٨٥ - ح: ٣٦٨) (العجاب: ورقة ٤٠ أ) وعبد بن حميد (فتح القدير: ١/١٣٢) والطبراني (المعجم الأوسط: ١/٢٨٤ - ح: ٤٦٣) كلهم من طريق أشعث به. وإسناده ضعيف جدا فأشعث متروك (تقريب التهذيب: ١/٧٩ - رقم ٥٩٨) (وعاصم ضعيف (المصدر السابق: ١/٣٨٤ - رقم: ١٥) ويشهد للروايتين السابقتين:</p><p>١ - ما أخرجه الدارقطني (١/٢٧١ - ح: ٣) وابن مردويه (تفسير ابن كثير: ١/١٥٩) من طريق محمد بن عبيد الله العرزمي عن عطاء عن جابر به وضعفه الدارقطني وكذلك شمس الحق العظيم أبادي في \"التعليق المغني على الدارقطني\".</p><p>٢ - ما أخرجه الدارقطني (١/٢٨١ - ح: ٤) والحاكم (المستدرك: ١/٢٠٧) من طريق محمد بن سالم عن عطاء عن جابر نحوه. وضعفه الحافظ الذهبي في \"التلخيص\" (حاشية المستدرك: ١/٢٠٧) والحافط ابن كثير في \"تفسيره\" (١/١٥٩) . قلت: وأنا لا أرى أن هذه الطرق يجبر بعضها بعضًا لضعفها، ولورود ما يعارضها مما هو أصح، كما في رواية علي بن أبي طلحة الوالبي عن ابن عباس رضي الله عنهما وسيأتي تخريجها.</p><p>(٣) - أخرجه ابن جرير (١/٣٩٩، ٤٠٠) وابن أبي حاتم (لباب النقول: ٢٦) من طريق معاوية بن صالح عن علي بن أبي طلحة عن ابن عباس رضي الله عنهما. وإسناده صحيح (لباب النقول: ٢٧) وهذا أصح الأسانيد عن ابن عباس رضي الله عنهما (التفسير والمفسرون: ١/٧٧) .</p>"
  }, {
    "id": 26,
    "sura": 2,
    "aya": 119,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ} {١١٩} .قَالَ ابْنُ عَبَّاسٍ: إِنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ ذَاتَ يَوْمٍ: \"لَيْتَ شِعْرِي مَا فَعَلَ أَبَوَايَ؟ \" فَنَزَلَتْ هَذِهِ الْآيَةُ. وَهَذَا عَلَى قِرَاءَةِ مَنْ قَرَأَ: {وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ} جَزْمًاوَقَالَ مُقَاتِلٌ: إِنَّ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ: \"لَوْ أنزل اللَّهَ بَأْسَهُ بِالْيَهُودِ لَآمَنُوا\" فَأَنْزَلَ اللَّهُ تَعَالَى: {وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ}</p><p>(١) - هذا مما أخرجه عبد الغني بن سعيد الثقفي في \"تفسيره\" عن ابن عباس رضي الله عنهما، ومعظم رواياته عنه ضعيفة (مقدمة العجاب لابن حجر) وهذه الرواية ضعفها الحافظ ابن حجر (العجاب: ورقة ٤٢ أ) ويشهد لها.</p>"
  }, {
    "id": 27,
    "sura": 2,
    "aya": 120,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَنْ تَرْضَى عَنْكَ الْيَهُودُ وَلَا النَّصَارَى} الْآيَةَ {١٢٠} .قَالَ الْمُفَسِّرُونَ: إِنَّهُمْ كَانُوا يَسْأَلُونَ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الهدنة ويطمعون أنهم إذا هَادَنَهُمْ وَأَمْهَلَهُمُ اتَّبَعُوهُ وَوَافَقُوهُ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ. وقال ابْنُ عَبَّاسٍ: هَذَا فِي الْقِبْلَةِ وَذَلِكَ أَنَّ يَهُودَ الْمَدِينَةِ وَنَصَارَى نَجْرَانَ كَانُوا يَرْجُونَ أَنْ يُصَلِّيَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى قِبْلَتِهِمْ فَلَمَّا صَرَفَ اللَّهُ الْقِبْلَةَ إِلَى الْكَعْبَةِ شَقَّ ذلك عليهم، فيئسوا مِنْهُ أَنْ يُوَافِقَهُمْ عَلَى دِينِهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - ما أخرجه ابن جرير (١/٤٠٩) وعبد بن حميد وعبد الرزاق وابن المنذر (فتح القدير: ١/١٣٦) من طريق الثوري عن موسى بن عبيدة عن محمد بن كعب القرظي مرسلا مثله. قال الحافظ ابن كثير: موسى قد تكلموا فيه. (تفسير ابن كثير: ١/١٦٢) قلت: ضعفه الحافظ ابن حجر في \"التقريب\" (٢/٢٨٦ - رقم: ١٤٨٣) وهذه الرواية ضعفها السيوطي (الدر المنثور: ١/٢٧١) وهي كما قال.</p>"
  }, {
    "id": 28,
    "sura": 2,
    "aya": 121,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ} {١٢١} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ عَطَاءٍ وَالْكَلْبِيِّ: نَزَلَتْ فِي أَصْحَابِ السَّفِينَةِ الَّذِينَ أَقْبَلُوا مَعَ جَعْفَرِ ابن أَبِي طَالِبٍ مِنْ أَرْضِ الْحَبَشَةِ كَانُوا أَرْبَعِينَ رَجُلًا مِنَ الْحَبَشَةِ وَأَهْلِ الشَّامِ. وَقَالَ الضَّحَّاكُ: نَزَلَتْ فِيمَنْ آمَنَ مِنَ الْيَهُودِ. وَقَالَ قَتَادَةُ وَعِكْرِمَةُ: نَزَلَتْ فِي أَصْحَابِ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -.</p><p>(١) - ما أخرجه ابن جرير (١/٤٠٩) عن داود بن أبي عاصم مرسلا مثله وضعفها السيوطي (الدر المنثور: ١/٢٧١) وهي كما قال.</p>"
  }, {
    "id": 29,
    "sura": 2,
    "aya": 133,
    "text": "قَوْلُهُ تَعَالَى: {أَمْ كُنْتُمْ شُهَدَاءَ إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ} الْآيَةَ {١٣٣} .نَزَلَتْ فِي الْيَهُودِ حِينَ قَالُوا لِلنَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَلَسْتَ تَعْلَمُ أَنَّ يَعْقُوبَ يَوْمَ مَاتَ أَوْصَى بَنِيهِ بِالْيَهُودِيَّةِ."
  }, {
    "id": 30,
    "sura": 2,
    "aya": 135,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَقَالُوا كُونُوا هُودًا أَوْ نَصَارَى تَهْتَدُوا} {١٣٥} .قَالَ ابْنُ عَبَّاسٍ: نَزَلَتْ فِي رُؤُوسِ يَهُودِ الْمَدِينَةِ: كَعْبِ بْنِ الْأَشْرَفِ، وَمَالِكِ بْنِ الصَّيْفِ، وَوَهْبِ بْنِ يَهُوذَا، وَأَبِي يَاسِرِ ابن أَخْطَبَ؛ وَفِي نَصَارَى أَهْلِ نَجْرَانَ؛ وَذَلِكَ أَنَّهُمْ خَاصَمُوا الْمُسْلِمِينَ فِي الدِّينِ، كُلُّ فِرْقَةٍ تَزْعُمُ أَنَّهَا أَحَقُّ بِدِينِ اللَّهِ تَعَالَى مِنْ غَيْرِهَا، فَقَالَتِ الْيَهُودُ: نَبِيُّنَا مُوسَى أَفْضَلُ الْأَنْبِيَاءِ، وَكِتَابُنَا التَّوْرَاةُ أَفْضَلُ الْكُتُبِ، وَدِينُنَا أَفْضَلُ الْأَدْيَانِ، وَكَفَرَتْ بِعِيسَى وَالْإِنْجِيلِ وَمُحَمَّدٍ وَالْقُرْآنِ وَقَالَتِ النَّصَارَى: نَبِيُّنَا عِيسَى أَفْضَلُ الْأَنْبِيَاءِ وَكِتَابُنَا الْإِنْجِيلُ أَفْضَلُ الْكُتُبِ وَدِينُنَا أَفْضَلُ الْأَدْيَانِ وَكَفَرَتْ بِمُحَمَّدٍ وَالْقُرْآنِ. وَقَالَ كُلُّ وَاحِدٍ مِنَ الْفَرِيقَيْنِ لِلْمُؤْمِنِينَ: كُونُوا عَلَى دِينِنَا فَلَا دِينَ إِلَّا ذَلِكَ وَدَعَوْهُمْ إِلَى دِينِهِمْ.</p><p>(١) - أخرج ابن جرير (٤٤٠) وابن أبي حاتم وابن المنذر (فتح القدير: ١/١٤٨) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما قال: قال عبد الله بن صوريا الأعور لرسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ما الهدى إلا ما نحن عليه، عليه فاتبعنا يا محمد تهتد، وقالت النصارى مثل ذلك، فأنزل الله عز وجل الآية. سنده حسن.</p>"
  }, {
    "id": 31,
    "sura": 2,
    "aya": 137,
    "text": "قَوْلُهُ تَعَالَى: {صِبْغَةَ اللَّهِ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً} {١٣٨} .قَالَ ابْنُ عَبَّاسٍ: إِنَّ النَّصَارَى كَانَ إِذَا وُلِدَ لِأَحَدِهِمْ وَلَدٌ فَأَتَى عَلَيْهِ سَبْعَةُ أَيَّامٍ، صَبَغُوهُ فِي مَاءٍ لَهُمْ يُقَالُ له: المعمودي ليظهروه بِذَلِكَ، وَيَقُولُونَ: هَذَا طَهُورٌ مَكَانَ الْخِتَانِ، فَإِذَا فَعَلُوا ذَلِكَ قَالُوا: الْآنَ صَارَ نَصْرَانِيًّا حَقًّا، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ. نَزَلَتْ فِي تَحْوِيلِ الْقِبْلَةِ."
  }, {
    "id": 32,
    "sura": 2,
    "aya": 142,
    "text": "<p>(١) - قوله تعالى: {سَيَقول السّفَهَاء مِنَ النَّاسِ} الآية {١٤٢} .أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بن جعفر قال: أَخْبَرَنَا زَاهِرُ بن أحمد قال: أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدِ بن مصعب قال: حَدَّثَنَا يَحْيَى بن حكيم قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رجاء قال: حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنِ الْبَرَاءِ قَالَ: لَمَّا قَدِمَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَصَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا أَوْ سَبْعَةَ عَشَرَ شَهْرًا وَكَانَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يُحِبُّ أَنْ يَتَوَجَّهَ نَحْوَ الْكَعْبَةِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ} إِلَى آخر الآية، فقال السُّفَهَاءُ مِنَ النَّاسِ - وَهُمُ الْيَهُودُ - مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا؟ قَالَ اللَّهُ تَعَالَى: {قُلْ لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ} إِلَى آخِرِ الْآيَةِ، رَوَاهُ الْبُخَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ رَجَاءٍ.</p><p>(١) - أخرجه البخاري (فتح الباري: ١/٩٥ - ح: ٤٠، ١/٥٠٢ - ح: ٣٩٩) ومسلم (١/٣٧٤ - ح: ٥٢٥) والإمام أحمد (الفتح الرباني: ٣/١١٥ - ح: ٤٢١) وابن جرير (٢/٣) وابن إسحاق وابن أبي حاتم (تفسير ابن كثير: ١/١٨٩) والترمذي (٥/٢٠٧ - ح: ٢٩٦٢) وابن ماجه (١/٣٢٢ - ح: ١٠١٠) كلهم من طريق إسرائيل به وله شواهد، منها:</p><p>١ - ما أخرجه ابن جرير (٢/٤) من طريق علي بن أبي طلحة عن ابن عباس رضي الله عنهما مثله، وسنده صحيح.</p><p>٢ - ما أخرجه ابن جرير أيضًا (٢/٣) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما نحوه، وسنده حسن.</p>"
  }, {
    "id": 33,
    "sura": 2,
    "aya": 143,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ} {١٤٣} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الْكَلْبِيِّ: كَانَ رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَدْ مَاتُوا عَلَى الْقِبْلَةِ الْأُولَى، مِنْهُمْ أَسْعَدُ بْنُ زُرَارَةَ وَأَبُو أُمَامَةَ أَحَدُ بَنِي النَّجَّارِ، وَالْبَرَاءُ بْنُ مَعْرُورٍ أَحَدُ بَنِي سَلَمَةَ، وَأُنَاسٌ آخَرُونَ، جَاءَتْ عَشَائِرُهُمْ فَقَالُوا: يَا رَسُولَ اللَّهِ تُوُفِّيَ إِخْوَانُنَا وَهُمْ يُصَلُّونَ إِلَى الْقِبْلَةِ الْأُولَى، وَقَدْ صَرَفَكَ اللَّهُ تَعَالَى إِلَى قِبْلَةِ إِبْرَاهِيمَ، فَكَيْفَ بِإِخْوَانِنَا؟ فَأَنْزَلَ اللَّهُ: {وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ} الْآيَةَ. ثُمَّ قَالَ: {قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ} وَذَلِكَ أَنَّ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ لِجِبْرِيلَ عَلَيْهِ السَّلَامُ: \"وَدِدْتُ أَنَّ اللَّهَ صَرَفَنِي عَنْ قِبْلَةِ الْيَهُودِ إِلَى غَيْرِهَا\" وَكَانَ يُرِيدُ الْكَعْبَةَ، لِأَنَّهَا قِبْلَةُ إِبْرَاهِيمَ، فَقَالَ لَهُ جِبْرِيلُ: \"إِنَّمَا أَنَا عَبْدٌ مِثْلُكَ لَا أَمْلِكُشَيْئًا فَسَلْ رَبَّكَ أَنْ يُحَوِّلَكَ عَنْهَا إِلَى قِبْلَةِ إِبْرَاهِيمَ\" ثُمَّ ارْتَفَعَ جِبْرِيلُ وَجَعَلَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يُدِيمُ النَّظَرَ إِلَى السَّمَاءِ رَجَاءَ أَنْ يَأْتِيَهُ جِبْرِيلُ بِمَا سَأَلَهُ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(١) - أَخْبَرَنَا أَبُو مَنْصُورٍ مُحَمَّدُ بْنُ محمد المنصوري قال: أَخْبَرَنَا عَلِيُّ بْنُ عُمَرَ الْحَافِظُ قال: حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عِيسَى قال: حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ قال: حَدَّثَنَا أَبُو بَكْرِ بْنُ عياش قال: حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ الْبَرَاءِ قَالَ: صَلَّيْنَا مَعَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَعْدَ قُدُومِهِ الْمَدِينَةَ سِتَّةَ عَشَرَ شَهْرًا نَحْوَ بَيْتِ الْمَقْدِسِ، ثُمَّ عَلِمَ اللَّهُ - عَزَّ وَجَلَّ - هَوَى نَبِيِّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ: {قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا} الْآيَةَ، رَوَاهُ مُسْلِمٌ عَنْ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ، عَنْ أَبِي الْأَحْوَصِ؛ ورواه الْبُخَارِيُّ، عَنْ أَبِي نُعَيْمٍ، عَنْ زُهَيْرٍ كِلَاهُمَا عَنْ أَبِي إِسْحَاقَ.</p><p>(١) - أخرجه أبو داود (٥/٥٩ - ح: ٤٦٨٠) والترمذي (٥/٢٠٨ - ح: ٢٩٦٤) والإمام أحمد (الفتح الرباني: ١٨/٧٧ - ح: ١٧٠) وابن جرير (٢/١١) والطبراني (المعجم الكبير: ١١/٢٧٨ - ح: ١١٧٢٩) كلهم من طريق سماك عن عكرمة عن ابن عباس رضي الله عنهما قال: لما وجّه رسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إلى الكعبة قالوا: كيف بمن مات من إخواننا قبل ذلك وهم يصلّون نحو بيت المقدس؟ فنزلت الآية. صححه الترمذي وابن حبان (حاشية جامع الأصول: ٢/١٣) قلت: نصّ الحافظ ابن حجر على اضطراب رواية سماك عن عكرمة (تقريب التهذيب: ١/٣٣٢ - رقم: ٥١٩) فلا تصح، بل تتحسن، لا سيما ولها شواهد، منها:</p><p>١ - ما أخرجه ابن إسحاق عن البراء نحوه (تفسير ابن كثير: ١/١٨٩) .</p><p>٢ - ما أخرجه ابن جرير (٢/١١) عن قتادة مرسلا نحوه وإسناده صحيح.</p><p>٣ - ما أخرجه البخاري (فتح الباري: ٨/١٧١ - ح: ٤٤٨٦) وابن جرير (٢/١١) عن البراء بمعناه.</p>"
  }, {
    "id": 34,
    "sura": 2,
    "aya": 146,
    "text": "قَوْلُهُ تَعَالَى: {الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ} الْآيَةَ {١٤٦} .نَزَلَتْ فِي مُؤْمِنِي أَهْلِ الْكِتَابِ عَبْدِ اللَّهِ بْنِ سَلَامٍ وَأَصْحَابِهِ كَانُوا يَعْرِفُونَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بنعته وصفته وبعثه فِي كِتَابِهِمْ كَمَا يَعْرِفُ أَحَدُهُمْ وَلَدَهُ إِذَا رَآهُ مَعَ الْغِلْمَانِ؛ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: لَأَنَا أَشَدَّ مَعْرِفَةً بِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مِنِّي بِابْنِي، فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ: وَكَيْفَ ذَاكَ يَا ابْنَ سَلَامٍ؟ قَالَ: لِأَنِّي أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَقًّا يَقِينًا، وَأَنَا لَا أَشْهَدُ بِذَلِكَ عَلَى ابْنِي، لِأَنِّي لَا أَدْرِي مَا أَحْدَثَ النِّسَاءُ، فَقَالَ عُمَرُ: وَفَّقَكَ اللَّهُ يَا ابْنَ سَلَامٍ."
  }, {
    "id": 35,
    "sura": 2,
    "aya": 154,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ} الْآيَةَ {١٥٤} .نَزَلَتْ فِي قَتْلَى بَدْرٍ مِنَ الْمُسْلِمِينَ، وَكَانُوا بِضْعَةَ عَشَرَ رَجُلًا، ثَمَانِيَةً مِنَ الْأَنْصَارِ وَسِتَّةً مِنَ الْمُهَاجِرِينَ، وَذَلِكَ أَنَّ النَّاسَ كَانُوا يَقُولُونَ لِلرَّجُلِ يُقْتَلُ فِي سَبِيلِ اللَّهِ مَاتَ فُلَانٌ وَذَهَبَ عَنْهُ نَعِيمُ الدُّنْيَا وَلَذَّاتُهَا، فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه ابن مندة في \"الصحابة\" (لباب النقول: ٣٠) من طريق السدي عن الكلبي عن أبي صالح عن ابن عباس رضي الله عنهما بمعناه وقد علمنا سابقًا أن هذه سلسلة الكذب (الإتفان: ٢/١٨٩) .<p>"
  }, {
    "id": 36,
    "sura": 2,
    "aya": 158,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ} الْآيَةَ {١٥٨} .أَخْبَرَنَا سَعِيدُ ابن مُحَمَّدِ بْنِ أحمد الزاهد قال: أَخْبَرَنَا أَبُو عَلِيِّ بْنُ أَبِي بكر الفقيه قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عبد العزيز قال. حدثنا مُصْعَبُ بْنُ عَبْدِ الله الزبيري. قال: حدثني مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: أُنْزِلَتْ هَذِهِ الْآيَةُ فِي الأنصار، كانوا يهلون لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الْإِسْلَامُ سَأَلُوا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَنْ ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ، رَوَاهُ الْبُخَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ يُوسُفَ عَنْ مَالِكٍ.(٢) - أخبرنا أَبُو بكر التميمي قال: أَخْبَرَنَا أَبُو الشيخ الحافظ قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سهل العسكري قال: حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: أُنْزِلَتْ هَذِهِ الْآيَةُ فِي نَاسٍ مِنَ الْأَنْصَارِ، كَانُوا إِذَا أَهَلُّوا أَهَلُّوا لِمَنَاةَفِي الْجَاهِلِيَّةِ وَلَمْ يَحِلَّ لَهُمْ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا قَدِموا مع النبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي الْحَجِّ ذَكَرُوا ذَلِكَ لَهُ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ. رَوَاهُ مُسْلِمٌ، عَنْ أَبِي بَكْرِ بْنِ شَيْبَةَ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ.(٣) - وَقَالَ أَنَسُ بْنُ مَالِكٍ: كُنَّا نَكْرَهُ الطَّوَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ لِأَنَّهُمَا كانا من مشاعر قُرَيْشٍ فِي الْجَاهِلِيَّةِ فَتَرَكْنَاهُ فِي الْإِسْلَامِ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(٤) - وَقَالَ عَمْرُو بْنُ حُبْشِيٍّ: سَأَلْتُ ابْنَ عُمَرَ عَنْ هَذِهِ الْآيَةِ فَقَالَ: انْطَلِقْ إِلَى ابْنِ عَبَّاسٍ فَسَلْهُ فَإِنَّهُ أَعْلَمُ مَنْ بَقِيَ بِمَا أَنْزَلَ اللَّهُ عَلَى مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَتَيْتُهُ فَسَأَلْتُهُ، فَقَالَ: كَانَ عَلَى الصَّفَا صَنَمٌ عَلَى صُورَةِ رَجُلٍ يُقَالُ لَهُ: إِسَافٌ، وَعَلَى الْمَرْوَةِ صَنَمٌ عَلَى صُورَةِ امْرَأَةٍ تُدْعَى نَائِلَةَ، زَعَمَ أَهْلُ الْكِتَابِ أَنَّهُمَا زَنَيَا فِي الْكَعْبَةِ فَمَسَخَهُمَا اللَّهُ تعالى حجرين، ووضعهما عَلَى الصَّفَا وَالْمَرْوَةِ لِيُعْتَبَرَ بِهِمَا، فَلَمَّا طَالَتِ الْمُدَّةُ عُبِدَا مِنْ دُونِ اللَّهِ تَعَالَى، فَكَانَ أَهْلُ الْجَاهِلِيَّةِ إِذَا طَافُوا بَيْنَهُمَا مَسَحُوا عَلَى الْوَثَنَيْنِ، فَلَمَّا جَاءَ الْإِسْلَامُ وَكُسِرَتِ الْأَصْنَامُ كَرِهَ الْمُسْلِمُونَ الطَّوَافَ لِأَجْلِ الصَّنَمَيْنِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(٥) - وَقَالَ السُّدِّيُّ: كَانَ فِي الْجَاهِلِيَّةِ تَعْزِفُ الشَّيَاطِينُ بِاللَّيْلِ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَكَانَتْبَيْنَهُمَا آلِهَةٌ، فَلَمَّا ظَهَرَ الْإِسْلَامُ قَالَ الْمُسْلِمُونَ: يَا رَسُولَ اللَّهِ لَا نَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَإِنَّهُ شِرْكٌ كُنَّا نَصْنَعُهُ فِي الْجَاهِلِيَّةِ؛ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ. أَخْبَرَنَا مَنْصُورُ بْنُ عَبْدِ الوهاب البزار قال: أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بن سنان قال: أَخْبَرَنَا حَامِدُ بْنُ مُحَمَّدِ بن شعيب قال: أَخْبَرَنَا مُحَمَّدُ بن بكار قال: حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنْ عَاصِمٍ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: كَانُوا يُمْسِكُونَ عَنِ الطَّوَافِ بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَكَانَا مِنْ شَعَائِرِ الْجَاهِلِيَّةِ، وَكُنَّا نَتَّقِي الطَّوَافَ بِهِمَا فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ} الْآيَةَ. رَوَاهُ الْبُخَارِيُّ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَاصِمٍ.</p><p>(١) - أخرجه البخاري (فتح الباري: ٣/٦١٤ - ح: ١٧٩٠ ٣/٤٩٧ - ح: ١٦٤٣) ومسلم (٢/٩٢٨ - ح: ٢٦٠ ٢/٩٢٩ - ح: ٢٦١، ٢/٩٣٠ - ح: ٢٦٣) والإمام مالك (الموطأ: ٢٥٧ - ح: ٨٣٥ رواية يحيى الليثي) والإمام أحمد (الفتح الرباني: ١٨/ ٧٨ - ح: ١٧٣، ١٨/٧٩ - ح: ٧٤) وأبو داود (٢/٤٥٣ - ح: ١٩٠١) والترمذي (٥/٢٠٨ - ح: ٢٩٦٥) والنسائي (جامع الأصول: ٢/١٨) وابن ماجه (٢/٩٩٤ - ح: ٢٩٨٦) وابن جرير (٢/٢٩، ٣١) كلهم عن عائشة رضي الله عنها به. ويشهد له: الرواية الآتية:.</p><p>(٢) - انظر تخريجه في الحديث السابق ويشهد لهما:</p><p>* ما أخرجه ابن جرير (٢/٢٨) عن ابن عباس رضي الله عنهما بسند صحيح نحوهما.</p><p>(٣) - أخرجه البخاري (فتح الباري: ٣/٥٠٢ - ح: ١٦٤٨، ٨/١٧٦ - ح: ٤٤٩٦) ومسلم (٢/٩٣٠ - ح: ١٢٧٨) وابن جرير (٢/٢٨، ٢٩) عن أنس رضي الله عنه.</p><p>انظر الرواية الأخيرة في نزول هذه الآية.</p><p>(٤) - الذي أخرجه مسلم في صحيحه (٢/٩٢٨ - ح: ١٢٧٧) عن عائشة رضي الله عنها: أن الأنصار كانوا يهلّون لصنمين على شط البحر يُقال لهما: إساف ونائلة، ثم يجيئون فيطوفون بين الصفا والمروة ثم يحلقون، فلما جاء الإسلام كرهو أن يطوفوا بينهما للذي كانوا يصنعون في الجاهلية فأنزل الله تعالى الآية. وغلط المحدّثون هذا الحديث لمخالفته للأحاديث الصحيحة السابقة وإن الإهلال كان لمناة (حاشية صحيح مسلم بتحقيق محمد فؤاد عبد الباقي: ٢/٩٢٨) وقد نقل ذلك الإمام النووي في شرحه لهذا الحديث عن القاضي عياض رحمه الله (شرح صحيح مسلم للنووي: ٩/٢١) .</p><p>(٥) - أخرجه ابن جرير (٢/٢٨) والحاكم (المستدرك: ٢/٢٧١) وابن أبي داود في المصاحف (المصاحف: ١١٢) (تفسير الطبري بتحقيق أحمد محمد شاكر: ٣/٢٣٤) من طريق أسباط عن السدي عن أبي مالك عن ابن عباس رضي الله عنهما.</p><p>قد سبق تضعيف هذا السند.</p>"
  }, {
    "id": 37,
    "sura": 2,
    "aya": 159,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَى} {١٥٩} .نَزَلَتْ فِي عُلَمَاءِ أَهْلِ الْكِتَابِ وَكِتْمَانِهِمْ آيَةَ الرَّجْمِ وَأَمْرِ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -.</p><p>(١) - أخرج ابن جرير (٢/٣٢) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٦٢) من طريق ابن إسحاق بسنده إلى ابن عباس رضي الله عنهما قال: سأل معاذ بن جبل أخو بني سلمة وسعد بن معاذ أخو بني عبد الأشهل، وخارجة بن زيد أخو بني عبد الحارث ابن الخزرج نفرًا من أحبار يهود عن بعض ما في التوراة فكتموهم إياه وأبوا أن يخبروهم عنه، فأنزل الله الآية. وسنده حسن.</p><p>والمراد ببعض ما في التوراة: صفة محمد صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، والله أعلم.</p>"
  }, {
    "id": 38,
    "sura": 2,
    "aya": 164,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ} الْآيَةَ {١٦٤} .أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ طاهر التميمي قال: أَخْبَرَنَا أَبُو عَمْرِو بن مطر قال: أَخْبَرَنَا أَبُو عَبْدِ الله الزيادي قال: حَدَّثَنَا مُوسَى بْنُ مَسْعُودٍ النهدي قال: حَدَّثَنَا شِبْلٌ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ عطاء قال: أنزلت بالمدينة على النبيّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - {وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ} فَقَالَتْ كُفَّارُ قُرَيْشٍ بِمَكَّةَ: كَيْفَ يَسَعُ النَّاسَ إِلَهٌ وَاحِدٌ؟ فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ} حَتَّى بَلَغَ {لِقَوْمٍيَعْقِلُونَ}(٢) - أَخْبَرَنَا أَبُو بكر الأصبهاني قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ محمد الحافظ قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عثمان العسكري قال: حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ أَبِي الضُّحَى قَالَ: لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ: {وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ} تَعَجَّبَ الْمُشْرِكُونَ وَقَالُوا: إِلَهٌ وَاحِدٌ؟ إِنْ كَانَ صَادِقًا فَلْيَأْتِنَا بِآيَةٍ. فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ} إِلَى آخِرِ الْآيَةِ.</p><p>(١) - أخرجه ابن أبي حاتم (تفسير ابن كثير: ١/٢٠٢) وأبو الشيخ في \"العظمة\" وابن المنذر (فتح القدير: ١/١٦٤) وابن جرير (٢/٣٧) من طريق موسى به.</p><p>وهو مرسل ضعيف الإسناد بسبب موسى النهدي (تقريب التهذيب: ٢/٢٨٨ - رقم: ١٥٠٥) ويشهد له: الرواية الآتية.</p><p>(٢) - أخرجه سعيد بن منصور والفريابي والبيهقي في الشعب (لباب النقول: ٣١) وآدم بن أبي أياس ووكيع وابن المنذر وابن أبي حاتم (العجاب: ورقة ٥٥ أ) وأبو الشيخ (فتح القدير: ١/١٦٤) وابن جرير (٢/٣٧) عن أبي الضحى به وهو معضل. وهاتان الروايتان لا تقوم بهما حجة، لا سيما وقد عارضهما ما هو أصح منهما، وهو: ما أخرجه ابن أبي حاتم وابن مردويه (لباب النقول: ٣١) (تفسير ابن كثير: ١/٢٠٢) عن ابن عباس رضي الله عنهما: أن قريشًا سألت النبيّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أن يجعل لهم الصفا ذهبًا فأوحى الله إليه: إني معطيهم ولكن إن كفروا عذبتهم عذابًا لا أعذبه أحدًا من العالمين، فنزلت الآية.</p><p>وجوّد إسناده السيوطي (لباب النقول: ٣١) .</p>"
  }, {
    "id": 39,
    "sura": 2,
    "aya": 168,
    "text": "قوله تعالى: {يَا أَيّهَا النَّاسُ كُلُوا مِمَّا فِي الْأَرْضِ حَلَالًا طَيِّبًا} {١٦٨} .قَالَ الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ: نَزَلَتْ فِي ثَقِيفٍ وَخُزَاعَةَ وَعَامِرِ بْنِ صَعْصَعَةَ حَرَّمُوا عَلَى أَنْفُسِهِمْ مِنَ الْحَرْثِ وَالْأَنْعَامِ وَحَرَّمُوا الْبَحِيرَةَ وَالسَّائِبَةَ وَالْوَصِيلَةَ وَالْحَامِي."
  }, {
    "id": 40,
    "sura": 2,
    "aya": 174,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلَ اللَّهُ مِنَ الْكِتَابِ} {١٧٤} .قَالَ الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ: نَزَلَتْ فِي رُؤَسَاءِ الْيَهُودِ وَعُلَمَائِهِمْ، كَانُوا يُصِيبُونَ مِنْ سَفَلَتِهِمُ الْهَدَايَا وَالْفُضُولَ، وَكَانُوا يَرْجُونَ أَنْ يَكُونَ النَّبِيُّ الْمَبْعُوثُ مِنْهُمْ، فَلَمَّابُعِثَ مِنْ غَيْرِهِمْ خَافُوا ذَهَابَ مَأْكَلَتِهِمْ وَزَوَالَ رِيَاسَتِهِمْ، فَعَمَدُوا إِلَى صِفَةِ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَغَيَّرُوهَا ثُمَّ أَخْرَجُوهَا إِلَيْهِمْ، وَقَالُوا: هَذَا نَعْتُ النَّبِيِّ الَّذِي يَخْرُجُ فِي آخِرِ الزَّمَانِ، لَا يُشْبِهُ نَعْتَ هَذَا النَّبِيِّ الَّذِي بِمَكَّةَ فَإِذَا نَظَرَتِ السَّفَلَةُ إلى النعت المتغير وَجَدُوهُ مُخَالِفًا لِصِفَةِ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَلَا يَتْبَعُونَهُ.</p><p>٢ - ما أخرجه عبد بن حميد عن قتادة مرسلاً نحوه وصححه الحافظ ابن حجر (العجاب: ورقة ٥٦ ب) .</p>"
  }, {
    "id": 41,
    "sura": 2,
    "aya": 177,
    "text": "<p>(١) - أخرجه ابن جرير (٢/٥٦) وابن المنذر وعبد بن حميد (فتح القدير: ١/١٧٣) عن قتادة به مرسلاً، وسنده صحيح.</p><p>(٢) - أخرجه ابن جرير (٢/٦٠٦١) وعبد بن حميد (فتح القدير: ١/١٧٦) عن الشعبي بمعناه مرسلاً. وسنده صحيح، ويشهد له:</p><p>* ما أخرجه ابن جرير (٢/٦١) عن قتادة مرسلاً نحوه وسنده صحيح.</p>"
  }, {
    "id": 42,
    "sura": 2,
    "aya": 178,
    "text": "<p>(١) - قوله تعالى: {يَا أَيّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى} الْآيَةَ {١٧٨} .قَالَ الشَّعْبِيُّ: كَانَ بَيْنَ حَيَّيْنِ مِنْ أَحْيَاءِ الْعَرَبِ قِتَالٌ، وَكَانَ لِأَحَدِ الْحَيَّيْنِ طُولٌ عَلَى الْآخَرِ، فَقَالُوا: نَقْتُلُ بِالْعَبْدِ مِنَّا الْحُرَّ مِنْكُمْ، وَبِالْمَرْأَةِ الرَّجُلَ، فَنَزَلَتْ هَذِهِ الْآيَةُ.</p><p>(١) - أخرجه ابن جرير (٢/٦٠٦١) وعبد بن حميد (فتح القدير: ١/١٧٦) عن الشعبي بمعناه مرسلاً. وسنده صحيح، ويشهد له:</p><p>* ما أخرجه ابن جرير (٢/٦١) عن قتادة مرسلاً نحوه وسنده صحيح.</p>"
  }, {
    "id": 43,
    "sura": 2,
    "aya": 187,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ} {١٨٧} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الْوَالِبِيِّ: وَذَلِكَ أَنَّ الْمُسْلِمِينَ كَانُوا فِي شَهْرِ رَمَضَانَ إِذَا صَلَّوُا الْعِشَاءَ حَرُمَ عَلَيْهِمُ النِّسَاءُ وَالطَّعَامُ إِلَى مِثْلِهَا مِنَ الْقَابِلَةِ، ثُمَّ إِنَّ نَاسًا مِنَ الْمُسْلِمِينَ أَصَابُوا مِنَالطَّعَامِ وَالنِّسَاءِ فِي شَهْرِ رَمَضَانَ بَعْدَ الْعِشَاءِ، مِنْهُمْ عُمَرُ بْنُ الْخَطَّابِ، فشكوا ذلك لرسول اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.(٢) - أَخْبَرَنَا أَبُو بكر الأصفهاني قال: أَخْبَرَنَا أَبُو الشيخ الحافظ قال: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ محمد الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عثمان العسكري قال: حَدَّثَنَا يَحْيَى ابن أبي زائدة قال: حَدَّثَنِي أَبِي وَغَيْرُهُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: كَانَ الْمُسْلِمُونَ إِذَا أَفْطَرُوا يَأْكُلُونَ وَيَشْرَبُونَ وَيَمَسُّونَ النِّسَاءَ مَا لَمْ يَنَامُوا فَإِذَا نَامُوا لَمْ يَفْعَلُوا شَيْئًا مِنْ ذَلِكَ إِلَى مِثْلِهَا مِنَ الْقَابِلَةِ، وَإِنَّ قَيْسَ بْنَ صِرْمَةَ الْأَنْصَارِيَّ كَانَ صَائِمًا، فَأَتَى أَهْلَهُ عِنْدَ الْإِفْطَارِ، فَانْطَلَقَتِ امْرَأَتُهُ تَطْلُبُ شيئًا وغلبته عيناه فَنَامَ، فَلَمَّا انْتَصَفَ النَّهَارُ مِنْ غَدٍ غشي عليه، قال: وَأَتَى عُمَرُ امْرَأَتَهُ وَقَدْ نَامَتْ، فَذُكِرَ ذلك للنبيّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فنزلت: {أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ} إِلَى قَوْلِهِ: {الْفَجْرِ} فَفَرِحَ الْمُسْلِمُونَ بِذَلِكَ.(٣) - أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ بْنُ أبي حامد قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ محمد الشيباني قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الدغولي قال: حدثنا الزعفراني قال: حَدَّثَنَا شبابة قال: حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ قَالَ: كَانَ أَصْحَابُ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِذَا كَانَ الرَّجُلُ صَائِمًا فَحَضَرَ الْإِفْطَارُ فَنَامَ قَبْلَ أَنْ يَطْعَمَ، لَمْ يَأْكُلْ لَيْلَتَهُ وَلَا يَوْمَهُ حَتَّى يُمْسِيَ، وَإِنَّ قَيْسَ بْنَ صِرْمَةَ الْأَنْصَارِيَّ كَانَ صَائِمًا، فَلَمَّا حَضَرَ الْإِفْطَارُ أَتَى امْرَأَتَهُ، فَقَالَ: هَلْ عِنْدَكِ طَعَامٌ؟ قَالَتْ: لَا، وَلَكِنْ أَنْطَلِقُ فَأَطْلُبُ لَكَ، وَكَانَ يَوْمُهُ يَعْمَلُ فَغَلَبَتْهُ عَيْنَاهُ، وَجَاءَتْهُ امْرَأَتُهُ، فَلَمَّا رَأَتْهُ قَالَتْ: خَيْبَةٌ لَكَ فَأَصْبَحَ صَائِمًا فَلَمَّا انْتَصَفَ النَّهَارُ غُشِيَ عَلَيْهِ، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ- صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ هَذِهِ الْآيَةُ: {أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ} فَفَرِحُوا بِهَا فَرَحًا شَدِيدًا، رَوَاهُ الْبُخَارِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ مُوسَى عَنْ إِسْرَائِيلَ.(٤) - أَخْبَرَنَا الْحَسَنُ بْنُ محمد الفارسي قال: أَخْبَرَنَا مُحَمَّدُ بن الفضل قال: أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْحَسَنِ الْحَافِظُ قال: حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قال: حَدَّثَنَا هِشَامُ بن عمار قال: حَدَّثَنَا يَحْيَى بن حمزة قال: حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي فَرْوَةَ، عَنِ الزُّهْرِيِّ أَنَّهُ حَدَّثَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ: إِنَّ بَدْءَ الصَّوْمِ كَانَ يَصُومُ الرَّجُلُ مِنْ عِشَاءٍ إِلَى عِشَاءٍ، فَإِذَا نَامَ لَمْ يَصِلْ إِلَى أَهْلِهِ بَعْدَ ذَلِكَ، وَلَمْ يَأْكُلْ وَلَمْ يَشْرَبْ، حَتَّى جَاءَ عُمَرُ إلى امرأته فقالت: إِنِّي قَدْ نِمْتُ، فَوَقَعَ بِهَا وَأَمْسَى صِرْمَةُ بْنُ أَنَسٍ صَائِمًا فَنَامَ قَبْلَ أَنْ يُفْطِرَ، وَكَانُوا إِذَا نَامُوا لَمْ يَأْكُلُوا وَلَمْ يَشْرَبُوا، فَأَصْبَحَ صَائِمًا وكاد الصوم يقتله فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - الرُّخْصَةَ قَالَ: {فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ} الْآيَةَ.(٥) - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدٍ الزَّاهِدُ قال: أَخْبَرَنَا جَدِّي قال: أخبرنا أبو عمرو الحيريقال: حَدَّثَنَا مُحَمَّدُ بن يحيى قال: حَدَّثَنَا ابْنُ أبي مريم قال: أَخْبَرَنَا أَبُو غسان قال: حَدَّثَنِي أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: نَزَلَتْ هَذِهِ الْآيَةُ: {وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ} وَلَمْ يَنْزِلْ {مِنَ الْفَجْرِ} وكان رِجَالٌ إِذَا أَرَادُو الصَّوْمَ رَبَطَ أَحَدُهُمْ فِي رِجْلَيْهِ الْخَيْطَ الْأَبْيَضَ وَالْخَيْطَ الْأَسْوَدَ فَلَا يَزَالُ يَأْكُلُ وَيَشْرَبُ حَتَّى يَتَبَيَّنَ لَهُ رُؤْيَتُهُمَا، فَأَنْزَلَ اللَّهُ تَعَالَى بَعْدَ ذَلِكَ: {مِنَ الْفَجْرِ} فَعَلِمُوا أَنَّهُ إِنَمَا يَعْنِي بِذَلِكَ اللَّيْلَ وَالنَّهَارَ، رَوَاهُ الْبُخَارِيُّ عَنِ ابْنِ أَبِي مَرْيَمَ، وَرَوَاهُ مُسْلِمٌ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ أَبِي مَرْيَمَ</p><p>(١) - أخرجه ابن جرير (٢/٩٦) وابن المنذر (فتح القدير: ١/١٨٧) من طريق علي بن أبي طلحة الوالبي عن ابن عباس به. وسنده صحيح، ويشهد له:</p><p>* الرواية التالية.</p><p>(٢) - إسناده ضعيف، فإن زكريا بن أبي زائدة أبو يحيى مدلّس وقد عنعن، بالإضافة إلى أن سماعه من أبي إسحاق كان في آخر عمره (تهذيب التهذيب: ٣/٣٣٠) لكنه يتحسن بما يأتي.</p><p>(٣) - أخرجه البخاري (فتح الباري: ٤/١٢٩ - ح: ١٩١٥) وأبو داود (٢/٧٣٧ - ح: ٢٣١٤) والترمذي (٥/٢١٠ - ح: ٢٩٦٨) والنسائي (جامع الأصول: ٢/٢٦) وابن جرير (٢/٩٥) عن البراء رضي الله عنه به.</p><p>(٤) - ضعفه الحافظ ابن حجر بقوله: \"هذا مع إرساله ضعيف السند، من أجل إسحاق بن أبي فروة\" (العجاب: ورقة ٦٣ ب) ووصفه في موضع آخر بأنه متروك (الإصابة: ٢/١٨٤) . قلت: لكنه يتحسن بما سبقه وبما يشهد له، ومن الشواهد على ما سبق:</p><p>١ - ما أخرجه الإمام أحمد (الفتح الرباني: ٩/٢٣٩ - ح: ٣١) والطبراني (المعجم الكبير: ٢٠/١٣٢ - ح: ٢٧٠) والحاكم (المستدرك: ٢/٢٧٤) وابن جرير (٢/٩٥) من طريق ابن أبي ليلى عن معاذ بن جبل رضي الله عنه نحو رواية القاسم بن محمد في سياق حديث طويل.</p><p>وإسناده منقطع بين ابن أبي ليلى ومعاذ (فتح الباري: ٨/١٨٢) (الإصابة: ٢/١٨٤) إلا أن الحافظ ابن حجر أورد رواية قال فيها ابن أبي ليلى \"وحدثنا أصحاب محمد صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\" فكأنه سمعه من غير معاذ أيضا. (فتح الباري: ٨/١٨٢) وانظر حاشية معجم الطبراني الكبير (٢٠/١٣٢) .</p><p>٢ - ما أخرجه أبو داود (٢/٧٣٦ - ح: ٢٣١٣) عن ابن عباس رضي الله عنهما نحوه دون ذكر عمر رضي الله عنه. وسنده حسن (حاشية جامع الأصول: ٢/٢٥) .</p><p>٣ - ما أخرجه الإمام أحمد (الفتح الرباني: ١٨/٨٣) وابن جرير (٢/٩٦) وابن أبي حاتم (لباب النقول: ٣٤) من طريق عبد الله بن كعب بن مالك عن أبيه نحوه، وذكر كعب فيمن فعل ذلك. وإسناده لا بأس به، وإن كان قد رواه ابن لهيعة فالراوي عنه ابن المبارك وهو أثبت الناس فيه (تهذيب التهذيب: ٥/٣٧٥) وصححه الشيخ أحمد محمد شاكر (حاشية تفسير الطبري بتحقيقه: ٣/٤٩٧) .</p><p>(٥) - أخرجه البخاري (فتح الباري: ٨/١٨٢ - ح: ٤٥١١) ومسلم (٢/٧٦٧ - ح: ١٠٩١) والطبراني (المعجم الكبير: ٦/١٧٩ - ح: ٥٧٩١) وابن جرير (٢/١٠٠) عن سهل بن سعد رضي الله عنه به. ويشهد له:</p><p>* ما أخرجه البخاري (فتح الباري: ٨/١٨٢ -: ٤٥٠٩) ومسلم (٢/٧٦٦ - ح: ١٠٩٠) وأبو داود (٢/٧٦٠ - ح: ٢٣٤٩) والترمذي (٥/٢١١ - ح: ٢٩٧١) والنسائي (جامع الأصول: ٢/٢٨) والطبراني (المعجم الكبير: ١٧/٧٩ - ح: ١٧٢ - ١٧٩) وابن جرير (٢/١٠٠) عن عدي بن حاتم قال:</p><p>لما نزلت: (حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر) قال له عدي بن حاتم: يا رسول الله، إني أجعل تحت وسادتي عقالين، عقالاً أبيض وعقالاً أسود أعرف الليل والنهار، فقال رسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: \"إن وسادتك لعريض، إنما هو سواد الليل وبياض النهار\". وهذا لفظ مسلم.</p><p>وأنا أرجح أن هذا ليس سبب نزول وإنما هو فهم خاطئ من عدي رضي الله عنه بعد نزول الآية بيّنه له النبي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، والله أعلم.</p>"
  }, {
    "id": 44,
    "sura": 2,
    "aya": 188,
    "text": "قَوْلُهُ تَعَالَى: {وَلَا تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ} الْآيَةَ {١٨٨} .قَالَ مُقَاتِلُ بْنُ حَيَّانَ: نَزَلَتْ هَذِهِ الْآيَةُ فِي امْرِئِ الْقَيْسِ بْنِ عَابِسٍ الْكِنْدِيِّ، وَفِي عَبْدَانَ بْنِ أَشْوَعَ الْحَضْرَمِيِّ، وَذَلِكَ أَنَّهُمَا اخْتَصَمَا إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي أَرْضٍ وَكَانَ امْرُؤُ الْقَيْسِ الْمَطْلُوبَ وَعَبْدَانُ الطَّالِبَ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ، فَحَكَمَ عَبْدَانُ فِي أَرْضِهِ، وَلَمْ يُخَاصِمْهُ."
  }, {
    "id": 45,
    "sura": 2,
    "aya": 189,
    "text": "<p>قَوْلُهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ} الْآيَةَ {١٨٩} .قَالَ مُعَاذُ بْنُ جَبَلٍ: يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ تَغْشَانَا وَيُكْثِرُونَ مَسْأَلَتَنَا عَنِ الْأَهِلَّةِ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(١) - وَقَالَ قَتَادَةُ: ذُكِرَ لَنَا أَنَّهُمْ سَأَلُوا نَبِيَّ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لِمَ خَلَقْتَ هَذِهِ الْأَهِلَّةَ؟ فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ} وَقَالَ الْكَلْبِيُّ: نَزَلَتْ فِي مُعَاذِ بْنِ جَبَلٍ وَثَعْلَبَةَ بْنِ عَنْمَةَ وَهُمَا رَجُلَانِ مِنَ الْأَنْصَارِ قَالَا: يَا رَسُولَ اللَّهِ مَا بَالُ الْهِلَالِ يَبْدُو فَيَطْلُعُ دَقِيقًا مِثْلَ الْخَيْطِ ثُمَّ</p><p>(١) - أخرجه ابن جرير (٢/١٠٨) وعبد بن حميد (فتح القدير: ١/١٨٩) عن قتادة به مرسلاً وسنده صحيح ويشهد له:</p><p>١ - ما أخرجه ابن جرير (٢/١٠٨) وابن أبي حاتم (لباب النقول: ٣٥) من طريق عطية العوفي عن ابن عباس رضي الله عنهما نحوه، وإسناده ضعيف بسبب عطية (تقريب التهذيب: ٢/٢٤ - رقم: ٢١٦) (ميزان الاعتدال: ٣/٧٩ - رقم: ٥٦٦٧) (الإتقان: ٢/٨٩) .</p><p>٢ - ما أخرجه ابن جرير (٢/١٠٨) عن الربيع وابن جريج نحوه وهي مراسيل ضعيفة، تقوي الراوية الأولى. يَزِيدُ حَتَّى يَعْظُمَ وَيَسْتَوِيَ وَيَسْتَدِيرَ، ثُمَّ لَا يَزَالُ يَنْقُصُ وَيَدِقُّ حَتَّى يَكُونَ كَمَا كَانَ، لَا يَكُونُ عَلَى حَالٍ وَاحِدَةٍ؟! فَنَزَلَتْ هَذِهِ الْآيَةُ.</p>"
  }, {
    "id": 45,
    "sura": 2,
    "aya": 189,
    "text": "<p>قَوْلُهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ} الْآيَةَ {١٨٩} .قَالَ مُعَاذُ بْنُ جَبَلٍ: يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ تَغْشَانَا وَيُكْثِرُونَ مَسْأَلَتَنَا عَنِ الْأَهِلَّةِ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(١) - وَقَالَ قَتَادَةُ: ذُكِرَ لَنَا أَنَّهُمْ سَأَلُوا نَبِيَّ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لِمَ خَلَقْتَ هَذِهِ الْأَهِلَّةَ؟ فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ} وَقَالَ الْكَلْبِيُّ: نَزَلَتْ فِي مُعَاذِ بْنِ جَبَلٍ وَثَعْلَبَةَ بْنِ عَنْمَةَ وَهُمَا رَجُلَانِ مِنَ الْأَنْصَارِ قَالَا: يَا رَسُولَ اللَّهِ مَا بَالُ الْهِلَالِ يَبْدُو فَيَطْلُعُ دَقِيقًا مِثْلَ الْخَيْطِ ثُمَّ</p><p>(٢) - قَوْلُهُ تَعَالَى: {وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا} {١٨٩} .أَخْبَرَنَا مُحَمَّدُ بْنُ إبراهيم المزكي قال: أَخْبَرَنَا أَبُو عَمْرِو بن مطر قال: أَخْبَرَنَا أَبُو خليفة قال: حَدَّثَنَا أَبُو الْوَلِيدِ وَالْحَوْضِيُّ قَالَا: حَدَّثَنَا شُعْبَةُ قَالَ: أَنْبَأَنَا أَبُو إِسْحَاقَ قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ: كَانَتِ الْأَنْصَارُ إِذَا حَجُّوا فَجَاءُوا لَا يَدْخُلُونَ مِنْ أَبْوَابِ بُيُوتِهِمْ، وَلَكِنْ مِنْ ظُهُورِهَا، فَجَاءَ رَجُلٌ فَدَخَلَ مِنْ قِبَلَ بَابٍ، فَكَأَنَّهُ عُيِّرَ بِذَلِكَ، فَنَزَلَتْ هَذِهِ الْآيَةُ. رَوَاهُ الْبُخَارِيُّ عَنْ أَبِي الْوَلِيدِ، وَرَوَاهُ مُسْلِمٌ عَنْ بُنْدَارٍ، عَنْ غُنْدَرٍ، عَنْ شُعْبَةَ.(٣) - أَخْبَرَنَا أَبُو بكر التميمي قال: حَدَّثَنَا أبو الشيخ قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بن عبيد قال: حَدَّثَنَا عُبَيْدَةُ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ قَالَ: كَانَتْ قُرَيْشٌ تُدْعَى الْحُمْسَ، وَكَانُوا يَدْخُلُونَ مِنَ الْأَبْوَابِ فِي الْإِحْرَامِ وَكَانَتِ الْأَنْصَارُ وَسَائِرُ الْعَرَبِ لَا يَدْخُلُونَ مِنْ بَابٍ فِي الْإِحْرَامِ، فَبَيْنَمَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي بُسْتَانٍ، إِذْ خَرَجَ مِنْ بَابِهِ وَخَرَجَ مَعَهُ قُطْبَةُ بْنُ عَامِرٍ الْأَنْصَارِيُّ، فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّ قُطْبَةَ بْنَ عَامِرٍ رَجُلٌ فَاجِرٌ وَإِنَّهُ خَرَجَ مَعَكَ مِنَ الْبَابِ فَقَالَ لَهُ: \"مَا حَمَلَكَ عَلَى مَا صَنَعْتَ؟ \" قَالَ: رَأَيْتُكَ فَعَلْتَهُ فَفَعَلْتُ كَمَا فَعَلْتَ. فَقَالَ: \"إِنِّي أَحْمَسِيٌّ\" قَالَ: فَإِنَّ دِينِي دِينُكَ، فَأَنْزَلَ اللَّهُ: {وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا} وَقَالَ الْمُفَسِّرُونَ: كَانَ النَّاسُ فِي الْجَاهِلِيَّةِ وَفِي أَوَّلِ الْإِسْلَامِ إِذَا أَحْرَمَ الرَّجُلُ مِنْهُمْ بِالْحَجِّ أَوِ الْعُمْرَةِ لَمْ يَدْخُلْ حَائِطًا وَلَا بَيْتًا وَلَا دَارًا مِنْ بَابِهِ، فَإِنْ كَانَ مِنْ أَهْلِ الْمُدُنِ نَقَّبَ نَقْبًا فِي ظَهْرِ بَيْتِهِ مِنْهُ يَدْخُلُ وَيَخْرُجُ، أَوْ يَتَّخِذُ سُلَّمًا فَيَصْعَدُ فِيهِ، وَإِنْ كَانَ مِنْ أَهْلِ الْوَبَرِ خَرَجَ مِنْ خَلْفِ الْخَيْمَةِ وَالْفُسْطَاطِ وَلَا يَدْخُلُ مِنَ الْبَابِ حَتَّى يَحِلَّ مِنْ إِحْرَامِهِ وَيَرَوْنَ ذَلِكَ دِينًا إِلَّا أَنْ يَكُونَ مِنَ الْحُمْسِ، وَهُمْ قُرَيْشٌ وَكِنَانَةُ وَخُزَاعَةُ وَثَقِيفٌ وَخَثْعَمُ وَبَنُو عَامِرِ بْنِ صَعْصَعَةَ وَبَنُو النَّضْرِ بْنِ مُعَاوِيَةَ سُمُّوا حُمْسًا لِشِدَّتِهِمْ فِي دِينِهِمْ، قَالُوا: فَدَخَلَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ذَاتَ يَوْمٍ بَيْتًا لِبَعْضِ الْأَنْصَارِ، فَدَخَلَ رَجُلٌ مِنَ الْأَنْصَارِ عَلَى أَثَرِهِ مِنَ الْبَابِ وَهُوَ مُحْرِمٌ، فَأَنْكَرُوا عَلَيْهِ، فَقَالَ لَهُ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"لِمَ دَخَلْتَ مِنَ الْبَابِ وَأَنْتَ مُحْرِمٌ؟ \" فَقَالَ: رَأَيْتُكَ دَخَلْتَ مِنَ الْبَابِ فَدَخَلْتُ عَلَى أَثَرِكَ، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"إِنِّي أَحْمَسِيٌّ\" قَالَ الرَّجُلُ: إِنْ كُنْتَ أَحْمَسِيًّا فَإِنِّي أَحْمَسِيٌّ، دِينُنَا وَاحِدٌ رَضِيتُ بِهَدْيِكَ وَسَمْتِكَ وَدِينِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (٢/١٠٨) وعبد بن حميد (فتح القدير: ١/١٨٩) عن قتادة به مرسلاً وسنده صحيح ويشهد له:</p><p>١ - ما أخرجه ابن جرير (٢/١٠٨) وابن أبي حاتم (لباب النقول: ٣٥) من طريق عطية العوفي عن ابن عباس رضي الله عنهما نحوه، وإسناده ضعيف بسبب عطية (تقريب التهذيب: ٢/٢٤ - رقم: ٢١٦) (ميزان الاعتدال: ٣/٧٩ - رقم: ٥٦٦٧) (الإتقان: ٢/٨٩) .</p><p>٢ - ما أخرجه ابن جرير (٢/١٠٨) عن الربيع وابن جريج نحوه وهي مراسيل ضعيفة، تقوي الراوية الأولى. يَزِيدُ حَتَّى يَعْظُمَ وَيَسْتَوِيَ وَيَسْتَدِيرَ، ثُمَّ لَا يَزَالُ يَنْقُصُ وَيَدِقُّ حَتَّى يَكُونَ كَمَا كَانَ، لَا يَكُونُ عَلَى حَالٍ وَاحِدَةٍ؟! فَنَزَلَتْ هَذِهِ الْآيَةُ.</p><p>(٢) - أخرجه البخاري (فتح الباري: ٣/٦٢١ - ح: ١٨٠٣) ومسلم (٤/٢٣١٩ - ح: ٣٠٢٦) والطيالسي (منحة المعبود: ٢/١٢ - ح: ١٩٢٧) وابن جرير (٢/١٠٨) عن البراء به ويشهد له: الرواية الآتية.</p><p>(٣) - أخرجه الحاكم (لباب النقول: ٣٦) وابن خزيمة (فتح الباري: ٣/٦٢١) من طريق الأعمش به. وسنده صحيح على شرط مسلم (فتح الباري: ٣/٦٢١) .</p>"
  }, {
    "id": 46,
    "sura": 2,
    "aya": 190,
    "text": "قَوْلُهُ تَعَالَى: {وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ} الْآيَةَ {١٩٠} .قَالَ الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ: نَزَلَتْ هَذِهِ الْآيَاتُ فِي صُلْحِ الْحُدَيْبِيَةِ، وَذَلِكَ أَنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لَمَّا صُدَّ عَنِ الْبَيْتِ هُوَ وَأَصْحَابُهُ، نَحَرَ الْهَدْيَ بِالْحُدَيْبِيَةِ، ثُمَّ صَالَحَهُ الْمُشْرِكُونَ عَلَى أَنْ يَرْجِعَ عَامَهُ، ثُمَّ يَأْتِي الْقَابِلَ عَلَى أَنْ يُخْلُوا لَهُ مَكَّةَ ثَلَاثَةَ أَيَّامٍ، فَيَطُوفُ بِالْبَيْتِ ويفعل ما شاء، وَصَالَحَهُمْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؛ فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ تَجَهَّزَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَصْحَابُهُ لِعُمْرَةِ الْقَضَاءِ، وَخَافُوا أَنْ لَا تَفِيَ لَهُمْ قُرَيْشٌ بِذَلِكَ، وَأَنْ يَصُدُّوهُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَيُقَاتِلُوهُمْ، وَكَرِهَ أَصْحَابُهُ قِتَالَهُمْ فِي الشَّهْرِ الحرام، في الْحَرَامِ فَأَنْزَلَ اللَّهُ تَعَالَى: {وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ} يَعْنِي قُرَيْشًا."
  }, {
    "id": 47,
    "sura": 2,
    "aya": 194,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ} الْآيَةَ {١٩٤} .قَالَ قَتَادَةُ: أَقْبَلَ نَبِيُّ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَصْحَابُهُ فِي ذِي الْقَعْدَةِ، حَتَّى إِذَا كَانُوا بِالْحُدَيْبِيَةِ صَدَّهُمُ الْمُشْرِكُونَ، فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ دَخَلُوا مَكَّةَ، فَاعْتَمَرُوا فِي ذِي الْقَعْدَةِ، وَأَقَامُوا بِهَا ثَلَاثَ لَيَالٍ، وَكَانَ الْمُشْرِكُونَ قَدْ فَخَرُوا عَلَيْهِ حِينَ رَدُّوهُ يَوْمَ الْحُدَيْبِيَةِ، فَأَقَصَّهُ اللَّهُ تَعَالَى منهم، فأنزل الله تعالى: {الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ} الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (٢/١١٤) عنه مرسلاً مطولاً وسنده صحيح.</p>"
  }, {
    "id": 48,
    "sura": 2,
    "aya": 195,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ} {١٩٥} .أَخْبَرَنَا سَعِيدُ بْنُ محمد الزاهد قال: أَخْبَرَنَا أَبُو عَلِيِّ بْنُ أَبِي بكر الفقيه قال: أَخْبَرَنَا أَحْمَدُ بْنُ الْحُسَيْنِ بن الجنيد قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أيوب قال: حَدَّثَنَا هُشَيْمٌ عَنْ دَاوُدَ عَنِالشَّعْبِيِّ قَالَ: نَزَلَتْ فِي الْأَنْصَارِ، أَمْسَكُوا عَنِ النَّفَقَةِ فِي سَبِيلِ اللَّهِ تَعَالَى، فَنَزَلَتْ هَذِهِ الْآيَةُ، وَبِهَذَا الْإِسْنَادِ عَنْ هُشَيْمٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ عِكْرِمَةَ قَالَ: نَزَلَتْ فِي النَّفَقَاتِ فِي سَبِيلِ اللَّهِ.(٢) - أَخْبَرَنَا أَبُو بكر المهرجاني قال: أَخْبَرَنَا عَبْدِ اللَّهِ بن بطة قال: أَخْبَرَنَا أَبُو القاسم البغوي قال: حَدَّثَنَا هُدْبَةُ بن خالد قال: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ دَاوُدَ عَنِ الشَّعْبِيِّ، عَنِ الضَّحَّاكِ ابن أَبِي جُبَيْرَةَ قَالَ: كَانَتِ الْأَنْصَارُ يَتَصَدَّقُونَ وَيُطْعِمُونَ مَا شَاءَ اللَّهُ، فَأَصَابَتْهُمْ سَنَةٌ، فَأَمْسَكُوا، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - هَذِهِ الْآيَةَ.(٣) - أَخْبَرَنَا أَبُو منصور البغدادي قال: أَخْبَرَنَا أَبُو الحسن السراج قال: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الله الحضرمي قال: حدثنا هدبة قال: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ فِي قَوْلِ اللَّهِ - عَزَّ وَجَلَّ - {وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ} قَالَ: كَانَ الرَّجُلُ يُذْنِبُ الذَّنْبَ فَيَقُولُ: لَا يُغْفَرُ لِي، فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.(٤) - أَخْبَرَنَا أَبُو الْقَاسِمِ بن عبدان قال: حَدَّثَنَا مُحَمَّدُ بْنُ صَالِحِ بن هانئ قال: حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَنَسٍ الْقُرَشِيُّ قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ المقري قال: حَدَّثَنَا حَيْوَةُ بن شريح قال: أَخْبَرَنِي يَزِيدُ بْنُ أَبِي حبيب قال: أَخْبَرَنِي أَسْلَمُ أَبُو عِمْرَانَ قَالَ: كُنَّا بِالْقُسْطَنْطِينِيَّةِ، وَعَلَى أَهْلِ مِصْرَ عُقْبَةُ بْنُ عَامِرٍ الْجُهَنِيُّ صَاحِبُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَعَلَى أَهْلِ الشَّامِ فَضَالَةُ بْنُ عُبَيْدٍ صَاحِبُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَخَرَجَ مِنَ الْمَدِينَةِ صَفٌّ عَظِيمٌ مِنَ الرُّومِ، وَصَفَفْنَا لَهُمْ صَفًّا عَظِيمًا مِنَ الْمُسْلِمِينَ، فَحَمَلَ رَجُلٌ مِنَ الْمُسْلِمِينَ عَلَى صَفِّ الرُّومِ حَتَّى دَخَلَ فِيهِمْ، ثُمَّ خَرَجَ إِلَيْنَا مُقْبِلًا، فَصَاحَ النَّاسُ، فَقَالُوا: سُبْحَانَ اللَّهِ أَلْقَى بِيَدَيْهِ إِلَى التَّهْلُكَةِ، فَقَامَ أَبُو أَيُّوبَ الْأَنْصَارِيُّ صَاحِبُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: أَيُّهَا النَّاسُ إِنَّكُمْ تَتَأَوَّلُونَ هَذِهِ الْآيَةَ عَلَى غَيْرِ التَّأْوِيلِ، وَإِنَّمَا أُنْزِلَتْ هَذِهِ الْآيَةُ فِينَا مَعْشَرَ الْأَنْصَارِ، إِنَّا لَمَّا أَعَزَّ اللَّهُ تَعَالَى دينه وكثر ناصروه، قُلْنَا بَعْضُنَا لِبَعْضٍ سِرًّا مِنْ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِنَّ أَمْوَالَنَا قَدْ ضَاعَتْ، فَلَوْ أَنَّا أَقَمْنَا فِيهَا وَأَصْلَحْنَا مَا ضَاعَ مِنْهَا، فَأَنْزَلَ اللَّهُ تَعَالَى فِي كِتَابِهِ يَرُدُّ عَلَيْنَا مَا هَمَمْنَا بِهِ، فَقَالَ: {وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ} فِي الْإِقَامَةِ الَّتِي أَرَدْنَا أَنْنُقِيمَ فِي الْأَمْوَالِ فَنُصْلِحَهَا، فَأَمَرَنَا بِالْغَزْوِ، فَمَا زَالَ أَبُو أَيُّوبَ غَازِيًا فِي سَبِيلِ اللَّهِ حَتَّى قَبَضَهُ اللَّهُ - عَزَّ وَجَلَّ -. </p><p>(١) - أخرجه ابن جرير (٢/١١٧) عن الشعبي به، وأخرج الأثر القادم عن عكرمة أيضًا (٢/١١٧) .</p><p>(٢) - أخرجه الطبراني (المعجم الكبير: ٢٢/٣٩٠ - ح: ٩٧٠) وابن أبي حاتم (فتح الباري: ٨/١٨٥) والبغوي وابن السكن (العجاب لابن حجر: ورقة ٧١ ب) وعبد بن حميد وأبو يعلى وابن المنذر وابن حبان (فتح القدير: ١/١٩٤) كلهم عن الضحاك به.</p><p>وصححه الهيثمي (مجمع الزوائد: ٦/٣١٧) والسيوطي (لباب النقول: ٣٧) وقال ابن السكن - بفتح الكاف -: مرسل. (العجاب: ورقة ٧١ ب) قلت: وذلك للاختلاف في صحبة الضحاك (الإصابة: ٤/٣١ - رقم ١٨٨) وعلى فرض إرساله فله شواهد يصح بها منها:</p><p>ما تقدم عن الشعبي وعكرمة، والرواية بعد التالية.</p><p>(٣) - أخرجه الطبراني (مجمع الزوائد: ٦/٣١٧) وابن جرير (٢/١١٨) وابن المنذر وعبد بن حميد وابن مردويه والبيهقي (فتح القدير: ١/١٩٤) عن النعمان رضي الله عنه به.</p><p>وصححه الهيثمي (مجمع الزوائد: ٦/٣١٧) والحافظ ابن حجر (فتح الباري: ٨/١٨٥) ، ويشهد له:</p><p>* ما أخرجه الحاكم (المستدرك: ٢/٢٧٥) والترمذي وابن مردوية (تفسير ابن كثير: ١/٢٢٩) عن البراء رضي الله عنه نحوه. وصححه الحاكم ووافقه الذهبي.</p><p>(٤) - أخرجه أبو داود (٣/٢٧ - ح: ٢٥١٢) والترمذي (٥/٢١٢ - ح: ٢٩٧٢) والحاكم (المستدرك: ٢/٢٧٥) والطيالسي (منحة المعبود: ٢/١٣ - ح: ١٩٢٨) وابن جرير (٢/١١٩) والطبراني (المعجم الكبير: ٤/٢١١ - ح: ٤٠٦٠) وعبد بن حميد وأبو يعلى وابن أبي حاتم وابن مردويه والبيهقي (فتح القدير: ١/١٩٤) (جمع الفوائد من جامع الأصول ومجمع الزوائد: ٢/١٧٩) كلهم عن أبي أيوب رضي الله عنه به.</p><p>وصححه الترمذي، والحاكم، ووافقه الذهبي.</p><p>قلت: نسب الحافظ ابن حجر الحديث لمسلم والنسائي (فتح الباري: ٨/١٨٥) ولم يذكرهما ابن الأثير في جامع الأصول مع من أخرج الحديث مع أنه على شرطه، ولم يذكرهما محقق سنن أبي داود وجامع الأصول، ولم أجده فيهما بعد البحث الجادّ. قال ابن أبي حاتم: وروي عن ابن عباس، ومجاهد، وعكرمة، وسعيد بن جبير، وعطاء، والضحاك، والحسن، وقتادة، والسدي، ومقاتل بن حيان، نحو ذلك.</p><p>ويشهد للروايات السابقة:</p><p>١ - ما أخرجه البخاري (فتح الباري: ٨/١٨٥ - ح: ٤٥١٦) وابن جرير (٢/١١٦) وابن أبي حاتم (بتفسير ابن كثير: ١/٢٢٨) وعبد بن حميد والبيهقي وسعيد بن منصور وابن المنذر (فتح القدير: ١/١٩٣) عن حذيفة رضي الله عنه قال: نزلت في النفقة في سبيل الله. وفي لفظ: نزلت في ترك النفقة في سبيل الله.</p><p>٢ - ما أخرجه ابن جرير (٢/١١٧) عن ابن عباس رضي الله عنهما بسند صحيح نحوه.</p>"
  }, {
    "id": 49,
    "sura": 2,
    "aya": 196,
    "text": "<p>قَوْلُهُ تَعَالَى: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ} {١٩٦} .أَخْبَرَنَا أَبُو طاهر الزيادي قال: أَخْبَرَنَا أَبُو طَاهِرٍ مُحَمَّدُ بْنُ الحسن المحمدأباذي قال: حَدَّثَنَا العباس الدوري قال: حَدَّثَنَا عُبَيْدُ اللَّهِ بن موسى قال: حَدَّثَنَا إِسْرَائِيلُ عَنْ عَبْدِ الرَّحْمَنِ الْأَصْفَهَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ، عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ: فِيَّ نَزَلَتْ هَذِهِ الْآيَةُ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ} وَقَعَ الْقَمْلُ فِي رَأْسِي فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: \" احْلِقْ وَافْدِهِ صِيَامَ ثَلَاثَةِ أَيَّامٍ، أَوِ النُّسُكَ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ لِكُلِّ مِسْكِينٍ صَاعٌ\".أَخْبَرَنَا مُحَمَّدُ بْنُ إبراهيم المزكي قال: حَدَّثَنَا أَبُو عَمْرِو بْنُ مطر إملاء قال: أَخْبَرَنَا أبو خليفة قال: حَدَّثَنَا مُسَدَّدٌ، عن بشر قال: حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: قَالَ كَعْبُ بْنُ عُجْرَةَ: فِيَّ أُنْزِلَتْ هَذِهِ الْآيَةُ أَتَيْتُ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: \"ادْنُهْ\" فَدَنَوْتُ مَرَّتَيْنِ أَوْ ثَلَاثًا فَقَالَ: \"أَيُؤْذِيكَ هَوَامُّكَ؟ \" قَالَ ابْنُ عَوْنٍ: وَأَحْسَبُهُ قَالَ: نَعَمْ؛ فَأَمَرَنِي بِصِيَامٍ، أَوْ صَدَقَةٍ، أَوْ نُسُكِ مَا تَيَسَّرَ. رَوَاهُ مُسْلِمٌ، عَنْ أَبِي مُوسَى، عَنِ ابْنِ أَبِي عَدِيٍّ، وَرَوَاهُ الْبُخَارِيُّ، عَنْ أَحْمَدَ بْنِ يُونُسَ، عَنِ ابْنِ شِهَابٍ، كِلَاهُمَا عَنِ ابْنِ عَوْنٍ.(١) - أَخْبَرَنَا أَبُو نَصْرٍ أَحْمَدُ بْنُ عَبْدِ الله المخلدي قال: أَخْبَرَنَا أَبُو الحسن السراج قال: أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ سليمان المروزي قال: حَدَّثَنَا عَاصِمُ بْنُ علي قال: حَدَّثَنَا شعبةقال: أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الأصفهاني قال: سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ قَالَ: قَعَدْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ فِي هَذَا الْمَسْجِدِ، مَسْجِدِ الْكُوفَةِ، فَسَأَلْتُهُ عَنْ هَذِهِ الْآيَةِ {فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} قَالَ: حُمِلْتُ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي، فَقَالَ: \"مَا كُنْتُ أَرَى أَنَّ الْجَهْدَ بَلَغَ مِنْكَ هَذَا، مَا تَجِدُ شَاةً؟ \" قُلْتُ: لَا فَنَزَلَتْ هَذِهِ الْآيَةُ: {فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} قَالَ: \"صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ مِنْ طَعَامٍ\". فَنَزَلَتْ فِيَّ خَاصَّةً، وَلَكُمْ عَامَّةً. رَوَاهُ الْبُخَارِيُّ، عَنْ آدَمَ بْنِ أَبِي إِيَاسٍ وَأَبِي الْوَلِيدِ، وَرَوَاهُ مُسْلِمٌ، عَنْ بُنْدَارٍ، عَنْ غُنْدَرٍ، كُلُّهُمْ عَنْ شُعْبَةَ.أَخْبَرَنَا أَبُو إِبْرَاهِيمَ إِسْمَاعِيلُ بْنُ إبراهيم الصوفي قال: أَخْبَرَنَا مُحَمَّدُ بْنُ علي الغفاري قال: أَخْبَرَنَا إِسْحَاقُ بْنُ محمد الرسعني قال: حَدَّثَنَا جدي قال: حدثنا المغيرة الصقلابي قال: حَدَّثَنَا عُمَرُ بْنُ بِشْرٍ الْمَكِّيُّ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا نَزَلْنَا الْحُدَيْبِيَةَ، جَاءَ كَعْبُ بن عجرة تنتثر هَوَامُّ رَأْسِهِ عَلَى جَبْهَتِهِ فَقَالَ: يَا رَسُولَ اللَّهِ هَذَا الْقَمْلُ قَدْ أَكَلَنِي، قَالَ: \"احْلِقْ وَافْدِهِ\" قَالَ: فَحَلَقَ كَعْبٌ فَنَحَرَ بَقَرَةً، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - فِي ذَلِكَ الْمَوْقِفِ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ} الْآيَةَ، قَالَ ابْنُ عَبَّاسٍ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"الصِّيَامُ ثَلَاثَةُ أَيَّامٍ، وَالنُّسُكُ شَاةٌ، وَالصَّدَقَةُ الْفَرْقُ بَيْنَ سِتَّةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدَّانِ\".(٢) - أَخْبَرَنَا مُحَمَّدُ بْنُ محمد المنصوري قال: أخبرني عَلِيُّ بْنُ عمر الحافظ قال: حدثناعَبْدُ اللَّهِ بن المهتدي قال: حَدَّثَنَا طَاهِرُ بْنُ عيسى التميمي قال: حَدَّثَنَا زُهَيْرُ ابن عباد قال: حَدَّثَنَا مُصْعَبُ بْنُ مَاهَانَ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ: مَرَّ بِهِ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَهُوَ يُوقِدُ تَحْتَ قِدْرٍ لَهُ بِالْحُدَيْبِيَةِ، فَقَالَ: \"أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ؟ \" قَالَ: نَعَمْ، قَالَ. \"احْلِقْ\" فَأُنْزِلَتْ هَذِهِ الْآيَةُ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} قَالَ: \"فَالصِّيَامُ ثَلَاثَةُ أَيَّامٍ، وَالصَّدَقَةُ فَرَقٌ بَيْنَ سِتَّةِ مَسَاكِينَ، وَالنُّسُكُ شَاةٌ\".أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبَّاسٍ الْهَرَوِيُّ فِيمَا كَتَبَ إِلَيَّ أَنَّ الْعَبَّاسَ بْنَ الْفَضْلِ بْنِ زَكَرِيَّا حَدَّثَهُمْ عَنْ أَحْمَدَ بْنِ نَجْدَةَ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصْفَهَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ قَالَ:كُنَّا جُلُوسًا فِي الْمَسْجِدِ فَجَلَسَ إِلَيْنَا كَعْبُ بْنُ عُجْرَةَ فَقَالَ: فِيَّ أُنْزِلَتْ هَذِهِ الْآيَةُ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ} قَالَ: قُلْتُ: كَيْفَ كَانَ شَأْنُكَ؟ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مُحْرِمِينَ فَوَقَعَ الْقَمْلُ فِي رَأْسِي وَلِحْيَتِي وَشَارِبِي حَتَّى وَقَعَ في حاجبي فذكر ذَلِكَ لِلنَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: \"مَا كُنْتُ أَرَى أَنَّ الْجَهْدَ بَلَغَ مِنْكَ هَذَا. ادْعُوا الْحَالِقَ\". فَجَاءَ الْحَالِقُ فَحَلَقَ رَأْسِي. فَقَالَ: \"هَلْ تَجِدُ نَسِيكَةً؟ \" قُلْتُ: لَا وَهِيَ شَاةٌ. قَالَ: \"فَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ ثَلَاثَةَ آصُعٍ بَيْنَ سِتَّةِ مَسَاكِينَ\". قَالَ: فَأُنْزِلَتْ فِيَّ خَاصَّةً وَهِيَلِلنَّاسِ عَامَّةً.</p><p>(١) - أخرجه البخاري (فتح الباري: ٨/١٨٦ - ح: ٤٥١٧) ومسلم (٢/٨٦١ - ح: ٨٥ ٨٦) وابن ماجه (٢/١٠٢٨ - ح: ٣٠٧٩) وأبو داود الطيالسي (٢/١٣ - ح: ١٩٢٩) والإمام أحمد (الفتح الرباني: ١١/٢٢١) وابن جرير (٢/١٣٥) عن عبد الله بن معقل به.</p><p>(٢) - أخرجه البخاري (فتح الباري: ٧/٤٤٤ - ح: ٤١٥٩) ومسلم (٢ - ٨٦٠ - ح: ٨٠ - ٨٤) ومالك (الموطّأ: ١٦٩ - ح: ٥٠٤ رواية محمد بن الحسن) والطبراني (المعجم الكبير: ١٩/١١٣ - ح: ٢٣٣) وابن جرير (٢/١٣٥، ١٣٦) وابن أبي حاتم (تفسير ابن كثير: ١/٢٣٢) وأبو داود (٢/٤٣٠ - ٤٣٣، ح: ١٨٥٦ - ١٨٦١) والترمذي (٣/٢٨٨ - ح: ٩٥٣) والنسائي (جامع الأصول: ٣/٣٨٨، ٣٨٩) والإمام أحمد (الفتح الرباني: ١١/٢١٩ - ح: ١٨٢) والبيهقي في \"الدلائل\" (٤/١٤٩) من طريق ابن أبي ليلى به، وألفاظهم متقاربة ويشهد لما سبق:</p><p>١ - ما أخرجه ابن جرير (٢/١٣٧) عن عبد الله بن عمرو بن العاص نحوه وسنده حسن، وصححه الشيخ أحمد شاكر (تفسير الطبري</p><p>بتحقيقه: ٤/٦٩) .</p><p>٢ - ما أخرجه الإمام أحمد (الفتح الرباني: ١١/٢٢٢) من طريق يحيى بن جعدة عن كعب مختصرًا بمعناه، وسنده صحيح.</p><p>٣ - ما أخرجه الإمام أحمد (الفتح الرباني: ١١/٢٢١) وأبو داود (٢/٤٣١ - ح: ١٨٥٨) وابن جرير (٢/١٣٤) من طريق الشعبي عن كعب نحوه، وسنده صحيح.</p><p>٤ - ما أخرجه ابن ماجه (٢/١٠٢٩ - ح: ٣٠٨٠) وابن جرير (٢/١٣٦) من طريق محمد بن كعب القرظي عن كعب نحوه، وسنده صحيح.</p>"
  }, {
    "id": 50,
    "sura": 2,
    "aya": 197,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى} {١٩٧} .أَخْبَرَنَا عَمْرُو بْنُ عمرو المزكي قال: حدثنا محمد بن مكي قال: أَخْبَرَنَا مُحَمَّدُ بن يوسف قال: أَخْبَرَنَا مُحَمَّدُ بن إسماعيل قال: حدثني يَحْيَى بْنُ بشير قال: حَدَّثَنَا شَبَابَةُ، عَنْ وَرْقَاءَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ أَهْلُ الْيَمَنِ يَحُجُّونَ وَلَا يَتَزَوَّدُونَ يَقُولُونَ: نَحْنُ الْمُتَوَكِّلُونَ فَإِذَا قَدِمُوا مَكَّةَ سَأَلُوا النَّاسَ فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى} وَقَالَ عَطَاءُ بْنُ أَبِي رَبَاحٍ: كَانَ الرَّجُلُ يَخْرُجُ فَيَحْمِلُ كَلَّهُ عَلَى غَيْرِهِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى}</p><p>(١) - أخرجه البخاري (فتح الباري: ٣/٣٨٤ - ح: ١٥٢٣) وأبو داود (٢/٣٤٩ - ح: ١٧٣٠) والنسائي وابن أبي حاتم والحاكم في تاريخه (فتح الباري: ٣/٣٨٤) وعبد بن حميد وابن حبان (تفسير ابن كثير: ١/٢٣٩) وابن جرير (٢/١٦٢) كلهم عن عكرمة به ويشهد له:</p><p>* ما أخرجه ابن جرير (٢/١٦٢) وسعيد بن منصور وابن أبي حاتم (فتح الباري: ٣/٣٨٤) عن عكرمة مرسلاً نحوه. وسنده صحيح.<p>"
  }, {
    "id": 51,
    "sura": 2,
    "aya": 198,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ} الْآيَةَ {١٩٨}أَخْبَرَنَا مَنْصُورُ بْنُ عَبْدِ الْوَهَّابِ الْبَزَّارُ، أَخْبَرَنَا أَبُو عَمْرٍو مُحَمَّدُ بْنُ أَحْمَدَ الْحِيرِيُّ، عَنْ شُعَيْبِ بْنِ عليّ الزَّراع قال: أخبرنا عِيسَى بْنُ مساور قال: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الفزاري قال: حَدَّثَنَا الْعَلَاءُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي أُمَامَةَ التَّيْمِيِّ قَالَ: سَأَلْتُ ابْنَ عُمَرَ فَقُلْتُ: إِنَّا قَوْمٌ نُكْرَى فِي هَذَا الْوَجْهِ، وَإِنَّ قَوْمًا يَزْعُمُونَ أَنَّهُ لَا حَجَّ لَنَا قَالَ: أَلَسْتُمْ تُلَبُّونَ؟ أَلَسْتُمْ تَطُوفُونَ؟ أَلَسْتُمْ تَسْعَوْنَ بَيْنَ الصَّفَا وَالْمَرْوَةِ؟ أَلَسْتُمْ أَلَسْتُمْ؟ قَالَ: قُلْتُ: بَلَى قَالَ: إِنَّ رَجُلًاسَأَلَ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَمَّا سَأَلْتَ عَنْهُ فَلَمْ يَدْرِ مَا يَرُدُّ عَلَيْهِ حَتَّى نَزَلَتْ: {لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ} فَدَعَاهُ فَتَلَا عَلَيْهِ حِينَ نَزَلَتْ. فَقَالَ: \"أَنْتُمُ الْحُجَّاجُ\".(٢) - أَخْبَرَنَا أَبُو بكر التميمي قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بن خشنام قال: حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بن عثمان قال: حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ ذُو الْمَجَازِ وَعُكَاظُ مَتْجَرًا لِلنَّاسِ فِي الْجَاهِلِيَّةِ، فَلَمَّا جَاءَ الْإِسْلَامُ كَأَنَّهُمْ كَرِهُوا، ذَلِكَ حَتَّى نَزَلَتْ: {لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ} فِي مَوَاسِمِ الْحَجِّ. وَرَوَى مُجَاهِدٌ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانُوا يَتَّقُونَ الْبُيُوعَ وَالتِّجَارَةَ فِي الْحَجِّ يَقُولُونَ أَيَّامُ ذِكْرِ اللَّهِ فَأَنْزَلَ اللَّهُ تَعَالَى: {لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ} فَاتَّجَرُوا.</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/٨٤ - ح: ١٨١) وأبو داود (٢/٣٥٠ - ح: ١٧٣٣) والحاكم (المستدرك: ١/٤٤٩) والدارقطني (٢/٢٩٢ - ح: ٢٥٠ ٢٥٥) وابن أبي حاتم (لباب النقول: ٣٩) وعبد بن حميد وسعيد بن منصور وابن أبي شيبة وابن المنذر والبيهقي (فتح القدير: ١/٢٠٣) وابن جرير (٢٢/١٦٤) كلهم من طريق أبي أمامة التيمي به وهو حديث صحيح صححه الحاكم والشيخ أحمد شاكر (تفسير الطبري بتحقيقه: ٤/١٦٤) والشيخ أحمد البنا (الفتح الرباني: ١٨/٨٥) ومحقق جامع الأصول (حاشية جامع الأصول: ٢/٣٧) ويشهد له: الرواية الآتية.</p><p>(٢) - أخرجه البخاري (فتح الباري: ٣/٣٩٥ - ح: ١٧٧٠) وأبو داود (٢/٣٥١ - ح: ١٧٣٤) والطبراني (المعجم الكبير: ١١/١١٣ - ح: ١١٢١٣) وابن جرير (٢/١٦٤، ١٦٥) وسعيد بن منصور وعبد الرزاق (تفسير ابن كثير: ١/٢٣٩) من طريق عمرو بن دينار به. ويشهد له:</p><p>١ - ما أخرجه ابن جرير (٢/١٦٥) وسعيد بن منصور وابن أبي شيبة وعبد بن حميد (فتح القدير: ١/٢٠٣) عن ابن عباس رضي الله عنهما نحوه وفيه ضعف بسبب يزيد بن أبي زياد (تقريب التهذيب: ٢/٣٦٥ - رقم ٢٥٤) لكن يتقوى بما قبله.</p><p>٢ - ما أخرجه ابن جرير (٢/١٦٥، ١٦٦) وسعيد بن منصور وعبد الرزاق (تفسير ابن كثير: ١/٢٤٠) عن رجل من بني تيم - وهو أبو أمامة - عن ابن عمر بنحو الرواية السابقة عن أبي أمامة: إنا قوم نكري.. ح. وصححه الشيخ أحمد محمد شاكر (تفسير الطبري بتحقيقه: ٤/١٦٩) .</p><p>٣ - ما أخرجه ابن جرير (٢/١٦٤) عن ابن عمر رضي الله عنهما مختصرًا بمعناه، وقوّاه الحافظ ابن كثير (تفسير ابن كثير: ١/٢٤٠) .</p>"
  }, {
    "id": 52,
    "sura": 2,
    "aya": 199,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ} {١٩٩} .أَخْبَرَنَا التَّمِيمِيُّ بِالْإِسْنَادِ الْمُتَقَدِّمِ الَّذِي ذَكَرْنَا، عَنْ يَحْيَى بْنِ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: كَانَتِ الْعَرَبُ تُفِيضُ مِنْ عَرَفَاتٍ، وَقُرَيْشٌ وَمَنْ دَانَ بِدِينِهَا تُفِيضُ مِنْ جَمْعٍ مِنَ الْمَشْعَرِ الْحَرَامِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ}(٢) - أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ جعفر المزكي، قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بن زكريا قال أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن السرخسي قال: أخبرنا أَبُو بَكْرِ بْنُ أبي خيثمة قال: حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا سُفْيَانُ بْنُ عيينة قال: أَخْبَرَنِي عَمْرُو بْنُ دينار قال: أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ قَالَ: أَضْلَلْتُ بَعِيرًا لِي يَوْمَ عَرَفَةَ، فَخَرَجْتُ أَطْلُبُهُ بِعَرَفَةَ، فَرَأَيْتُ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَاقِفًا مَعَ النَّاسِ بِعَرَفَةَ، فَقُلْتُ: هَذَا مِنَ الحمس  ماله هنا؟ !. قَالَ سُفْيَانُ: وَالْأَحْمَسُ: الشَّدِيدُ الشَّحِيحُ عَلَى دِينِهِ، وَكَانَتْ قُرَيْشٌ تُسَمَّى الْحُمْسَ، فَجَاءَهُمُ الشَّيْطَانُ فَاسْتَهْوَاهُمْ فَقَالَ لَهُمْ: إِنَّكُمْ إِنْ عَظَّمْتُمْ غَيْرَ حَرَمِكُمُ اسْتَخَفَّ النَّاسُ بِحَرَمِكُمْ فَكَانُوا لَا يَخْرُجُونَ مِنَ الْحَرَمِ وَيَقِفُونَ بِالْمُزْدَلِفَةِ، فَلَمَّا جَاءَ الْإِسْلَامُ أَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ} يَعْنِي عَرَفَةَ. رَوَاهُ مُسْلِمٌ عَنْ عَمْرٍو النَّاقِدِ عَنِ ابْنِ عُيَيْنَةَ.</p><p>(١) - أخرجه البخاري (فتح الباري: ٣/٥١٥ - ح: ١٦٦٥) (٨/١٨٦ - ح: ٤٥٢٠) ومسلم (٢/٨٩٣، ٨٩٤ - ح: ١٢١٩ \"١٥١، ١٥٢\") والترمذي (٣/٢٣١ - ح: ٨٨٤) وابن جرير (٢/١٦٩) كلهم من طريق ابن عروة عن أبيه به.</p><p>ويشهد له: الرواية الآتية.</p><p>(٢) - أخرجه البخاري (فتح الباري: ٣/٥١٥ - ح: ١٦٦٤) ومسلم (٢/٨٩٤ - ح: ١٢٢٠) والإمام أحمد (الفتح الرباني: ١٢/١٢٣ - ح: ٣٢٥) والحميدي (مسند الحميدي: ١/٢٥٥ - ح: ٥٥٩) عن جبير بن مطعم به. ويشهد له:</p><p>* ما أخرجه ابن خزيمة وإسحاق بن راهوية (فتح الباري: ٣/٥١٦) عن جبير بن مطعم نحوه، وإسناده صحيح. ويشهد للرواية الأولى كذلك:</p><p>* ما أخرجه ابن جرير (٢/١٧٠) من طريق حسين بن عبد الله عن عكرمة عن ابن عباس مثله وإسناده ضعيف بسبب حسين (الجرح والتعديل لابن أبي حاتم: ٣/٥٧ - رقم: ٢٥٨) (تفسير الطبري بتحقيق أحمد شاكر: ٤/١٨٦) لكن يتقَوَّى بالأصل.</p>"
  }, {
    "id": 53,
    "sura": 2,
    "aya": 200,
    "text": "قَوْلُهُ تَعَالَى: {فَإِذَا قَضَيْتُمْ مَنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ} الْآيَةَ {٢٠٠} .قَالَ مُجَاهِدٌ: كَانَ أَهْلُ الْجَاهِلِيَّةِ إِذَا اجْتَمَعُوا بِالْمَوْسِمِ ذَكَرُوا فِعْلَ آبَائِهِمْ فِي الْجَاهِلِيَّةِ وَأَيَّامِهِمْ وَأَنْسَابِهِمْ فَتَفَاخَرُوا فَأَنْزَلَ اللَّهُ تَعَالَى: {فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا}وَقَالَ الْحَسَنُ: كَانَتِ الْأَعْرَابُ إِذَا حَدَّثُوا وتكلموا يَقُولُونَ: وَأَبِيكَ إِنَّهُمْ لَفَعَلُوا كَذَا وَكَذَا. فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ."
  }, {
    "id": 54,
    "sura": 2,
    "aya": 204,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَمِنَ النَّاسِ مَنْ يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا} الْآيَةَ {٢٠٤} .قَالَ السُّدِّيُّ نَزَلَتْ فِي الْأَخْنَسِ بْنِ شَرِيقٍ الثَّقَفِيِّ، وَهُوَ حَلِيفُ بَنِي زُهْرَةَ أَقْبَلَ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى الْمَدِينَةِ، فَأَظْهَرَ لَهُ الْإِسْلَامَ وَأَعْجَبَ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ذَلِكَ مِنْهُ، وَقَالَ: إِنَّمَا جِئْتُ أُرِيدُ الْإِسْلَامَ، وَاللَّهُ يعلم إني صادق، وَذَلِكَ قَوْلُهُ: {وَيُشْهِدُ اللَّهَ عَلَى مَا فِي قَلْبِهِ} ثُمَّ خَرَجَ مِنْ عِنْدِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَمَرَّ بِزَرْعٍ لِقَوْمٍ مِنَ الْمُسْلِمِينَ وَحُمُرٍ فَأَحْرَقَ الزَّرْعَ وَعَقَرَ الْحُمُرَ فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِ: {وَإِذَا تَوَلَّى سَعَى فِي الْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ}</p><p>(١) - أخرجه ابن جرير (٢/١٨١) وابن المنذر وابن أبي حاتم عن السدي به وإسناده ضعيف معضل (منقطع براويين متتابعين) .</p>"
  }, {
    "id": 55,
    "sura": 2,
    "aya": 207,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَمِنَ النَّاسِ مَنْ يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاةِ اللَّهِ} الْآيَةَ {٢٠٧} قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ: أَقْبَلَ صُهَيْبٌ مُهَاجِرًا نَحْوَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَاتَّبَعَهُ نَفَرٌ مِنْ قُرَيْشٍ مِنَ الْمُشْرِكِينَ، فَنَزَلَ عَنْ رَاحِلَتِهِ وَنَثَرَ مَا فِي كِنَانَتِهِ وَأَخَذَ قَوْسَهُ، ثُمَّ قَالَ: يَا مَعْشَرَ قُرَيْشٍ لَقَدْ عَلِمْتُمْ أَنِّي مِنْ أَرْمَاكُمْ رَجُلًا، وَايْمُ اللَّهِ لَا تَصِلُونَ إِلَيَّ حَتَّى أَرْمِيَ بِمَا فِي كِنَانَتِي، ثُمَّ أَضْرِبُ بِسَيْفِي مَا بَقِيَ فِي يَدِي مِنْهُ شَيْءٌ، ثُمَّ افْعَلُوا ما شئتم قالوا: دُلَّنَا عَلَى بَيْتِكَ وَمَالِكَ بِمَكَّةَ وَنُخْلِي عَنْكَ، وَعَاهَدُوهُ إِنْ دَلَّهُمْ أَنْ يَدَعُوهُ فَفَعَلَ. فَلَمَّا قدم على النبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ: \"أَبَا يَحْيَى رَبِحَ الْبَيْعُ رَبِحَ الْبَيْعُ\"، وَأَنْزَلَ اللَّهُ: {وَمِنَ النَّاسِ مَنْ يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاةِاللَّهِ} وَقَالَ الْمُفَسِّرُونَ: أَخَذَ الْمُشْرِكُونَ صُهَيْبًا فَعَذَّبُوهُ، فَقَالَ لَهُمْ صُهَيْبٌ: إِنِّي شَيْخٌ كَبِيرٌ لَا يَضُرُّكُمْ أَمِنْكُمْ كُنْتُ أَمْ مِنْ غَيْرِكُمْ، فَهَلْ لَكُمْ أَنْ تَأْخُذُوا مَالِي وَتَذَرُونِي وَدِينِي؟ فَفَعَلُوا ذَلِكَ وَكَانَ قَدْ شَرَطَ عَلَيْهِمْ رَاحِلَةً وَنَفَقَةً، فَخَرَجَ إِلَى الْمَدِينَةِ فَتَلَقَّاهُ أَبُو بَكْرٍ وَعُمَرُ فِي رِجَالٍ، فَقَالَ لَهُ أَبُو بَكْرٍ: رَبِحَ بَيْعُكَ أَبَا يَحْيَى، فَقَالَ صُهَيْبٌ: وَبَيْعُكَ فَلَا يَخْسَرُ، مَا ذَاكَ؟ فَقَالَ: أَنْزَلَ اللَّهُ فِيكَ كَذَا، وَقَرَأَ عَلَيْهِ هَذِهِ الْآيَةَ.وَقَالَ الْحَسَنُ: أَتَدْرُونَ فِيمَنْ نَزَلَتْ هَذِهِ الْآيَةُ؟ فِي أَنَّ الْمُسْلِمَ يَلْقَى الْكَافِرَ فَيَقُولُ لَهُ: قُلْ لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قُلْتَهَا عَصَمْتَ مَالَكَ وَدَمَكَ فَأَبَى أَنْ يَقُولَهَا فَقَالَ الْمُسْلِمُ: وَاللَّهِ لَأَشْرِيَنَّ نَفْسِي لِلَّهِ فَتَقَدَّمَ فقاتل حتى يقتل. وَقِيلَ: نَزَلَتْ فِيمَنْ أَمَرَ بِالْمَعْرُوفِ وَنَهَى عَنِ الْمُنْكَرِ. قَالَ أَبُو الْخَلِيلِ: سَمِعَ عُمَرُ بْنُ الْخَطَّابِ إِنْسَانًا يَقْرَأُ هَذِهِ الْآيَةَ فَقَالَ عُمَرُ: إِنَّا لِلَّهِ قَامَ رَجُلٌ يَأْمُرُ بِالْمَعْرُوفِ وَيَنْهَى عَنِ الْمُنْكَرِ فَقُتِلَ.</p><p>(١) - أخرجه الحارث بن أبي أسامة في \"مسنده\" وابن أبي حاتم (لباب النقول: ٤٠) ابن المنذر وأبو نعيم وابن عساكر (فتح القدير: ١/٢١٠) عن ابن المسَيَّبِ به، وهو مرسل، ومراسيل سعيد صحيحة (تهذيب التهذيب: ٤/٨٥) . وأسنده الحاكم (المستدرك: ٣/٤٠٠) والطبراني (المعجم الكبير: ٨/٣٧ - ح: ٧٢٩٦) والبيهقي في \"الدلائل\" (٢/٥٢٢) من طريق ابن المسيب عن صهيب رضي الله عنه مثله وليس فيه التنصيص على نزول الآية. ويشهد له:</p><p>* ما أخرجه الحاكم (المستدرك: ٣/٣٩٨) وابن المنذر (فتح القدير: ١/٢١٠) عن أنس رضي الله عنه قال: نزلت في خروج صهيب مهاجرًا إلى النبي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.</p>"
  }, {
    "id": 56,
    "sura": 2,
    "aya": 208,
    "text": "<p>(١) - قَوْلُهُ - عز وجل - {يَا أَيّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً} الآية {٢٠٨} .أَخْبَرَنِي أبو نعيم الأصبهاني فيما أذن لي فِي رِوَايَتِهِ عَنْهُ: أَخْبَرَنَا سُلَيْمَانُ بْنُ أَحْمَدَ حَدَّثَنَا بَكْرُ بْنُ سَهْلٍ حَدَّثَنَا عَبْدُ الْغَنِيِّ بْنُ سَعِيدٍ عَنْ مُوسَى بْنِ عَبْدِ الرَّحْمَنِ الصَّنْعَانِيِّ عَنِ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ قَالَ: نَزَلَتْ هَذِهِ الْآيَةُ فِي عَبْدِ اللَّهِ بْنِ سَلَامٍ وَأَصْحَابِهِ، وَذَلِكَ أَنَّهُمْ حِينَ آمَنُوا بِالنَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَامُوا بِشَرَائِعِهِ وَشَرَائِعِ مُوسَى، فَعَظَّمُوا السَّبْتَ وَكَرِهُوا لُحْمَانَ الإبل وألبانها بعدما أَسْلَمُوا، فَأَنْكَرَ ذَلِكَ عَلَيْهِمُ الْمُسْلِمُونَ، فَقَالُوا: إِنَّا نَقْوَى عَلَى هَذَا وَهَذَا وقالوا للنبيّ لله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِنَّ التَّوْرَاةَ كِتَابُ اللَّهِ فَدَعْنَا فَلْنَعْمَلْ بِهَا، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - في إسناده عبد الغني بن سعيد - وهو الثقفي - وهو ضعيف (لباب النقول: ١٩) وضعفه الحافظ بن كثير من جهة المعنى كذلك. (تفسير ابن كثير: ١/٢٤٨) .</p>"
  }, {
    "id": 57,
    "sura": 2,
    "aya": 214,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ} الْآيَةَ {٢١٤} .قَالَ قَتَادَةُ وَالسُّدِّيُّ: نَزَلَتْ هَذِهِ الْآيَةُ فِي غَزْوَةِ الْخَنْدَقِ حِينَ أَصَابَ الْمُسْلِمِينَ مَا أَصَابَهُمْ مِنَ الْجَهْدِ وَالشِّدَّةِ وَالْحَرِّ والخوف والبرد وسوء الْعَيْشِ وَأَنْوَاعِ الْأَذَى، وَكَانَ كَمَا قَالَ اللَّهُ تَعَالَى: {وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ} (٣) وَقَالَ عَطَاءٌ: لَمَّا دَخَلَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَصْحَابُهُ الْمَدِينَةَ اشْتَدَّ الضرّ عليهم، بأنهم خَرَجُوا بِلَا مَالٍ وَتَرَكُوا دِيَارَهُمْ وَأَمْوَالَهُمْ بِأَيْدِي الْمُشْرِكِينَ، وَآثَرُوا رِضَا اللَّهِ وَرَسُولَهُ، وَأَظْهَرَتِ الْيَهُودُ الْعَدَاوَةَ لِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَسَرَّ قَوْمٌ مِنَ الْأَغْنِيَاءِ النِّفَاقَ، فَأَنْزَلَ اللَّهُ تَعَالَى تَطْيِيبًا لِقُلُوبِهِمْ {أَمْ حَسِبْتُمْ} الْآيَةَ.</p><p>(١) - أثر قتادة أخرجه ابن جرير (٢/١٩٩) وابن المنذر (فتح القدير: ١/٢١٥) عنه به، وإسناده صحيح.</p>"
  }, {
    "id": 58,
    "sura": 2,
    "aya": 215,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {يَسْأَلُونَكَ مَاذَا يُنْفِقُونَ} الْآيَةَ {٢١٥} .قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ أَبِي صَالِحٍ: نَزَلَتْ فِي عَمْرِو بْنِ الْجَمُوحِ الْأَنْصَارِيِّ وَكَانَ شَيْخًا كَبِيرًا ذَا مَالٍ كَثِيرٍ، فَقَالَ: يَا رَسُولَ اللَّهِ بِمَاذَا نَتَصَدَّقُ؟ وَعَلَى مَنْ نُنْفِقُ؟ فَنَزَلَتْ هَذِهِ الْآيَةُ.وَقَالَ فِي رِوَايَةِ عَطَاءٍ: نَزَلَتِ الْآيَةُ فِي رَجُلٍ أَتَى النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: إِنَّ لِي دِينَارًا فَقَالَ: \"أَنْفِقْهُ عَلَى نَفْسِكَ\" فَقَالَ: إِنَّ لِي دِينَارَيْنِ، فَقَالَ: \"أَنْفِقْهُمَا عَلَى أَهْلِكَ \" فَقَالَ: إِنَّ لِي ثَلَاثَةً فَقَالَ: \"أَنْفِقْهَا عَلَى خَادِمِكَ\" فَقَالَ: إِنَّ لِي \".</p><p>(١) - قد تقدم أن رواية أبي صالح ضعيفة.</p>"
  }, {
    "id": 59,
    "sura": 2,
    "aya": 217,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ} الْآيَةَ {٢١٧} .أَخْبَرَنَا أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ عبد الله الشيرازي قال: حدثنا أبو الفضل محمد بن عَبْدِ اللَّهِ بْنِ خميرويه الهروي قال: أَخْبَرَنَا أَبُو الْحَسَنِ عَلِيُّ بْنُ مُحَمَّدٍ الخزاعي قال: حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ قال: أَخْبَرَنِي شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنِ الزُّهْرِيِّ قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ: أَنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَعَثَ سَرِيَّةً مِنَ الْمُسْلِمِينَ، وَأَمَّرَ عَلَيْهِمْ عَبْدَ اللَّهِ بْنَ جَحْشٍ الْأَسَدِيَّ، فَانْطَلَقُوا حَتَّى هَبَطُوا نَخْلَةَ، وَوَجَدُوا بِهَا عَمْرَو بْنَ الْحَضْرَمِيِّ فِي عِيرِ تِجَارَةٍ لِقُرَيْشٍ فِي يوم بقي في الشَّهْرِ الْحَرَامِ، فَاخْتَصَمَ الْمُسْلِمُونَ فَقَالَ قَائِلٌ مِنْهُمْ: لَا نَعْلَمُ هَذَا الْيَوْمَ إِلَّا مِنَ الشَّهْرِ الْحَرَامِ وَلَا نرى أن تستحلوا لِطَمَعٍ أَشْفَيْتُمْ عَلَيْهِ. فَغَلَبَ عَلَى الْأَمْرِ الَّذِينَ يُرِيدُونَ عَرَضَ الدُّنْيَا، فَشَدُّوا عَلَى ابْنِ الْحَضْرَمِيِّ فَقَتَلُوهُ وَغَنِمُوا، عِيرَهُ فَبَلَغَ ذَلِكَ كُفَّارَ قُرَيْشٍ، وَكَانَ ابْنُ الْحَضْرَمِيِّ أَوَّلَ قَتِيلٍ قُتِلَ بَيْنَ الْمُسْلِمِينَ وَبَيْنَ الْمُشْرِكِينَ، فَرَكِبَ وَفْدٌ مِنْ كُفَّارِ قُرَيْشٍ حَتَّى قَدِمُوا عَلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالُوا: أَتُحِلُّ الْقِتَالَ فِي الشَّهْرِ الْحَرَامِ؟ فَأَنْزَلَ اللَّهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ قلْ قِتَالٍ} إِلَى آخِرِ الْآيَةِ. (٢) - أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ محمد الحارثي قال: أخبرنا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بن جعفر قال: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ محمد الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عثمان قال: حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنِ الزُّهْرِيِّ قَالَ: بَعَثَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَبْدَ اللَّهِ بْنَ جَحْشٍ، وَمَعَهُ نَفَرٌ مِنَ الْمُهَاجِرِينَ، فَقَتَلَ عَبْدُ اللَّهِ بْنُ وَاقَدٍ اللَّيْثِيُّ عَمْرَو بْنَ الْحَضْرَمِيِّ فِي آخِرِ يَوْمٍ مِنْ رَجَبٍ، وَأَسَرُوا رَجُلَيْنِ وَاسْتَاقُوا الْعِيرَ، فَوَقَفَ عَلَى ذَلِكَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَقَالَ: \"لَمْ آمُرْكُمْ بِالْقِتَالِ فِي الشَّهْرِ الْحَرَامِ\"، فَقَالَتْ قُرَيْشٌ: اسْتَحَلَّ مُحَمَّدٌ الشَّهْرَ الْحَرَامَ فَنَزَلَتْ: {يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ} إِلَى قَوْلِهِ: {وَالْفِتْنَةُ أَكْبَرُ مِنَ الْقَتْلِ} أَيْ قَدْ كَانُوا يَفْتِنُونَكُمْ وَأَنْتُمْ فِي حَرَمِ اللَّهِ بَعْدَ إِيمَانِكُمْ، وَهَذَا أَكْبَرُ عِنْدَ اللَّهِ مِنْ أَنْ تَقْتُلُوهُمْ فِي الشَّهْرِ الْحَرَامِ مَعَ كُفْرِهِمْ بِاللَّهِ، قَالَ الزُّهْرِيُّ: لَمَّا نَزَلَ هَذَا قَبَضَ رَسُولُ الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - العير، ونادى الْأَسِيرَيْنِ وَلَمَّا فَرَّجَ اللَّهُ تَعَالَى عَنْ أَهْلِ تِلْكَ السَّرِيَّةِ مَا كَانُوا فِيهِ مِنْ غَمٍّ طَمِعُوا فِيمَا عِنْدَ اللَّهِ مِنْ ثَوَابِهِ، فَقَالُوا: يَا نَبِيَّ اللَّهِ أَنَطْمَعُ أَنْ تَكُونَ غَزْوَةً وَلَا نُعْطَى فِيهَا أَجْرَ الْمُجَاهِدِينَ فِي سَبِيلِ اللَّهِ؟ فَأَنْزَلَ الله تعالى فيهم: {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَاجَرُوا وَجَاهَدُوا} الْآيَةَ.قَالَ الْمُفَسِّرُونَ: بَعَثَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَبْدَ اللَّهِ بْنَ جَحْشٍ - وَهُوَ ابْنُ عَمَّةِ النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي جُمَادَى الْآخِرَةِ قَبْلَ قِتَالِ بَدْرٍ بِشَهْرَيْنِ عَلَى رَأْسِ سَبْعَةَ عَشَرَ شَهْرًا مِنْ مَقْدِمِهِ الْمَدِينَةَ، وَبَعَثَ مَعَهُ ثَمَانِيَةَ رَهْطٍ مِنَ الْمُهَاجِرِينَ: سَعْدَ بْنَ أَبِي وَقَّاصٍ الزُّهْرِيَّ وَعُكَاشَةَ بْنَ مِحْصَنٍ الْأَسَدِيَّ وَعُتْبَةَ بْنَ غَزْوَانَ السُّلَمِيَّ وَأَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ وَسُهَيْلَ بْنَ بَيْضَاءَ وَعَامِرَ بْنَ رَبِيعَةَ وَوَاقِدَ بْنَ عَبْدِ اللَّهِ وَخَالِدَ بْنَ بُكَيْرٍ، وَكَتَبَ لِأَمِيرِهِمْ عَبْدِ اللَّهِ بْنِ جَحْشٍ كِتَابًا وَقَالَ: \"سِرْ عَلَى اسْمِ اللَّهِ وَلَا تَنْظُرْ فِي الْكِتَابِ حَتَّى تَسِيرَ يَوْمَيْنِ فَإِذَا نَزَلْتَ مَنْزِلَيْنِ فَافْتَحِ الْكِتَابَ وَاقْرَأْهُ عَلَى أَصْحَابِكَ، ثُمَّ امْضِ لِمَا أَمَرْتُكَ، وَلَا تَسْتَكْرِهَنَّ أحدًا من أصحابه عَلَى الْمَسِيرِ مَعَكَ\"، فَسَارَ عَبْدُ اللَّهِ يَوْمَيْنِ، ثُمَّ نَزَلَ وَفَتَحَ الْكِتَابَ فَإِذَا فِيهِ:.\"بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ. أَمَّا بَعْدُ، فَسِرْ عَلَى بَرَكَةِ اللَّهِ بِمَنِ تَبِعَكَ مِنْ أَصْحَابِكَ حَتَّى تَنْزِلَ بَطْنَ نَخْلَةٍ فَتَرْصُدَ بِهَا عِيرَ قُرَيْشٍ لَعَلَّكَ أَنْ تَأْتِيَنَا مِنْهُ بِخَبَرٍ\" فَلَمَّا نَظَرَ عَبْدُ اللَّهِ الْكِتَابِ قَالَ: سَمْعًا وَطَاعَةً، وقال لِأَصْحَابِهِ ذَلِكَ، وَقَالَ: إِنَّهُ قَدْ نَهَانِي أَنْ أَسْتَكْرِهَ واحدًا مِنْكُمْ. حَتَّى إِذَا كَانَ بِمَعْدِنٍ فَوْقَ الْفَرْعِ وَقَدْ أَضَلَّ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعُتْبَةُ بْنُ غَزْوَانَ بَعِيرًا لَهُمَا كَانَا يَعْتَقِبَانِهِ فَاسْتَأْذَنَا أَنْ يَتَخَلَّفَا فِي طَلَبِ بَعِيرِهِمَا فَأَذِنَ لَهُمَا فَتَخَلَّفَا فِي طَلَبِهِ، وَمَضَى عَبْدُ اللَّهِبِبَقِيَّةِ أصحابه حتى وصل بَطْنَ نَخْلَةٍ بَيْنَ مَكَّةَ وَالطَّائِفِ، فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ مَرَّتْ بِهِمْ عِيرٌ لِقُرَيْشٍ تَحْمِلُ زَبِيبًا وَأُدْمًا وَتِجَارَةً مِنْ تِجَارَةِ الطَّائِفِ، فِيهِمْ عَمْرُو بْنُ الْحَضْرَمِيِّ وَالْحَكَمُ بْنُ كَيْسَانَ وَعُثْمَانُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ وَنَوْفَلُ بْنُ عَبْدِ اللَّهِ الْمَخْزُومِيَّانِ؛ فَلَمَّا رَأَوْا أَصْحَابَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - هَابُوهُمْ، فَقَالَ عَبْدُ اللَّهِ بْنُ جَحْشٍ: إِنَّ الْقَوْمَ قَدْ ذُعِرُوا مِنْكُمْ فَاحْلِقُوا رَأْسَ رَجُلٍ مِنْكُمْ فَلْيَتَعَرَّضْ لَهُمْ فَإِذَا رَأَوْهُ مَحْلُوقًا أَمِنُوا وَقَالُوا: قَوْمٌ عُمَّارٌ، فَحَلَقُوا رَأْسَ عُكَاشَةَ ثُمَّ أَشْرَفَ عَلَيْهِمْ فَقَالُوا: قَوْمٌ عُمَّارٌ لَا بَأْسَ عَلَيْكُمْ فَأَمِنُوهُمْ، وَكَانَ ذَلِكَ فِي آخِرِ يَوْمٍ مِنْ جُمَادَى الْآخِرَةِ وَكَانُوا يَرَوْنَ أَنَّهُ مِنْ جُمَادَى أَوْ هُوَ رَجَبٌ، فَتَشَاوَرَ الْقَوْمُ فِيهِمْ وَقَالُوا: لَئِنْ تَرَكْتُمُوهُمْ هَذِهِ اللَّيْلَةَ لَيَدْخُلُنَّ الْحَرَمَ فَلَيَمْتَنِعُنَّ مِنْكُمْ، فَأَجْمَعُوا أَمْرَهُمْ فِي مُوَاقَعَةِ الْقَوْمِ فَرَمَى وَاقِدُ بْنُ عَبْدِ اللَّهِ التَّمِيمِيُّ عَمْرَو بْنَ الْحَضْرَمِيِّ بسهم فقتله، وكان أَوَّلَ قَتِيلٍ مِنَ الْمُشْرِكِينَ، وَاسْتَأْسَرَ الْحَكَمُ وَعُثْمَانُ، فَكَانَا أَوَّلَ أَسِيرَيْنِ فِي الْإِسْلَامِ، وَأَفْلَتَ نَوْفَلٌ وَأَعْجَزَهُمْ، وَاسْتَاقَ الْمُؤْمِنُونَ الْعِيرَ وَالْأَسِيرَيْنِ حَتَّى قَدِمُوا عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِالْمَدِينَةِ، فَقَالَتْ قُرَيْشٌ: قَدِ اسْتَحَلَّ مُحَمَّدٌ الشَّهْرَ الْحَرَامَ شَهْرًا يَأْمَنُ فِيهِ الْخَائِفُ وَيَبْذَعِرُّ (٣) النَّاسُ في معايشهم فَسَفَكَ فِيهِ الدِّمَاءَ وَأَخَذَ فِيهِ الْحَرَائِبَ، وَعَيَّرَ بِذَلِكَ أَهْلُ مَكَّةَ مَنْ كَانَ بِهَا مِنَ الْمُسْلِمِينَ، فَقَالُوا: يَا مَعْشَرَ الصُّبَاةِ اسْتَحْلَلْتُمُ الشَّهْرَ الْحَرَامَ فَقَاتَلْتُمْ فِيهِ؟ وَتَفَاءَلَتِ الْيَهُودُ بِذَلِكَ وَقَالُوا: وَاقِدٌ وَقَدَتِ الْحَرْبُ وَعَمْرٌو عَمَرَتِ الْحَرْبُ، وَالْحَضْرَمِيُّ حَضَرَتِ الْحَرْبُ، وَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ لِابْنِ جَحْشٍ وَأَصْحَابِهِ: \"مَا أَمَرْتُكُمْ بِالْقِتَالِ فِي الشَّهْرِ الْحَرَامِ\"، وَوَقَّفَ الْعِيرَ وَالْأَسِيرَيْنِ وَأَبَى أَنْ يَأْخُذَ مِنْ ذَلِكَ شَيْئًا، فَعَظُمَ ذَلِكَ عَلَى أَصْحَابِ السَّرِيَّةِ وَظَنُّوا أَنْ قَدْ هَلَكُوا، وَسُقِطَ فِي أَيْدِيهِمْ وَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّا قَتَلْنَا ابْنَ الْحَضْرَمِيِّ ثُمَّ أَمْسَيْنَا فَنَظَرْنَا إِلَى هِلَالِ رَجَبٍ، فَلَا نَدْرِي أَفِي رَجَبٍ أَصَبْنَاهُ أَوْ فِي جُمَادَى، وَأَكْثَرَ النَّاسُ فِي ذَلِكَ، فَأَنْزَلَاللَّهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ} الْآيَةَ، فَأَخَذَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الْعِيرَ فَعَزَلَ مِنْهَا الْخُمُسَ، فَكَانَ أَوَّلَ خُمُسٍ فِي الْإِسْلَامِ، وَقَسَّمَ الْبَاقِي بَيْنَ أَصْحَابِ السَّرِيَّةِ، فَكَانَ أَوَّلَ غَنِيمَةٍ فِي الْإِسْلَامِ وَبَعَثَ أَهْلَ مَكَّةَ فِي فِدَاءِ أَسِيرِيهِمْ، فَقَالَ: بَلْ نَقِفُهُمَا حَتَّى يَقْدَمَ سعد وعتبة، وإن لَمْ يَقْدَمَا قَتَلْنَاهُمَا بِهِمَا، فَلَمَّا قَدِمَا فَادَاهُمَا؛ وَأَمَّا الْحَكَمُ بْنُ كَيْسَانَ فَأَسْلَمَ وَأَقَامَ مَعَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِالْمَدِينَةِ، فَقُتِلَ يَوْمَ بِئْرِ مَعُونَةَ شَهِيدًا؛ وَأَمَّا عُثْمَانُ بْنُ عَبْدِ اللَّهِ فَرَجَعَ إِلَى مَكَّةَ، فَمَاتَ بِهَا كَافِرًا؛ وَأَمَّا نَوْفَلٌ فَضَرَبَ بَطْنَ فَرَسِهِ يَوْمَ الْأَحْزَابِ لِيَدْخُلَ الْخَنْدَقَ عَلَى الْمُسْلِمِينَ، فَوَقَعَ فِي الْخَنْدَقِ مَعَ فَرَسِهِ فَتَحَطَّمَا جَمِيعًا، فَقَتَلَهُ اللَّهُ تَعَالَى، وَطَلَبَ الْمُشْرِكُونَ جِيفَتَهُ بِالثَّمَنِ فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"خُذُوهُ فَإِنَّهُ خَبِيثُ الْجِيفَةِ خَبِيثُ الدِّيَةِ\"، فَهَذَا سَبَبُ نُزُولِ قَوْلِهِ تَعَالَى: {يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ} وَالْآيَةِ الَّتِي بَعْدَهَا.</p><p>(١) - أخرجه ابن جرير (٢/٢٠٢) وابن إسحاق (السيرة النبوية لابن هشام: ٢/١٧٨) والبيهقي في الدلائل (٣/١٧ ١٨) عن عروة مرسلاً ويشهد له: الرواية الآتية:.</p><p>(٢) - إسناده صحيح ويشهد لهما:</p><p>* ما أخرجه ابن جرير (٢/٢٠٤) والطبراني (المعجم الكبير: ٢/١٧٤ - ح: ١٦٧٠) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٢١٨) عن جندب بن عبد الله رضي الله عنه بمعناه وصححه الشوكاني (المصدر السابق) .</p><p>(٣) يتفرق.</p>"
  }, {
    "id": 60,
    "sura": 2,
    "aya": 219,
    "text": "قَوْلُهُ تَعَالَى: {يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ} الْآيَةَ {٢١٩} .نَزَلَتْ فِي عُمَرَ بْنِ الْخَطَّابِ وَمُعَاذِ بْنِ جَبَلٍ وَنَفَرٍ مِنَ الْأَنْصَارِ أَتَوْا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالُوا: أَفْتِنَا فِي الْخَمْرِ وَالْمَيْسِرِ فَإِنَّهُمَا مَذْهَبَةٌ لِلْعَقْلِ مَسْلَبَةٌ لِلْمَالِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ."
  }, {
    "id": 61,
    "sura": 2,
    "aya": 220,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَيَسْأَلُونَكَ عَنِ الْيَتَامَى} {٢٢٠} .أَخْبَرَنَا أَبُو مَنْصُورٍ عَبْدُ الْقَاهِرِ بْنُ طَاهِرٍ أَخْبَرَنَا أَبُو الْحَسَنِ مُحَمَّدُ بْنُ الحسن السراج قال: حَدَّثَنَا الْحَسَنُ بْنُ الْمُثَنَّى بن معاذ قال: حَدَّثَنَا أَبُو حُذَيْفَةَ مُوسَى بْنُ مسعود قال: حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ سَالِمٍ الْأَفْطَسِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ: لَمَّا نَزَلَتْ: {إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظلْمًا} [النساء: ١٠] عَزَلُوا أَمْوَالَهُمْ عَنْ أَمْوَالِهِمْ. فَنَزَلَتْ: {قُلْإِصْلَاحٌ لَهُمْ خَيْرٌ} فَخَلَطُوا أَمْوَالَهُمْ بِأَمْوَالِهِمْ.(٢) - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أحمد الزاهد قال: أَخْبَرَنَا أَبُو علي الفقيه قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ محمد البغوي قال: حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شيبة قال: حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا أَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ} (٣) وَ {إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا} انْطَلَقَ مَنْ كَانَ عِنْدَهُ مَالُ يَتِيمٍ فَعَزَلَ طَعَامَهُ مِنْ طَعَامِهِ وَشَرَابَهُ مِنْ شَرَابِهِ، وَجَعَلَ يُفَضِّلُ الشَّيْءَ مِنْ طَعَامِهِ فَيُحْبَسُ لَهُ حَتَّى يَأْكُلَهُ أَوْ يَفْسَدَ، وَاشْتَدَّ ذَلِكَ عَلَيْهِمْ، فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلَاحٌ لَهُمْ خَيْرٌ وَإِنْ تخَالِطوهمْ} فتخلطوا طعامكم بطعامهم وشرابكم بشرابهم.</p><p>(١) - إسناده ضعيف بسبب موسى بن مسعود.</p><p>(٢) - أخرجه أبو داود (٣/ ٢٩١ - ح: ٢٨٧١) والحاكم (المستدرك: ٢/٢٧٨) وابن جرير (٢/٢١٧) والنسائي وابن المنذر وابن أبي حاتم وابن مردويه والبيهقي (فتح القدير: ١/٢٢٣) كلهم من طريق جريرعن عطاء به.</p><p>وإسناده ضعيف؛ لأن عطاء بن السائب قد اختلط في آخر عمره، وجرير إنما سمع منه بعد الاختلاط (تهذيب التهذيب: ٧/٢٠٣ - ٢٠٧) حاشية جامع الأصول (٢/٣٨) لكنه يتحسن بشواهده ومنها:</p><p>١ - ما أخرجه ابن جرير (٢/٢١٨) والطبراني (المعجم الكبير: ١٢/٢٥١ - ح: ١٣٠٢٠) من طريق علي بن أبي طلحة عن ابن عباس نحوه، وإسناده صحيح.</p><p>٢ - الرواية السابقة.</p><p>٣ - ما أخرجه ابن جرير (٢/٢١٧) عن قتادة نحوه مرسلاً، وإسناده إليه صحيح.</p><p>(٣) سورة الأنعام: الآية ١٥٢.</p>"
  }, {
    "id": 62,
    "sura": 2,
    "aya": 221,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تَنْكِحُوا الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ} الْآيَةَ {٢٢١} .أَخْبَرَنَا أَبُو عُثْمَانَ ابن أَبِي عمرو الحافظ قال: أَخْبَرَنَا جَدِّي أخبرنا أبو عمر أَحْمَدُ بن محمد الحرشي قال: حَدَّثَنَا إِسْمَاعِيلُ بن قتيبة قال: حَدَّثَنَا أَبُو خَالِدٍ حَدَّثَنَا بُكَيْرُ بْنُ مَعْرُوفٍ، عَنْ مُقَاتِلِ بْنِ حَيَّانَ قَالَ: نَزَلَتْ فِي أَبِي مَرْثَدٍ الْغَنَوِيِّ، اسْتَأْذَنَ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي عَنَاقَ أَنْيَتَزَوَّجَهَا، وَهِيَ امْرَأَةٌ مِسْكِينَةٌ مِنْ قُرَيْشٍ، وَكَانَتْ ذَاتَ حَظٍّ مِنْ جَمَالٍ وَهِيَ مُشْرِكَةٌ وَأَبُو مَرْثَدٍ مُسْلِمٌ، فَقَالَ: يَا نَبِيَّ اللَّهِ إِنَّهَا لَتُعْجِبُنِي، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَلَا تَنْكِحُوا الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ}(٢) - أَخْبَرَنَا أبو عثمان قال: أخبرنا جدي قال: أَخْبَرَنَا أبو عمرو قال: حَدَّثَنَا مُحَمَّدُ بن يحيى قال: حَدَّثَنَا عَمْرُو بن حماد قال: حَدَّثَنَا أَسْبَاطٌ عَنِ السُّدِّيِّ عَنْ أَبِي مَالِكٍ، عَنِ ابْنِ عَبَّاسٍ فِي هَذِهِ الْآيَةِ قَالَ: نَزَلَتْ فِي عَبْدِ اللَّهِ بْنِ رَوَاحَةَ، وَكَانَتْ لَهُ أَمَةٌ سَوْدَاءُ وَإِنَّهُ غَضِبَ عَلَيْهَا فَلَطَمَهَا، ثُمَّ إِنَّهُ فَزِعَ، فَأَتَى النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَخْبَرَهُ خَبَرَهَا، فَقَالَ لَهُ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"مَا هِيَ يَا عَبْدَ اللَّهِ؟ \" فَقَالَ: يَا رَسُولَ اللَّهِ هِيَ تَصُومُ وَتُصَلِّي وَتُحْسِنُ الْوُضُوءَ، وَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّكَ رَسُولُهُ، فَقَالَ: \"يَا عَبْدَ اللَّهِ هذه مؤمنة\" قال عَبْدُ اللَّهِ: فَوَالَّذِي بَعَثَكَ بِالْحَقِّ نَبِيًّا لَأَعْتَقِنَّهَا وَلَأَتَزَوَّجَنَّهَا، فَفَعَلَ فَطَعَنَ عَلَيْهِ نَاسٌ مِنَ الْمُسْلِمِينَ فَقَالُوا: نَكَحَ أَمَةً، وَكَانُوا يُرِيدُونَ أَنْ يَنْكِحُوا إِلَى الْمُشْرِكِينَ وَيَنْكِحُوهُمْ رَغْبَةً فِي أَحْسَابِهِمْ فَأَنْزَلَ الله تعالى فيه:{وَلَأَمَةٌ مُؤْمِنَةٌ خَيْرٌ مِنْ مُشْرِكَةٍ} الْآيَةَ.(٣) - وَقَالَ الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَعَثَ رَجُلًا مِنْ غَنِيٍّ يُقَالُ لَهُ: مَرْثَدُ بْنُ أَبِي مَرْثَدٍ حَلِيفًا لِبَنِي هَاشِمٍ إِلَى مَكَّةَ، لِيُخْرِجَ نَاسًا مِنَ الْمُسْلِمِينَ بِهَا أُسَرَاءَ؛ فَلَمَّا قَدِمَهَا سَمِعَتْ بِهِ امْرَأَةٌ يُقَالُ لَهَا: عَنَاقُ، وَكَانَتْ خَلِيلَةً لَهُ فِي الْجَاهِلِيَّةِ، فَلَمَّا أَسْلَمَ أَعْرَضَ عَنْهَا، فَأَتَتْهُ فَقَالَتْ: وَيْحَكَ يَا مرثد ألا تخلو؟ فَقَالَ لَهَا: إِنَّ الْإِسْلَامَ قَدْ حَالَ بَيْنِي وَبَيْنَكِ وَحَرَّمَهُ عَلَيْنَا، وَلَكِنْ إِنْ شِئْتِ تَزَوَّجْتُكِ، إِذَا رَجَعْتُ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - اسْتَأْذَنْتُهُ فِي ذَلِكَ ثُمَّ تَزَوَّجْتُكِ، فَقَالَتْ لَهُ: أَبِي تَتَبَرَّمُ؟ ثُمَّ اسْتَغَاثَتْ عَلَيْهِ فَضَرَبُوهُ ضَرْبًا شَدِيدًاثُمَّ خَلَّوْا سَبِيلَهُ، فَلَمَّا قَضَى حَاجَتَهُ بِمَكَّةَ انْصَرَفَ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - رَاجِعًا وَأَعْلَمَهُ الَّذِي كَانَ مِنْ أَمْرِهِ وَأَمْرِ عَنَاقَ وَمَا لَقِيَ فِي سَبَبِهَا، فَقَالَ: يَا رسول الله، أتحل أن أتزوجها؟ فأنزل اللَّهِ يَنْهَاهُ عَنْ ذَلِكَ قَوْلُهُ: {وَلَا تَنْكِحُوا الْمُشْرِكَاتِ}</p><p>(١) - إسناده ضعيف معضل، وأخرجه ابن المنذر وابن أبي حاتم (فتح القدير: ١/٢٢٤) .</p><p>(٢) - رجحت فيما سبق تضعيف هذا السند، وهو ترجيح ابن جرير والشيخ أحمد محمد شاكر رحمهما الله.</p><p>(٣) - هذا إسناد ضعيف جدًا، كما سبق.</p>"
  }, {
    "id": 63,
    "sura": 2,
    "aya": 222,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ} الْآيَةَ {٢٢٢} .أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ مُحَمَّدُ بْنُ أَحْمَدَ بن جعفر قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بن زكريا قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الدغولي قال: حَدَّثَنَا مُحَمَّدُ بن مشكان قال: حدثنا حيان قال: حدثنا حماد حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ: أَنَّ الْيَهُودَ كَانَتْ إِذَا حَاضَتْ مِنْهُمُ امْرَأَةٌ أَخْرَجُوهَا مِنَ الْبَيْتِ، فَلَمْ يُؤَاكِلُوهَا وَلَمْ يُشَارِبُوهَا وَلَمْ يُجَامِعُوهَا فِي الْبُيُوتِ، فَسُئِلَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ} إِلَى آخِرِ الْآيَةِ، رَوَاهُ مُسْلِمٌ عَنْ زُهَيْرِ بْنِ حَرْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ عَنْ حَمَّادٍ.(٢) - أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ عُمَرَ الْخَشَّابُ قال: أَخْبَرَنَا أَبُو عَمْرِو بْنُ مْدَانَ قال: أخبرنا أبو عمران مُوسَى بْنُ العباس الجويني قال: حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ الْقَرْدُوَانِيُّ الْحَرَّانِيُّ حَدَّثَنِي أَبِي، عَنْ سَابِقِ بْنِ عَبْدِ اللَّهِ الرَّقِّيِّ، عَنْ خُصَيْفٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي قَوْلِهِ: {وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى} قَالَ: إِنَّ الْيَهُودَ قَالَتْ: مَنْ أَتَى امْرَأَتَهُ مِنْ دُبُرِهَا كَانَ وَلَدُهُ أَحْوَلَ، فَكَانَنِسَاءُ الْأَنْصَارِ لَا يَدَعْنَ أَزْوَاجَهُنَّ يأتونهن من أدبارهن، فَجَاءُوا إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَسَأَلُوهُ عَنْ إِتْيَانِ الرَّجُلِ امْرَأَتَهُ وَهِيَ حَائِضٌ، وَعَمَّا قَالَتِ الْيَهُودُ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ} {وَلَا تَقْرَبُوهُنَّ حَتَّى يَطْهُرْنَ} يَعْنِي الِاغْتِسَالَ {فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ} يَعْنِي الْقُبُلَ {إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} فَإِنَّمَا الْحَرْثُ حَيْثُ يَنْبُتُ الْوَلَدُ وَيَخْرُجُ مِنْهُ.وَقَالَ الْمُفَسِّرُونَ: كَانَتِ الْعَرَبُ فِي الْجَاهِلِيَّةِ إِذَا حَاضَتِ الْمَرْأَةُ منهم لم تؤاكلها ولم تشاربها ولم تساكنها فِي بَيْتٍ كَفِعْلِ الْمَجُوسِ، فَسَأَلَ أَبُو الدَّحْدَاحِ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَنْ ذَلِكَ فَقَالَ: يَا رَسُولَ اللَّهِ مَا نَصْنَعُ بِالنِّسَاءِ إِذَا حِضْنَ؟ فَأَنْزَلَ اللَّهُ هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه مسلم (١/٢٤٦ - ح: ٣٠٢) والإمام أحمد (الفتح الرباني: ١٨/٨٧ - ح: ١٨٥) وأصحاب السنن (فتح القدير: ١/٢٢٧) وأبو داود الطيالسي (منحة المعبود: ٢/١٤ - ح: ١٩٣٣) عن حماد به. وحدد السائل في رواية ابن إسحاق عن ابن عباس رضي الله عنهما أنه ثابت بن الدحداح (لباب النقول: ٤٣) . وسنده حسن.</p><p>(٢) - إسناده ضعيف بسبب خصيف، بالإضافة لضعف متنه ونكارته، إذ أن فيه خلطًا بين سببين مختلفين، والله أعلم.</p>"
  }, {
    "id": 64,
    "sura": 2,
    "aya": 223,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ} الْآيَةَ {٢٢٣} .أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ الحسن القاضي قال: أَخْبَرَنَا حَاجِبُ بن أحمد قال: حَدَّثَنَا عَبْدُ الرَّحِيمِ بن منيب قال: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ الْمُنْكَدِرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ: كَانَتِ الْيَهُودُ تَقُولُ فِي الَّذِي يَأْتِي امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا: إِنَّ الْوَلَدَ يَكُونُ أَحْوَلَ، فَنَزَلَ {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} رَوَاهُ الْبُخَارِيُّ، عَنْ أَبِي نُعَيْمٍ، وَرَوَاهُ مُسْلِمٌ، عَنْ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ، كِلَاهُمَا عَنْ سُفْيَانَ.(٢) - أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ يَحْيَى، أَخْبَرَنَا أَبُو سَعِيدٍ إِسْمَاعِيلُ بْنُ أَحْمَدَالْخَلَّالِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ زيد البجلي قال: حَدَّثَنَا أبو كريب قال: حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبَانَ بْنِ مُسْلِمٍ، عَنْ مُجَاهِدٍ قَالَ: عَرَضْتُ الْمُصْحَفَ عَلَى ابْنِ عَبَّاسٍ ثَلَاثَ عرضات من فاتحته إِلَى خَاتِمَتِهِ، أُوقِفُهُ عِنْدَ كُلِّ آيَةٍ مِنْهُ. فَأَسْأَلُهُ عَنْهَا، حَتَّى انْتَهَى إِلَى هَذِهِ الْآيَةِ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} فَقَالَ ابْنُ عَبَّاسٍ: إِنَّ هَذَا الْحَيَّ مِنْ قُرَيْشٍ كَانُوا يَشْرَحُونَ النِّسَاءَ بِمَكَّةَ وَيَتَلَذَّذُونَ بِهِنَّ مُقْبِلَاتٍ وَمُدْبِرَاتٍ، فَلَمَّا قَدِمُوا الْمَدِينَةَ تَزَوَّجُوا مِنَ الْأَنْصَارِ، فَذَهَبُوا لِيَفْعَلُوا بِهِنَّ كَمَا كَانُوا يَفْعَلُونَ بِمَكَّةَ، فَأَنْكَرْنَ ذَلِكَ وَقُلْنَ: هَذَا شَيْءٌ لَمْ نَكُنْ نُؤْتَى عَلَيْهِ، فَانْتَشَرَ الْحَدِيثُ حَتَّى انْتَهَى إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} قَالَ: إِنْ شِئْتَ مُقْبِلَةً وَإِنْ شِئْتَ مُدْبِرَةً وَإِنْ شِئْتَ بَارِكَةً، وَإِنَّمَا يَعْنِي بِذَلِكَ مَوْضِعَ الْوَلَدِ لِلْحَرْثِ يَقُولُ: ائْتِ الْحَرْثَ حَيْثُ شِئْتَ. رَوَاهُ الْحَاكِمُ أَبُو عَبْدِ اللَّهِ فِي صَحِيحِهِ، عَنْ أَبِي زَكَرِيَّا الْعَنْبَرِيِّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ السَّلَامِ، عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ، عَنِ الْمُحَارِبِيِّ.(٢) - أَخْبَرَنَا سَعِيدُ بْنُ محمد الحياني قال: أَخْبَرَنَا أَبُو عَلِيِّ بْنُ أَبِي بكر الفقيه قال: حَدَّثَنَا أَبُو الْقَاسِمِ البغوي قال: حَدَّثَنَا عَلِيُّ بْنُ جعد قال: حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ ابن المنكدر قال: سمعت جابر قَالَ: قَالَتِ الْيَهُودُ: إِنَّ الرَّجُلَ إِذَا أَتَى امْرَأَتَهُ بَارِكَةً كَانَ الْوَلَدُ أَحْوَلَ فَأَنْزَلَاللَّهُ - عَزَّ وَجَلَّ - {نِسَاؤُكُمْ حَرْثٌ لَكُمْ} الْآيَةَ.(٣) - أَخْبَرَنَا سَعِيدُ بْنُ محمد الحياني قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بن حمدون قال: أَخْبَرَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ الشرقي قال: أَخْبَرَنَا أَبُو الأزهر قال: حَدَّثَنَا وَهْبُ بْنُ جرير قال: حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: سَمِعْتُ النُّعْمَانَ بْنَ رَاشِدٍ يُحَدِّثُ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: قَالَتِ الْيَهُودُ: إِذَا نَكَحَ الرَّجُلُ امْرَأَتَهُ مُجَبِّيَةً جَاءَ وَلَدُهَا أَحْوَلَ، فَنَزَلَتْ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} إِنْ شَاءَ مُجَبِّيَةً، وَإِنْ شَاءَ غَيْرَ مُجَبِّيَةٍ غَيْرَ أَنَّ ذَلِكَ فِي صِمَامٍ وَاحِدٍ. رَوَاهُ مُسْلِمٌ عَنْ هَارُونَ بْنِ مَعْرُوفٍ عَنْ وَهْبِ بْنِ جَرِيرٍ، قَالَ الشَّيْخُ أَبُو حامد بن الشرفي: هَذَا حَدِيثٌ جَلِيلٌ يُسَاوِي مِائَةَ حَدِيثٍ، لَمْ يَرْوِهِ عَنِ الزُّهْرِيِّ إِلَّا النُّعْمَانُ بْنُ رَاشِدٍ.(٤) - أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ المطوعي قال: أَخْبَرَنَا أَبُو عَمْرِو بْنُ حَمْدَانَ قال: حَدَّثَنَا أبو عليّ قال: حدثنا زهير قال: حَدَّثَنَا يُونُسُ بْنُ محمد قال: حَدَّثَنَا يَعْقُوبُ القمي قال: حَدَّثَنَا جَعْفَرٌ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: جَاءَ عُمَرُ بْنُ الْخَطَّابِ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: هَلَكْتُ، فَقَالَ: \"وَمَا الَّذِي أَهْلَكَكَ؟ \" قَالَ: حَوَّلْتُ رَحْلِي اللَّيْلَةَ، قَالَ. فَلَمْ يَرُدَّ عَلَيْهِ شَيْئًا فَأُوحِيَ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - هذه الْآيَةُ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} يَقُولُ: أَقْبِلْ وَأَدْبِرْ وَاتَّقِ الدُّبُرَ وَالْحَيْضَةَ.أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ محمد الأصفهاني قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ محمد الحافظ قال:حَدَّثَنَا أَبُو يحيى الرازي قال: حَدَّثَنَا سَهْلُ بن عثمان قال: حَدَّثَنَا الْمُحَارِبِيُّ عَنْ لَيْثٍ، عَنْ أَبِي صَالِحٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ سُئِلَ عَنْ قَوْلِهِ: {فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} قَالَ: نَزَلَتْ فِي الْعَزْلِ، وَقَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الْكَلْبِيِّ: نَزَلَتْ فِي الْمُهَاجِرِينَ لَمَّا قَدِمُوا الْمَدِينَةَ، ذَكَرُوا إِتْيَانَ النِّسَاءِ فِيمَا بَيْنَهُمْ وَالْأَنْصَارَ وَالْيَهُودَ مِنْ بَيْنِ أَيْدِيهِنَّ وَمِنْ خَلْفِهِنَّ إِذَا كَانَ الْمَأْتِيُّ وَاحِدًا فِي الْفَرْجِ، فَعَابَتِ الْيَهُودُ ذَلِكَ إِلَّا مِنْ بَيْنِ أَيْدِيهِنَّ خَاصَّةً، وَقَالُوا: إِنَّا لَنَجِدُ فِي كِتَابِ اللَّهِ التَّوْرَاةِ أَنَّ كُلَّ إِتْيَانٍ يُؤْتَى النِّسَاءَ غَيْرَ مُسْتَلْقِيَاتٍ دَنَسٌ عِنْدَ اللَّهِ، وَمِنْهُ يَكُونُ الْحَوَلُ وَالْخَبَلُ، فَذَكَرَ الْمُسْلِمُونَ ذَلِكَ لِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَقَالُوا: إِنَّا كُنَّا في الجاهلية وبعدما أَسْلَمْنَا نَأْتِي النِّسَاءَ كَيْفَ شِئْنَا، وَإِنَّ الْيَهُودَ عَابَتْ عَلَيْنَا ذَلِكَ، وَزَعَمَتْ لَنَا كَذَا وَكَذَا فَأَكْذَبَ اللَّهُ تَعَالَى الْيَهُودَ وَنَزَلَ عَلَيْهِ يُرَخِّصُ لَهُمْ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ} يَقُولُ: الْفَرْجُ مَزْرَعَةٌ لِلْوَلَدِ {فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ} يَقُولُ: كَيْفَ شِئْتُمْ، مِنْ بَيْنِ يَدَيْهَا وَمِنْ خَلْفِهَا فِي الْفَرْجِ.</p><p>(١) - أخرجه البخاري (فتح الباري: ٨/١٨٩ - ح: ٤٥٢٨) ومسلم (٢/١٠٥٨، ١٠٥٩ - ح: ١٤٣٥) والحميدي (مسند الحميدي: ٢/٥٣٢ - ح: ١٢٦٣) وأبو داود (٢/٦١٨ - ح: ٢١٦٣) والترمذي (٥/٢١٥ -: ٢٩٧٨) وابن جرير (٢/٢٣٤، ٢٣٥) وابن أبي حاتم (تفسير ابن كثير: ١/٢٦٠) وأبو يعلى (مسند أبي يعلى: ٤/٢١ - ح: ٢٠٢٤) كلهم عن سفيان به.</p><p>(٢) - أخرجه أبو داود (٢/٦١٨ - ح: ٢١٦٤) والحاكم (المستدرك: ٢/١٩٥، ٢٧٩) والطبراني (المعجم الكبير: ١١/٧٧ - ح: ١١٠٩٧) وابن جرير (٢/٢٣٤) والدارمي وابن المنذر والبيهقي (فتح القدير: ١/٢٢٨) عن ابن عباس به. وصححه الحاكم ووافقه الذهبي، وهو كما قالا، ويشهد له:</p><p>* ما أخرجه ابن جرير (٢/٢٣٤) والنسائي في \"العشرة\" (حاشية جامع الأصول: ٢/٤٣) عن ابن عمر رضي الله عنهما: أن رجلاً أتى امرأته في دبرها فوجد في نفسه من ذلك فأنزل الله الآية. وسنده قوي.</p><p>* ما أخرجه الإمام أحمد (الفتح الرباني: ١٨/٨٧، ٨٨ - ح: ١٨٦، ١٨٧) وابن جرير (٢/٢٣٥) والترمذي (٥/٢١٥ - ح: ٢٩٧٩) وغيرهم عن أم سلمة نحوه، وحسنه الترمذي وهو كما قال.</p><p>* رواية ابن عباس رضي الله عنهما القادمة.</p><p>ملاحظة: أخرجه الواحدي عن سفيان بن عيينة وأخرجه الشيخان وغيرهما عن سفيان الثوري، فقول الواحدي: كلاهما عن سفيان، فيه إيهام ويشهد للرواية: الروايتان بعد القادمة.</p><p>(٢) - إسنادهما صحيح وهما شاهدان لحديث جابر رضي الله عنه المتقدم.</p><p>(٣) - إسنادهما صحيح وهما شاهدان لحديث جابر رضي الله عنه المتقدم.</p><p>(٤) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/٨٨ - ح: ١٨٩) والترمذي (٥/٢١٦ - ح: ٢٩٨٠) وابن جرير (٢/٢٣٥) والطبراني (المعجم الكبير: ١٢/١٠ - ح: ١٢٣١٧) وعبد بن حميد والضياء المقدسي في \"المختارة\" (فتح القدير: ١/٢٢٨) كلهم من طريق يعقوب القمي به.</p><p>وصححه الهيثمي (مجمع الزوائد: ٦/٣١٩) وهو حسن.</p>"
  }, {
    "id": 65,
    "sura": 2,
    "aya": 224,
    "text": "قَوْلُهُ تَعَالَى: {وَلَا تَجْعَلُوا اللَّهَ عُرْضَةً لِأَيْمَانِكُمْ} {٢٢٤} .قَالَ الْكَلْبِيُّ: نَزَلَتْ فِي عَبْدِ اللَّهِ بْنِ رَوَاحَةَ يَنْهَاهُ عَنْ قَطِيعَةِ خَتَنِهِ بَشِيرِ بْنِ النُّعْمَانِ، وَذَلِكَ أَنَّ ابْنَ رَوَاحَةَ حَلَفَ أَنْ لَا يَدْخُلَ عَلَيْهِ أَبَدًا، وَلَا يُكَلِّمَهُ، وَلَا يُصْلِحَ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ وَيَقُولُ: قَدْ حَلَفْتُ بِاللَّهِ أَنْ لَا أَفْعَلَ، وَلَا يَحِلُّ لِي إِلَّا أَنْ أَبِرَّ فِي يَمِينِي، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ."
  }, {
    "id": 66,
    "sura": 2,
    "aya": 226,
    "text": "قَوْلُهُ تَعَالَى: {لِلَّذِينَ يُؤْلُونَ مِنْ نِسَائِهِمْ} الْآيَةَ {٢٢٦} .أَخْبَرَنَا مُحَمَّدُ بْنُ مُوسَى بن الفضل قال: حَدَّثَنَا مُحَمَّدُ بن يعقوب قال: حَدَّثَنَا إِبْرَاهِيمُ بن مرزوق قال: حَدَّثَنَا مُسْلِمُ بْنُ إبراهيم قال: حَدَّثَنَا الْحَارِثُ بْنُ عبيد قال: حَدَّثَنَا عَامِرٌالْأَحْوَلُ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ إِيلَاءُ أَهْلِ الْجَاهِلِيَّةِ السَّنَةَ وَالسَّنَتَيْنِ وَأَكْثَرَ مِنْ ذَلِكَ، فَوَقَّتَ اللَّهُ أَرْبَعَةَ أَشْهُرٍ، فَمَنْ كَانَ إِيلَاؤُهُ أَقَلَّ مِنْ أَرْبَعَةِ أَشْهُرٍ فَلَيْسَ بِإِيلَاءٍ، وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ: كَانَ الْإِيلَاءُ مِنْ ضِرَارِ أَهْلِ الْجَاهِلِيَّةِ، كَانَ الرَّجُلُ لَا يُرِيدُ الْمَرْأَةَ وَلَا يُحِبُّ أَنْ يَتَزَوَّجَهَا غَيْرُهُ فَيَحْلِفُ أَنْ لَا يَقْرَبَهَا أَبَدًا، وَكَانَ يَتْرُكُهَا كَذَلِكَ لَا أَيِّمًا وَلَا ذَاتَ بَعْلٍ، فَجَعَلَ اللَّهُ تَعَالَى الْأَجَلَ الَّذِي يَعْلَمُ بِهِ مَا عِنْدَ الرَّجُلِ فِي الْمَرْأَةِ أَرْبَعَةَ أَشْهُرٍ وَأَنْزَلَ اللَّهُ تَعَالَى: {لِلَّذِينَ يُؤْلُونَ مِنْ نِسَائِهِمْ} الْآيَةَ."
  }, {
    "id": 67,
    "sura": 2,
    "aya": 229,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {الطَّلَاقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ} الْآيَةَ {٢٢٩} .أَخْبَرَنَا أَحْمَدُ بْنُ الحسن القاضي قال: حَدَّثَنَا مُحَمَّدُ بن يعقوب قال: أخبرنا الربيع قال: حدثنا الشافعي قال: أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عن أبيه، قال: كَانَ الرَّجُلُ إِذَا طَلَّقَ امْرَأَتَهُ ثُمَّ ارْتَجَعَهَا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا، كَانَ ذَلِكَ لَهُ، وَإِنْ طَلَّقَهَا أَلْفَ مَرَّةٍ، فَعَمَدَ رَجُلٌ إِلَى امْرَأَةٍ لَهُ فَطَلَّقَهَا، ثُمَّ أَمْهَلَهَا حَتَّى إِذَا شَارَفَتِ انْقِضَاءَ عِدَّتِهَا ارْتَجَعَهَا، ثُمَّ طَلَّقَهَا وَقَالَ: وَاللَّهِ لَا آوِيكِ إِلَيَّ وَلَا تَحِلِّينَ أَبَدًا، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {الطَّلَاقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ}(٢) - أَخْبَرَنَا أَبُو بكر التميمي قال: حَدَّثَنَا أَبُو جَعْفَرٍ أَحْمَدُ بْنُ مُحَمَّدِ بن المرزبان قال: حَدَّثَنَا مُحَمَّدُ بْنُ إبراهيم الحزوري قال: حَدَّثَنَا مُحَمَّدُ بن سليمان قال: حَدَّثَنَا يَعْلَى الْمَكِّيُّ مَوْلَى آلِ الزُّبَيْرِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أَنَّهَا أَتَتْهَا امْرَأَةٌ فَسَأَلَتْهَا عَنْ شَيْءٍ مِنَ الطَّلَاقِ، قَالَتْ: فَذَكَرْتُ ذَلِكَ لرسول الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قال: فَنَزَلَتْ: {الطَّلَاقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ}</p><p>(١) - أخرجه الإمام مالك (الموطأ برواية يحيى بن يحيى: ٤٠٣ - ح: ١٢٤٢) والترمذي (٣/٤٩٧ - ح: ١١٩٢) وابن جرير (٢/٢٧٦) والشافعي وعبد بن حميد وابن أبي حاتم (تفسير ابن كثير: ١/٢٧١) والبيهقي (فتح القدير: ١/٢٣٩) كلهم من طريق هشام به. وهو صحيح الإسناد، إلا أنه مرسل (حاشية جامع الأصول: ٢/٤٦) ، لكن يقويه: الرواية الآتية.</p><p>(٢) - أخرجه الترمذي (٣/٤٩٧) والحاكم (المستدرك: ٢/٢٧٩) وابن مردويه والبيهقي (فتح القدير: ١/٢٣٩) من طريق يعلى بن شبيب المكي به. وإسناده ضعيف بسبب يعلى (تقريب التهذيب: ٢/٣٧٨) - رقم: ٤٠٥) . قال الترمذي: والأول أصح - يعني المرسل -.</p><p>قلت: لكن يتقوى أحدهما بالآخر. والله أعلم.</>"
  }, {
    "id": 68,
    "sura": 2,
    "aya": 231,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ} الْآيَةَ{٢٣١} .أَخْبَرَنَا أَبُو سَعْدِ بْنُ أَبِي بَكْرِ بن الغازي قال: أَخْبَرَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ مُحَمَّدِ بْنِ إسحاق الحافظ قال: أَخْبَرَنِي أَحْمَدُ بْنُ مُحَمَّدِ بن الحسين قال: حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ الله قال: حَدَّثَنَا أبي قال: حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنِ الْحَسَنِ أَنَّهُ قَالَ فِي قَوْلِ اللَّهِ - عَزَّ وَجَلَّ - {فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ إِذَا تَرَاضَوْا} الْآيَةَ، قَالَ: حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ أَنَّهَا نَزَلَتْ فِيهِ قَالَ: كُنْتُ زَوَّجْتُ أُخْتًا لِي مِنْ رَجُلٍ فَطَلَّقَهَا حَتَّى إِذَا انْقَضَتْ عِدَّتُهَا جَاءَ يَخْطُبُهَا، فَقُلْتُ لَهُ: زَوَّجْتُكَ وَأَفْرَشْتُكَ وَأَكْرَمْتُكَ فَطَلَّقْتَهَا، ثُمَّ جِئْتَ تَخْطُبُهَا؟ لَا وَاللَّهِ لَا تَعُودُ إليها أبدًا قال: وَكَانَ رَجُلًا لَا بأس به، وكانت الْمَرْأَةُ تُرِيدُ أَنْ تَرْجِعَ إِلَيْهِ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - هَذِهِ الْآيَةَ فَقُلْتُ: الْآنَ أَفْعَلُ يَا رَسُولَ اللَّهِ، فَزَوَّجْتُهَا إِيَّاهُ. رَوَاهُ الْبُخَارِيُّ عَنْ أَحْمَدَ بْنِ حَفْصٍ.(٢) - أَخْبَرَنَا الْحَاكِمُ أَبُو مَنْصُورٍ مُحَمَّدُ بْنُ محمد المنصوري قال: حَدَّثَنَا عَلِيُّ بْنُ عُمَرَ بن مهدي قال: حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ البختري قال: حَدَّثَنَا يَحْيَى بْنُ جعفر قال: حَدَّثَنَا أَبُو عَامِرٍ العقدي قال: حدثنا عباس بْنُ رَاشِدٍ عَنِ الْحَسَنِ قَالَ: حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ قَالَ: كَانَتْ لِي أُخْتٌ فَخُطِبَتْ إِلَيَّ وَكُنْتُ أَمْنَعُهَا النَّاسَ، فَأَتَانِي ابْنُ عَمٍّ لِي فَخَطَبَهَا فأَنكحتها إياه فاصطحبا مَا شَاءَ اللَّهُ، ثُمَّ طَلَّقَهَا طَلَاقًا لَهُ رَجْعَةٌ، ثُمَّ تَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا فَخَطَبَهَا مَعَ الْخُطَّابِ، فَقُلْتُ: مَنَعْتُهَا النَّاسَ وَزَوَّجْتُكَ إِيَّاهَا، ثُمَّ طَلَّقْتَهَا طَلَاقًا لَهُ رَجْعَةٌ، ثُمَّ تَرَكْتَهَا حَتَّى انْقَضَتْ عِدَّتُهَا، فَلَمَّا خُطِبَتْ إِلَيَّ أَتَيْتَنِي تَخْطُبُهَا، لَا أُزَوِّجُكَ أَبَدًا فَأَنْزَلَ اللَّهُ تَعَالَى: {وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ} فَكَفَّرْتُ عَنْ يَمِينِي وَأَنْكَحْتُهَا إِيَّاهُ.(٣) - أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي القاسم النصرأباذي قال: أخبرنا أَبُو مُحَمَّدٍ عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ بْنِ ماسي البزاز، أخبرنا أَبُو مُسْلِمٍ إِبْرَاهِيمُ بْنُ عَبْدِ الله البصري قال: حَدَّثَنَا حَجَّاجُ بن منهال قال: حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، عَنِ الْحَسَنِ: أَنَّ مَعْقِلَ بْنَ يَسَارٍ زَوَّجَ أُخْتَهُ مِنْ رَجُلٍ مِنَ الْمُسْلِمِينَ، وَكَانَتْ، عِنْدَهُ مَا كَانَتْ فَطَلَّقَهَا تَطْلِيقَةً ثُمَّ تَرَكَهَا وَمَضَتِ الْعِدَّةُ، فَكَانَتْ أَحَقَّ بِنَفْسِهَا، فَخَطَبَهَا مَعَ الْخُطَّابِ فَرَضِيَتْ أَنْ تَرْجِعَ إِلَيْهِ، فَخَطَبَهَا إِلَى مَعْقِلِ بْنِ يَسَارٍ، فَغَضِبَ مَعْقِلٌ وَقَالَ: أَكْرَمْتُكَ بِهَا فَطَلَّقْتَهَا، لَا وَاللَّهِ لَا ترجع إلي بَعْدَهَا، قَالَ الْحَسَنُ: عَلِمَ اللَّهُ حَاجَةَ الرَّجُلِ إِلَى امْرَأَتِهِ وَحَاجَةَ الْمَرْأَةِ إِلَى بَعْلِهَا، فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَالْقُرْآنَ: {وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ إِذَا تَرَاضَوْا بَيْنَهُمْ بِالْمَعْرُوفِ} إِلَى آخِرِ الْآيَةِ، قَالَ: فَسَمِعَ ذَلِكَ مَعْقِلُ بْنُ يَسَارٍ فَقَالَ: سَمْعًا لِرَبِّي وَطَاعَةً، فَدَعَا زَوْجَهَا فَقَالَ: أُزَوِّجُكَ وَأُكْرِمُكَ فَزَوَّجَهَا إِيَّاهُ.(٤) - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الشَّاهِدُ أَخْبَرَنَا جَدِّي أَخْبَرَنَا أَبُو عَمْرٍو الحيري قال: حَدَّثَنَا مُحَمَّدُ بْنُ يحيى قال: حَدَّثَنَا عَمْرُو بْنُ حماد قال: حَدَّثَنَا أَسْبَاطٌ عَنِ السُّدِّيِّ عَنْ رِجَالِهِ قَالَ: نَزَلَتْ فِي جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ كَانَتْ لَهُ بِنْتُ عَمٍّ فَطَلَّقَهَا زَوْجُهَا تَطْلِيقَةً فَانْقَضَتْ عِدَّتُهَا ثُمَّ رَجَعَ يُرِيدُ رَجْعَتَهَا فَأَبَى جَابِرٌ وَقَالَ: طَلَّقْتَ ابْنَةَ عَمِّنَا ثُمَّ تُرِيدُ أَنْ تَنْكِحَهَا الثَّانِيَةَ وَكَانَتِ الْمَرْأَةُ تُرِيدُ زَوْجَهَا قَدْ رَضِيَتْ بِهِ فَنَزَلَتْ فِيهِمُ الْآيَةُ.</p><p>(١) - أخرجه البخاري (فتح الباري: ٩/١٨٣ - ح: ٥١٣٠) وأبو داود (٢/٥٦٩ - ح: ٢٠٨٧) وابن جرير (٢/٢٩٧) والحاكم (المستدرك: ٢/٢٨٠) وابن أبي حاتم وابن مردويه (تفسير ابن كثير: ١/٢٨٢) والدارقطني (الصحيح المسند للوادعي: ١٩) من طريق يونس بن عبيد عن الحسن به، ويشهد له: الرواية الآتية:.</p><p>(٢) - أخرجه الطبراني (المعجم الكبير: ٢٠/٢٠٥ - ح: ٤٦٨) وابن جرير (٢/٢٩٨) والطيالسي (منحة المعبود: ٢/١٤ - ح: ١٩٣٤) من طريق عبّاد به. وإسناده حسن، ويشهد له: الرواية الآتية:.</p><p>(٣) - أخرجه الترمذي (٥/٢١٦ - ح: ٢٩٨١) ، وإسناده ضعيف بسبب عنعنة ابن فضالة وهو مدلّس (تقريب التهذيب: ٢/٢٢٧ - رقم: ٩٠٤) . ويشهد له:</p><p>١ - الروايات السابقة.</p><p>٢ - ما أخرجه ابن جرير (٢/٢٩٧) من طريق قتادة عن الحسن نحوه وسنده صحيح. وبذا تتحسّن الرواية الضعيفة.</p><p>(٤) - أخرجه ابن جرير (٢/٢٩٨) وابن المنذر (فتح القدير: ١/٢٤٤) وابن مردويه (لباب النقول: ٤٧) من طريق عمرو بن حماد به.</p><p>وقد سبق تضعيف هذا السند، ولذا قال الحافظ ابن كثير - رحمه الله تعالى - \"والصحيح الأول\" (تفسير ابن كثير: ١/٢٨٢) - يعني حديث معقل بن يسار - وتبعه الإمام السيوطي (لباب النقول: ٤٧) .</p>"
  }, {
    "id": 69,
    "sura": 2,
    "aya": 234,
    "text": "قَوْلُهُ تَعَالَى: {وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِأَزْوَاجِهِمْ} الْآيَةَ {٢٣٤} .أخبرنا أَبُو عُمَرَ مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ الْمَرْوَزِيُّ فِي كِتَابِهِ، أَخْبَرَنَا أَبُو الْفَضْلِ مُحَمَّدُ بْنُ الْحُسَيْنِ الْحَدَّادِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ خَالِدٍ، أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ قَالَ: حُدِّثْتُ عَنْ مُقَاتِلِ بْنِ حَيَّانَ فِي هَذِهِ الْآيَةِ: أَنَّ رَجُلًا مِنْ أَهْلِ الطَّائِفِ قَدِمَ الْمَدِينَةَ وَلَهُ أَوْلَادٌ رِجَالٌ وَنِسَاءٌ، وَمَعَهُ أَبَوَاهُ وَامْرَأَتُهُ، فَمَاتَ بِالْمَدِينَةِ، فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَعْطَى الْوَالِدَيْنِ وَأَعْطَى أَوْلَادَهُ بِالْمَعْرُوفِ وَلَمْ يُعْطِ امْرَأَتَهُ شَيْئًا، غَيْرَ أَنَّهُ أَمَرَهُمْ أَنْ يُنْفِقُوا عَلَيْهَا مِنْ تَرِكَةِ زَوْجِهَا إِلَى الْحَوْلِ."
  }, {
    "id": 70,
    "sura": 2,
    "aya": 257,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَا إِكْرَاهَ فِي الدِّينِ} {٢٥٦} .أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ جَعْفَرٍ الْمُزَكِّي أَخْبَرَنَا زَاهِرُ بْنُ أَحْمَدَ أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدِ مصعب قال: حدثني يَحْيَى بن حكيم قال: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَتِ الْمَرْأَةُ مِنْ نِسَاءِ الْأَنْصَارِ تَكُونُ مِقْلَاةً فَتَجْعَلُ عَلَى نَفْسِهَا إِنْ عَاشَ لَهَا وَلَدٌ أَنْ تُهَوِّدَهُ، فَلَمَّا أُجْلِيَتِ النَّضِيرُ كَانَ فِيهِمْ مِنْ أَبْنَاءِ الْأَنْصَارِ، فَقَالُوا: لَا نَدَعُ أَبْنَاءَنَا، فَأَنْزَلَ اللَّهُ تَعَالَى: {لَا إِكْرَاهَ فِي الدِّينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ}أَخْبَرَنَا مُحَمَّدُ بْنُ مُوسَى بن الفضل فال: حَدَّثَنَا مُحَمَّدُ بن يعقوب قال: أخبرنا إِبْرَاهِيمُ بن مرزوق قال: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ فِي قَوْلِهِ تَعَالَى: {لَا إِكْرَاهَ فِي الدِّينِ} قَالَ: كَانَتِ الْمَرْأَةُ مِنَ الْأَنْصَارِ لَا يَكَادُ يَعِيشُ لَهَا وَلَدٌ فَتَحْلِفُ لَئِنْ عَاشَ لَهَا وَلَدٌ لَتُهَوِّدَنَّهُ فَلَمَّا أُجْلِيَتْ بَنُو النَّضِيرِ إِذَا فِيهِمْ أُنَاسٌ مِنْ أَبْنَاءِ الْأَنْصَارِ فَقَالَتِ الْأَنْصَارُ: يَا رَسُولَ اللَّهِ أَبْنَاؤُنَا فَأَنْزَلَ اللَّهُ تَعَالَى: {لَا إِكْرَاهَ فِي الدِّينِ} قَالَ سَعِيدُ بْنُ جُبَيْرٍ: فَمَنْ شَاءَ لَحِقَ بِهِمْ وَمَنْ شَاءَ دَخَلَ فِي الْإِسْلَامِ.وَقَالَ مُجَاهِدٌ: نَزَلَتْ هَذِهِ الْآيَةُ فِي رَجُلٍ مِنَ الْأَنْصَارِ كَانَ لَهُ غُلَامٌ أَسْوَدُ يُقَالُ لَهُ: صُبَيْحٌ وَكَانَ يُكْرِهُهُ عَلَى الْإِسْلَامِ.(٢) - وَقَالَ السُّدِّيُّ: نَزَلَتْ فِي رَجُلٍ مِنَ الْأَنْصَارِ يُكْنَى أَبَا الْحُصَيْنِ، وَكَانَ لَهُ ابْنَانِ، فَقَدِمَ تُجَّارُ الشَّامِ إِلَى الْمَدِينَةِ يَحْمِلُونَ الزَّيْتَ، فَلَمَّا أَرَادُوا الرُّجُوعَ مِنَ الْمَدِينَةِ أَتَاهُمُ ابْنَا أَبِي الْحُصَيْنِ فَدَعَوْهُمَا إِلَى النَّصْرَانِيَّةِ فَتَنَصَّرَا وَخَرَجَا إِلَى الشَّامِ فَأَخْبَرَ أَبُو الْحُصَيْنِ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: \"اطْلُبْهُمَا\" فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {لَا إِكْرَاهَ فِي الدِّينِ} فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَبْعَدَهُمَا اللَّهُ هُمَا أَوَّلُ من كفر\"؛ قال: وَكَانَ هَذَا قَبْلَ أَنْ يُؤْمَرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِقِتَالِ أَهْلِ الْكِتَابِ ثُمَّ نُسِخَ قَوْلُهُ: {لَا إِكْرَاهَ فِي الدِّينِ} وَأُمِرَ بِقِتَالِ أَهْلِ الْكِتَابِ فِي سُورَةِ بَرَاءَةٌ. وَقَالَ مَسْرُوقٌ: كَانَ لِرَجُلٍ مِنَ الْأَنْصَارِ مِنْ بَنِي سَالِمِ بْنِ عَوْفٍ ابْنَانِ فَتَنَصَّرَا قَبْلَ أَنْ يُبْعَثَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ثُمَّ قَدِمَا الْمَدِينَةَ فِي نَفَرٍ مِنَ النَّصَارَى يَحْمِلُونَ الطَّعَامَ فَأَتَاهُمَا أَبُوهُمَا فَلَزِمَهُمَا وَقَالَ: وَاللَّهِ لَا أَدَعُكُمَا حَتَّى تُسْلِمَا فَأَبَيَا أَنْ يُسْلِمَا فَاخْتَصَمُوا إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: يَا رَسُولَ الله أيدخل بعض النَّارَ وَأَنَا أَنْظُرُ؟ فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {لَا إِكْرَاهَ فِي الدِّينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ} فَخَلَّى سَبِيلَهُمَا.(٣) - أَخْبَرَنَا أَبُو إِسْحَاقَ أَحْمَدُ بن إبراهيم المقري أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَحْمَدَ بن عبدوس قال: أَخْبَرَنَا أَبُو الْحَسَنِ عَلِيُّ بْنُ أَحْمَدَ بن محفوظ قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ هاشم قال: أخبره عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ خُصَيْفٍ، عَنْ مُجَاهِدٍ قَالَ: كَانَ نَاسٌ مُسْتَرْضَعِينَ فِي الْيَهُودِ: قُرَيْظَةَ وَالنَّضِيرِ، فَلَمَّا أَمَرَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِإِجْلَاءِ بَنِي النَّضِيرِ قَالَ أَبْنَاؤُهُمْ مِنَ الْأَوْسِ الَّذِينَ كَانُوا مُسْتَرْضَعِينَ فِيهِمْ، لَنَذْهَبَنَّ مَعَهُمْ وَلَنَدِينَنَّ بِدِينِهِمْ، فَمَنَعَهُمْ أَهْلُهُمْوَأَرَادُوا أَنْ يُكْرِهُوهُمْ عَلَى الْإِسْلَامِ، فَنَزَلَتْ: {لَا إِكْرَاهَ فِي الدِّينِ} الْآيَةَ.</p><p>(١) - أخرجه أبو داود (٣/١٣٢ - ح: ١٦٨٢) وابن جرير (٣/١٠) والنسائي وابن المنذر وابن أبي حاتم وابن حبان وابن مردويه والبيهقي والضياء المقدسي (فتح القدير: ١/٢٧٥) من طريق سعيد بن جبير به.</p><p>وإسناده صحيح وصححه ابن حبان ومحقق جامع الأصول (٢/٥٣) ويشهد له:</p><p>١ - الرواية الآتية.</p><p>٢ - ما أخرجه ابن جرير (٣/١٠) وسعيد بن منصور وعبد بن حميد وابن المنذر والبيهقي (فتح القدير: ١/٢٧٦) عن سعيد بن جبير مرسلاً مثله، وإسناده صحيح.</p><p>(٢) - يشهد له:</p><p>١ - الرواية الآتية عن مسروق فإن الرجل من بني سالم بن عوف هو أبو الحصين.</p><p>٢ - ما أخرجه ابن جرير (٢/١٠) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما: أنها نزلت في رجل من الأنصار من بني سالم بن عوف يقال له \"الحصين\" كان له ابنان نصرانيان وكان هو رجلا مسلما فقال للنبي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ألا أستكرههما؟ فإنهم قد أبيا إلا النصرانية فأنزل الله الآية. وسنده حسن وبذا يثبت أصل الرواية ويكون لهذه الآية سببا نزول.</p><p>(٣) - في إسناده خصيف وهو ضعيف.</p>"
  }, {
    "id": 71,
    "sura": 2,
    "aya": 260,
    "text": "قَوْلُهُ تَعَالَى: {وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى} الْآيَةَ {٢٦٠} .ذَكَرَ الْمُفَسِّرُونَ السَّبَبَ فِي سُؤَالِ إِبْرَاهِيمَ رَبَّهُ أَنْ يُرِيَهُ إِحْيَاءَ الْمَوْتَى. أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ بن جعفر قال: أَخْبَرَنَا شُعْبَةُ بْنُ محمد قال: أَخْبَرَنَا مَكِّيُّ بْنُ عبدان قال: حَدَّثَنَا أَبُو الأزهر قال: حَدَّثَنَا رَوْحٌ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ قَالَ: ذُكِرَ لَنَا أَنَّ إِبْرَاهِيمَ أَتَى عَلَى دَابَّةٍ مَيْتَةٍ قد تَوَزَّعَتْهَا دَوَابُّ الْبَرِّ والبحر قال: {رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى} وَقَالَ الْحَسَنُ وَعَطَاءٌ الْخُرَاسَانِيُّ وَالضَّحَاكُ وَابْنُ جُرَيْجٍ: إِنَّ إِبْرَاهِيمَ الْخَلِيلَ مَرَّ عَلَى دَابَّةٍ مَيْتَةٍ قَالَ ابْنُ جُرَيْجٍ: كَانَتْ جِيفَةَ حِمَارٍ بِسَاحِلِ الْبَحْرِ. قَالَ عَطَاءٌ: بُحَيْرَةُ طَبَرِيَّةَ قَالُوا: فَرَآهَا قد تَوَزَّعَتْهَا دَوَابُّ الْبَرِّ وَالْبَحْرِ فَكَانَ إِذَا مَدَّ الْبَحْرُ جَاءَتِ الْحِيتَانُ وَدَوَابُّ الْبَحْرِ فَأَكَلَتْ مِنْهَا، فَمَا وقع منها يقع في الماء وإذا جذر البحر جاءت السِّبَاعُ فَأَكَلَتْ منها فما وقع منها يصير ترابًا، فإذا ذهبت السباع جاءت الطير فأكلت مِنْهَا، فَمَا سَقَطَ قَطَّعَتْهُ الرِّيحُ فِي الْهَوَاءِ، فَلَمَّا رَأَى ذَلِكَ إِبْرَاهِيمُ تَعَجَّبَ مِنْهَا وَقَالَ: \"يَا رَبِّ قَدْ عَلِمْتُ لَتَجْمَعَنَّهَا. فَأَرِنِي كَيْفَ تُحْيِيهَا لِأُعَايِنَ ذَلِكَ؟ \".وَقَالَ ابْنُ زَيْدٍ: مَرَّ إِبْرَاهِيمُ بِحُوتٍ مَيِّتٍ نِصْفُهُ فِي الْبَرِّ وَنِصْفُهُ فِي الْبَحْرِ فَمَا كَانَ فِي الْبَحْرِ فَدَوَابُّ الْبَحْرِ تَأْكُلُهُ وَمَا كَانَ مِنْهُ فِي الْبَرِّ فَدَوَابُّ الْبَرِّ تَأْكُلُهُ، فَقَالَ لَهُ إِبْلِيسُ الْخَبِيثُ: مَتَى يَجْمَعُ اللَّهُ هَذِهِ الْأَجْزَاءَ مِنْ بُطُونِ هَؤُلَاءِ؟ فَقَالَ: {رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي} بِذَهَابِ وَسْوَسَةِ إِبْلِيسَ مِنْهُ.أَخْبَرَنَا أَبُو نُعَيْمٍ الْأَصْفَهَانِيُّ فِيمَا أَذِنَ لِي في روايته قال: حدثناعبد اللَّهِ بْنُ مُحَمَّدِ بن جعفر قال: حَدَّثَنَا مُحَمَّدُ بْنُ سهل قال: حَدَّثَنَا سَلَمَةُ بْنُ شبيب قال: حَدَّثَنَا إِبْرَاهِيمُ بْنُالْحَكَمِ بْنِ أبان قال: حَدَّثَنَا أَبِي قَالَ: كُنْتُ جَالِسًا مَعَ عِكْرِمَةَ عِنْدَ السَّاحِلِ، فَقَالَ عِكْرِمَةُ: إِنَّ الَّذِينَ يَغْرِقُونَ فِي الْبِحَارِ تُقَسِّمُ الْحِيتَانُ لُحُومَهُمْ فَلَا يَبْقَى مِنْهُمْ شَيْءٌ إِلَّا الْعِظَامُ فَتُلْقِيهَا الْأَمْوَاجُ عَلَى الْبَرِّ فَتَصِيرُ حَائِلَةً نَخِرَةً، فَتَمُرُّ بِهَا الْإِبِلُ فَتَأْكُلُهَا فَتَبْعَرُ ثُمَّ يَجِيءُ قَوْمٌ فيأخذون ذلك البعر فَيُوقِدُونَ فَتُخْمَدُ تِلْكَ النَّارُ فَتَجِيءُ رِيحٌ فَتَسْفِي ذَلِكَ الرَّمَادَ عَلَى الْأَرْضِ، فَإِذَا جَاءَتِ النَّفْخَةُ خَرَجَ أُولَئِكَ وَأَهْلُ الْقُبُورِ سَوَاءً، وَذَلِكَ قَوْلُهُ تَعَالَى: {فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ}وَقَالَ مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ يَسَارٍ: إِنَّ إِبْرَاهِيمَ لَمَّا احْتَجَّ عَلَى نُمْرُوذَ فَقَالَ: {رَبِّيَ الَّذِي يُحْيِي وَيُمِيتُ} وَقَالَ نُمْرُوذُ: أَنَا أُحْيِي وَأُمِيتُ، ثُمَّ قَتَلَ رَجُلًا وَأَطْلَقَ رَجُلًا، قَالَ: قَدْ أَمَتُّ ذَلِكَ وَأَحْيَيْتُ هَذَا، قَالَ لَهُ إِبْرَاهِيمُ: \"فَإِنَّ اللَّهَ يُحْيِي بِأَنْ يَرُدَّ الرُّوحَ إِلَى جَسَدٍ مَيِّتٍ\" فَقَالَ لَهُ نُمْرُوذُ: هَلْ عَايَنْتَ هَذَا الَّذِي تَقُولُهُ؟ وَلَمْ يَقْدِرْ أَنْ يَقُولَ: نَعَمْ رَأَيْتُهُ، فَانْتَقَلَ إِلَى حُجَّةٍ أُخْرَى، ثُمَّ سَأَلَ رَبَّهُ أَنْ يريه إحياء الميت لِكَيْ يَطْمَئِنَّ قَلْبُهُ عِنْدَ الِاحْتِجَاجِ، فَإِنَّهُ يَكُونُ مُخْبِرًا عَنْ مُشَاهَدَةٍ وَعِيَانٍ. وَقَالَ ابْنُ عَبَّاسٍ وَسَعِيدُ بْنُ جُبَيْرٍ وَالسُّدِّيُّ: لَمَّا اتَّخَذَ إِبْرَاهِيمَ خَلِيلًا اسْتَأْذَنَ مَلَكُ الْمَوْتِ رَبَّهُ أَنْ يَأْتِيَ إِبْرَاهِيمَ فَيُبَشِّرُهُ بِذَلِكَ، فَأَتَاهُ فَقَالَ: جِئْتُكَ أُبَشِّرُكَ بِأَنَّ اللَّهَ تَعَالَى اتَّخَذَكَ خَلِيلًا فَحَمِدَ اللَّهَ - عَزَّ وَجَلَّ - وَقَالَ: \"مَا علامةُ ذلك؟ \" قال: أَنْ يُجِيبَ الله دعاءك وتحيي الْمَوْتَى بِسُؤَالِكَ، ثُمَّ انْطَلَقَ وَذَهَبَ، فَقَالَ إِبْرَاهِيمُ: {رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى} قَالَ: {أَوَلَمْ تُؤْمِنْ} قَالَ: {بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي} بِعِلْمِي أَنَّكَ تُجِيبُنِي إِذَا دَعَوْتُكَ، وَتُعْطِينِي إِذَا سَأَلْتُكَ، أَنَّكَ اتَّخَذْتَنِي خَلِيلًا."
  }, {
    "id": 72,
    "sura": 2,
    "aya": 262,
    "text": "قَوْلُهُ تَعَالَى: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ} الْآيَةَ {٢٦٢} .قَالَ الْكَلْبِيُّ: نَزَلَتْ فِي عُثْمَانَ بْنِ عَفَّانَ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَمَّا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَإِنَّهُ جَاءَ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِأَرْبَعَةِ آلَافِ دِرْهَمٍ صَدَقَةً، فَقَالَ: كَانَ عِنْدِي ثَمَانِيَةُ آلَافِ دِرْهَمٍ، فَأَمْسَكْتُ منها لنفسي ولعيالي أَرْبَعَةَ آلَافِ دِرْهَمٍ وَأَرْبَعَةَ آلَافٍ أَقْرَضْتُهَا رَبِّي، فَقَالَ لَهُ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"بَارَكَ اللَّهُ لَكَ فِيمَا أَمْسَكْتَ وَفِيمَا أَعْطَيْتَ\".وَأَمَّا عُثْمَانُ - رَضِيَ اللَّهُ عَنْهُ - فَقَالَ: عَلَيَّ جِهَازُ مَنْ لَا جِهَازَ لَهُ فِي غَزْوَةِ تَبُوكَ، فَجَهَّزَ الْمُسْلِمِينَ بِأَلْفِ بَعِيرٍ بِأَقْتَابِهَا وَأَحْلَاسِهَا، وَتَصَدَّقَ بِرُومَةَ - رَكِيَّةٍ كَانَتْ لَهُ - عَلَى الْمُسْلِمِينَ، فَنَزَلَتْ فِيهِمَا هَذِهِ الْآيَةُ.وَقَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ: رَأَيْتُ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - رَافِعًا يَدَهُ يَدْعُو لِعُثْمَانَ وَيَقُولُ: \"يَا رَبِّ إِنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيتُ عَنْهُ فَارْضَ عَنْهُ\" فَمَا زَالَ رَافِعًا يَدَهُ حَتَّى طَلَعَ الْفَجْرُ، فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِ: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ} الْآيَةَ."
  }, {
    "id": 73,
    "sura": 2,
    "aya": 267,
    "text": "<p>(١) - قوله تعالى: {يَا أَيّهَا الَّذِينَ آمَنُوا أَنْفِقُوا مِنْ طَيِّبَاتِ مَا كَسَبْتُمْ} الْآيَةَ {٢٦٧} .</p><p>أَخْبَرَنَا عَبْدُ الرَّحْمَنِ أحمد الصيدلاني قال: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بن نعيم قال: حَدَّثَنَا أَحْمَدُ بْنُ سَهْلِ بن حمدويه قال: حَدَّثَنَا قَيْسُ بْنُ أَنِيفٍ، حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ: قَالَ أَمَرَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِزَكَاةِ الْفِطْرِ بِصَاعٍ مِنْ تَمْرٍ، فَجَاءَ رَجُلٌ بِتَمْرٍ رَدِيءٍ، فنزل القرآن: {يَا أَيّهَا الَّذِينَ آمَنُوا أَنْفِقُوامِنْ طَيِّبَاتِ مَا كَسَبْتُمْ وَمِمَّا أَخْرَجْنَا لَكُمْ مِنَ الْأَرْضِ وَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ}(٢) - أَخْبَرَنَا أَبُو إِسْحَاقَ أَحْمَدُ بْنُ محمد الواعظ قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ حامد الأصفهاني قال: حَدَّثَنَا مُحَمَّدُ بْنُ إسماعيل الفارسي قال: حَدَّثَنَا أَحْمَدُ بن موسى الجماز قال: حَدَّثَنَا عَمْرُو بْنُ حَمَّادِ بْنِ طلحة قال: حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ، عَنِ السُّدِّيِّ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنِ الْبَرَاءِ قَالَ: نَزَلَتْ هَذِهِ الْآيَةُ فِي الْأَنْصَارِ، كَانَتْ تُخْرِجُ إِذَا كَانَ جُذَاذُ النَّخْلِ مِنْ حِيطَانِهَا أَقْنَاءً مِنَ التَّمْرِ وَالْبُسْرِ، فَيُعَلِّقُونَهَا عَلَى حَبْلٍ بَيْنَ أُسْطُوَانَتَيْنِ فِي مَسْجِدِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَيَأْكُلُ مِنْهُ فُقَرَاءُ الْمُهَاجِرِينَ، وَكَانَ الرَّجُلُ يَعْمِدُ فَيُخْرِجُ قِنْوَ الْحَشَفِ وَهُوَ يَظُنُّ أَنَّهُ جَائِزٌ عَنْهُ فِي كَثْرَةِ مَا يُوضَعُ مِنَ الْأَقْنَاءِ فَنَزَلَ فِيمَنْ فَعَلَ ذَلِكَ: {وَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ} يَعْنِي الْقِنْوَ الَّذِي فِيهِ حَشَفٌ وَلَوْ أُهْدِيَ إِلَيْكُمْ مَا قَبِلْتُمُوهُ.</p><p>(١) - أخرجه الحاكم في \"المستدرك\" (٢/٢٨٣) وصححه وهو كما قال، ويشهد له:</p><p>* ما أخرجه النسائي (فتح القدير: ١/٢٩١) والحاكم (المستدرك: ٢/٢٨٤) والدارقطني (٢/١٣٠ - ح: ١١) والطبراني (المعجم الكبير: ٦/٩٣ - ح: ٥٥٦٧) والبيهقي وعبد بن حميد وابن المنذر وابن أبي حاتم (فتح القدير: ١/٢٩١) عن سهل بن حنيف بمعناه. وصححه الحاكم ووافقه الذهبي (انظر حاشية جامع الأصول: ٤/٦١٩ والتعليق المغني على الدارقطني: ٢/١٣٠ - ١٣٢) .</p><p>* الرواية الآتية:.</p><p>(٢) - أخرجه الحاكم (المستدرك: ٢/٢٨٥) والترمذي (٢١٨٥ - ح: ٢٩٨٧) وابن ماجه (١/٥٨٣ - ح: ١٨٢٢) وابن جرير (٣/٥٥) والبيهقي وابن أبي شيبة وعبد بن حميد وابن المنذر وابن أبي حاتم وابن مردويه (فتح القدير: ١/٢٩١) من طريق أسباط عن السدي به.</p><p>وصححه الحاكم والترمذي، والبوصيري في الزوائد (سنن ابن ماجه: ١/٥٨٣) وحسّنه محقق جامع الأصول. قلت: قد رجحنا فيما سبق تضعيف هذا السند لكن الحديث حسن بشواهده السابقة، والله أعلم.</p>"
  }, {
    "id": 74,
    "sura": 2,
    "aya": 272,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَيْسَ عَلَيْكَ هُدَاهُمْ} الْآيَةَ {٢٧٢} .أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ الْحَارِثِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ جَعْفَرٍ. حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ مُسْلِمٍ، حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ الْعَسْكَرِيُّ، حَدَّثَنَا جَرِيرٌ، عَنْ أَشْعَثَ بْنِ إِسْحَاقَ، عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"لَا تَصَدَّقُوا إِلَّا عَلَى أَهْلِ دِينِكُمْ\" فَأَنْزَلَ اللَّهُ تَعَالَى: {لَيْسَ عَلَيْكَ هُدَاهُمْ} فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"تَصَدَّقُوا عَلَى أَهْلِ الْأَدْيَانِ\".أَخْبَرَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سَهْلٌ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنِ الْحَجَّاجِ، عَنْ سَلْمَانَ الْمَكِّيِّ، عَنِ ابْنِ الْحَنَفِيَّةِ قَالَ:كَانَ الْمُسْلِمُونَ يَكْرَهُونَ أَنْ يتصدقوا على الفقراء الْمُشْرِكِينَ حَتَّى نَزَلَتْ هَذِهِ الْآيَةُ، فَأُمِرُوا أَنْ يَتَصَدَّقُوا عَلَيْهِمْ.</p><p>وَقَالَ الْكَلْبِيُّ: اعْتَمَرَ رَسُولُ اللَّهِ عُمْرَةَ الْقَضَاءِ وَكَانَتْ مَعَهُ فِي تِلْكَ الْعُمْرَةِ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ، فَجَاءَتْهَا أُمُّهَا قُتَيْلَةُ وَجَدَّتُهَا يَسْأَلَانِهَا، وَهُمَا مُشْرِكَتَانِ، فقالت: لا أعطيكم شَيْئًا حَتَّى أَسْتَأْمِرَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَإِنَّكُمَا لَسْتُمَا عَلَى دِينِي. فَاسْتَأْمَرَتْهُ فِي ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ. فَأَمَرَهَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَعْدَ نُزُولِ هَذِهِ الْآيَةِ، أَنْ تَصَدَّقَ عَلَيْهِمَا، فَأَعْطَتْهُمَا وَوَصَلَتْهُمَا. قَالَ الْكَلْبِيُّ: وَلَهَا وَجْهٌ آخَرُ، وَذَلِكَ أَنَّ نَاسًا مِنَ الْمُسْلِمِينَ كَانَتْ لَهُمْ قَرَابَةٌ وَأَصْهَارٌ وَرَضَاعٌ فِي الْيَهُودِ، وَكَانُوا يَنْفَعُونَهُمْ قَبْلَ أَنْ يُسْلِمُوا فَلَمَّا أَسْلَمُوا كَرِهُوا أَنْ يَنْفَعُوهُمْ وَأَرَادُوهُمْ عَلَى أَنْ يُسْلِمُوا فَاسْتَأْمَرُوا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ هَذِهِ الْآيَةُ فَأَعْطَوْهُمْ بَعْدَ نُزُولِهَا.</p><p>(١) - قلت: مرسل جيد الإسناد وقد وصله ابن أبي حاتم (تفسير ابن كثير: ١٠/٣٢٣ والضياء في المختارة (فتح القدير: ١/٢٩٣) عن ابن عباس رضي الله عنهما ويشهد له:</p><p>* ما أخرجه النسائي وعبد بن حميد والبزار وابن المنذر وابن أبي حاتم والبيهقي (فتح القدير: ١/٢٩٣) والحاكم (المستدرك: ٢/٢٨٥) والطبراني (المعجم الكبير: ١٢/٥٤ - ح ١٢٤٥٣) عن ابن عباس رضي الله عنهما قال: كانوا يكرهون أن يرضخوا لأنسابهم وهم مشركون فأنزل الله عليهم، صححه الحاكم ووافقه الذهبي وهو كما قالا (وانظر حاشية معجم الطبراني الكبير: ١٢/٥٤) .</p>"
  }, {
    "id": 75,
    "sura": 2,
    "aya": 274,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً} الْآيَةَ {٢٧٤} .أَخْبَرَنَا أَبُو إِبْرَاهِيمَ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ النَّصْرَابَاذِيُّ أَخْبَرَنَا عَمْرُو بن نجيد قال: أَخْبَرَنَا مُحَمَّدُ بْنُ الْحَسَنِ بن الخليل قال: حَدَّثَنَا هِشَامُ بن عمار قال: حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، عَنِ ابْنِ مَهْدِيٍّ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ عَرِيبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ: \"نَزَلَتْ هَذِهِ الْآيَةُ: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ} فِي أَصْحَابِ الْخَيْلِ\" وَقَالَ: \"إِنَّ الشَّيَاطِينَ لَا تَخْبِلُ أَحَدًا فِي بَيْتِهِ فَرَسٌ عَتِيقٌ مِنَ الْخَيْلِ\" وَهَذَا قَوْلُ أَبِي أُمَامَةَ وَأَبِي الدَّرْدَاءِ وَمَكْحُولٍ وَالْأَوْزَاعِيِّ وَرَبَاحِ بْنِ زَيْدٍ، قَالُوا: هم الذين يرتبطون الْخَيْلَ فِي سَبِيلِ اللَّهِ تَعَالَى يُنْفِقُونَ عَلَيْهَا بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً، نَزَلَتْ فِيمَنْ لَمْ يَرْتَبِطْهَا خُيَلَاءُ وَلَا لِضِمَارٍ.أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ إبراهيم الثعلبي قال: أَخْبَرَنِي الْحُسَيْنُ بْنُ محمد الدينوري قال: حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله النهرواني قال: حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ مهرويه القزويني قال: حَدَّثَنَا عَلِيُّ بْنُ داود القنطري قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صالح قال: حَدَّثَنِي أَبُو شُرَيْحٍ، عَنْ قَيْسِ بْنِ الْحَجَّاجِ، عَنْ حَنَشِ بْنِ عَبْدِ اللَّهِ الصَّنْعَانِيِّ أَنَّهُ قَالَ: حَدَّثَ ابْنُ عَبَّاسٍ فِي هَذِهِ الْآيَةِ: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ} قَالَ: فِي عَلَفِ الْخَيْلِ.وَيَدُلُّ عَلَى صِحَّةِ هَذَا مَا أَخْبَرَنَا أبو إسحاق المقري قال: أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَحْمَدَ بن عبدوس قال: أَخْبَرَنَا أَبُو الْعَبَّاسِ عَبْدُ اللَّهِ بْنُ يعقوب الكرماني قال: حَدَّثَنَا مُحَمَّدُ بْنُزكريا الكرماني قال: حَدَّثَنَا وكيع قال: حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"مَنِ ارْتَبَطَ فَرَسًا فِي سَبِيلِ اللَّهِ فَأَنْفَقَ عَلَيْهِ احْتِسَابًا كَانَ شِبَعه وجُوعه ورِبه وَظَمَؤُهُ وَبَوْلُهُ وَرَوَثُهُ فِي مِيزَانِهِ يَوْمَ الْقِيَامَةِ\".وَأَخْبَرَنَا أبو إسحاق قال: أَخْبَرَنَا أَبُو عمرو الفراتي قال: أَخْبَرَنَا أَبُو مُوسَى عِمْرَانُ بن موسى قال: حَدَّثَنَا سَعِيدُ بْنُ عثمان الجزري قال: حَدَّثَنَا فَارِسُ بن عمر قال: حَدَّثَنَا صَالِحُ بْنُ محمد قال: حَدَّثَنَا سُلَيْمَانُ بْنُ عَمْرٍو، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ مَكْحُولٍ، عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"الْمُنْفِقُ فِي سَبِيلِ اللَّهِ عَلَى فَرَسِهِ كَالْبَاسِطِ كَفَّيْهِ بِالصَّدَقَةِ\".أَخْبَرَنَا أَبُو حَامِدٍ أَحْمَدُ بْنُ الحسن الكاتب قال: أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ شاذان الرازي. قال: أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أبي حاتم قال: حَدَّثَنَا أَبُو سعيد الأشج قال: حَدَّثَنَا زَيْدُ بن الحباب قال: أَخْبَرَنَا رَجَاءُ بْنُ أَبِي سَلَمَةَ، عَنْ سُلَيْمَانَ بْنِ مُوسَى الدِّمَشْقِيِّ، عَنْ عَجْلَانَ بْنِ سَهْلٍ الْبَاهِلِيِّ قَالَ: سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُ: مَنِ ارْتَبَطَ فَرَسًا فِي سَبِيلِ اللَّهِ لَمْ يَرْتَبِطْهُ رِيَاءً وَلَا سُمْعَةً كَانَ مِنَ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ.قَوْلٌ آخَرُ: أَخْبَرَنَا أَبُو بَكْرٍ التَّمِيمِيُّ أَخْبَرَنَا أَبُو مُحَمَّدِ بْنُ حَيَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مالك الضبي قال: حَدَّثَنَا مُحَمَّدُ بْنُ إسماعيل الجرجاني قال: حَدَّثَنَا عبد الرزاق قال: حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ مُجَاهِدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ فِي قَوْلِهِ: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً} قَالَ: نَزَلَتْ فِي عَلِيِّ بْنِ أَبِي طَالِبٍ كَانَ عِنْدَهُ أَرْبَعَةُ دَرَاهِمَ، فَأَنْفَقَ بِاللَّيْلِ وَاحِدًا وَبِالنَّهَارِ وَاحِدًا وَفِي السِّرِّ وَاحِدًا وَفِي الْعَلَانِيَةِ وَاحِدًا.أَخْبَرَنَا أَحْمَدُ بْنُ الحسن الكاتب قال: حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بن شاذان قال: أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أبي حاتم قال: حَدَّثَنَا أَبُو سَعِيدٍ الأشج، قال: حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ عَبْدِالْوَهَّابِ بْنِ مُجَاهِدٍ، عَنْ أَبِيهِ قَالَ: كَانَ لِعَلِيٍّ - رَضِيَ اللَّهُ عَنْهُ - أَرْبَعَةُ دَرَاهِمَ، فَأَنْفَقَ دِرْهَمًا بِاللَّيْلِ، وَدِرْهَمًا بِالنَّهَارِ، وَدِرْهَمًا سِرًّا، وَدِرْهَمًا عَلَانِيَةً فَنَزَلَتْ: {الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً} .وَقَالَ الْكَلْبِيُّ: نَزَلَتْ هَذِهِ الْآيَةُ فِي عَلِيِّ بْنِ أَبِي طَالِبٍ - رَضِيَ اللَّهُ عَنْهُ - لَمْ يَكُنْ يَمْلِكُ غَيْرَ أَرْبَعَةِ دَرَاهِمَ، فَتَصَدَّقَ بِدِرْهَمٍ لَيْلًا، وَبِدِرْهَمٍ نَهَارًا، وَبِدِرْهَمٍ سِرًّا، وَبِدِرْهَمٍ عَلَانِيَةً، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"مَا حَمَلَكَ عَلَى هَذَا؟ \" قَالَ: حَمَلَنِي أَنْ أَسْتَوْجِبَ عَلَى اللَّهِ الَّذِي وَعَدَنِي، فَقَالَ لَهُ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَلَا إِنَّ ذَلِكَ لَكَ\" فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه الطبراني (المعجم الكبير: ١١/٩٧ - ح: ١١١٦٤) وعبد الرزاق وعبد بن حميد وابن المنذر وابن أبي حاتم وابن عساكر (فتح القدير: ١/٢٩٤) من طريق عبد الوهاب وإسناده ضعيف جدًا، بسبب عبد الوهاب (تقريب التهذيب: ١/٥٢٨ - رقم: ١٤٠٧) ، وضعف الحديث الهيثمي (مجمع الزوائد: ٦/٣٢٤) وابن حجر (فتح الباري: ٣/٢٨٩) وابن كثير (تفسير ابن كثير: ١/٣٢٦) والسيوطي (لباب النقول: ٥٠) وقل في الرواية الآتية مثل هذا. </p>"
  }, {
    "id": 76,
    "sura": 2,
    "aya": 278,
    "text": "<p>(١) - قوله تعالى: {يَا أَيّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا} {٢٧٨} .أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ أَحْمَدَ بن جعفر قال: أَخْبَرَنَا أَبُو عَمْرِو بن حمدان قال: أَخْبَرَنَا أبو يعلى قال: حَدَّثَنَا أَحْمَدُ بن الأخنس قال: حَدَّثَنَا مُحَمَّدُ بن فضيل قال: حَدَّثَنَا الْكَلْبِيُّ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ: بَلَغَنَا وَاللَّهُ أَعْلَمُ أَنَّ هَذِهِ الْآيَةَ نَزَلَتْ فِي بَنِي عَمْرِو بْنِ عُمَيْرِ بْنِ عَوْفٍ مِنْ ثَقِيفٍ، وَفِي بَنِي الْمُغِيرَةِ مِنْ بَنِي مَخْزُومٍ، وَكَانَتْ بَنُو الْمُغِيرَةِ يُرْبُونَ لِثَقِيفٍ، فَلَمَّا أَظْهَرَ اللَّهُ تَعَالَى رَسُولَهُ عَلَى مَكَّةَ، وُضِعَ يَوْمَئِذٍ الرِّبَا كُلُّهُ، فَأَتَى بَنُو عَمْرِو بْنِ عُمَيْرٍ وَبَنُو الْمُغِيرَةِ إِلَى عَتَّابِ بْنِ أَسِيدٍ وَهُوَ عَلَى مَكَّةَ، فَقَالَ بَنُو الْمُغِيرَةِ: مَا جَعَلَنَا أَشْقَى النَّاسِ بِالرِّبَا وُضِعَ عَنِ النَّاسِ غَيْرَنَا، فَقَالَ بَنُو عَمْرِو بْنِ عُمَيْرٍ: صُولِحْنَا عَلَى أَنَّ لَنَا رِبَانَا، فَكَتَبَ عَتَّابٌ فِي ذَلِكَ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ هَذِهِ الْآيَةُ وَالَّتِي بَعْدَهَا: {فَإِنْ لَمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِنَ اللَّهِ وَرَسُولِهِ} فَعَرَفَ بَنُو عَمْرٍو أَنْ لَا يُدَانَ لَهُمْ بِحَرْبٍ مِنَاللَّهِ وَرَسُولِهِ يَقُولُ اللَّهُ تَعَالَى: {وَإِنْ تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ} فَتَأْخُذُونَ أَكْثَرَ {وَلَا تُظْلَمُونَ} فَتُبْخَسُونَ مِنْهُ.وَقَالَ عَطَاءٌ وَعِكْرِمَةُ: نَزَلَتْ هَذِهِ الْآيَةُ فِي الْعَبَّاسِ بْنِ عَبْدِ الْمُطَلِّبِ وَعُثْمَانَ بْنِ عَفَّانَ وَكَانَا قَدْ أَسْلَفَا فِي التَّمْرِ، فَلَمَّا حَضَرَ الْجُذَاذُ قَالَ لَهُمَا صَاحِبُ التَّمْرِ: لَا يَبْقَى لِي مَا يَكْفِي عِيَالِي إِذَا أَنْتُمَا أَخَذْتُمَا حَظَّكُمَا كُلَّهُ، فَهَلْ لَكُمَا أَنْ تَأْخُذَا النِّصْفَ وَتُؤَخِّرَا النِّصْفَ وَأُضْعِفُ لَكُمَا فَفَعَلَا؛ فَلَمَّا حَلَّ الْأَجَلُ طَلَبَا الزِّيَادَةَ، فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَهَاهُمَا وَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ، فَسَمِعَا وَأَطَاعَا وَأَخَذَا رُؤُوسَ أَمْوَالِهِمَا.وَقَالَ السُّدِّيُّ: نَزَلَتْ فِي الْعَبَّاسِ وَخَالِدِ بْنِ الْوَلِيدِ وَكَانَا شَرِيكَيْنِ فِي الْجَاهِلِيَّةِ يُسْلِفَانِ فِي الرِّبَا فَجَاءَ الْإِسْلَامُ وَلَهُمَا أَمْوَالٌ عَظِيمَةٌ فِي الرِّبَا فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَلَا إِنَّ كُلَّ رِبًا مِنْ رِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُهُ رِبَا الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ\".قَوْلُهُ تَعَالَى: {وَإِنْ كَانَ ذُو عُسْرَةٍ} {٢٨٠} .قَالَ الْكَلْبِيُّ: قَالَتْ بَنُو عَمْرِو بْنِ عُمَيْرٍ لِبَنِي الْمُغِيرَةِ: هَاتُوا رؤوس أموالنا ولكن الرِّبَا نَدَعُهُ لَكُمْ، فَقَالَتْ بَنُو الْمُغِيرَةِ: نَحْنُ الْيَوْمَ أَهْلُ عُسْرَةٍ فَأَخِّرُونَا إِلَى أَنْ تُدْرِكَ الثَّمَرَةُ، فَأَبَوْا أَنْ يُؤَخِّرُوهُمْ فَأَنْزَلَ اللَّهُ تَعَالَى: {وَإِنْ كَانَ ذُو عُسْرَةٍ} الْآيَةَ.</p><p>(١) - أخرجه ابن منده وأبو يعلى (لباب النقول: ٥٠) من طريق الكلبي به. وهذا إسناده هالك كما سبق.</p>"
  }, {
    "id": 77,
    "sura": 2,
    "aya": 280,
    "text": "قَوْلُهُ تَعَالَى: {وَإِنْ كَانَ ذُو عُسْرَةٍ} {٢٨٠} .قَالَ الْكَلْبِيُّ: قَالَتْ بَنُو عَمْرِو بْنِ عُمَيْرٍ لِبَنِي الْمُغِيرَةِ: هَاتُوا رؤوس أموالنا ولكن الرِّبَا نَدَعُهُ لَكُمْ، فَقَالَتْ بَنُو الْمُغِيرَةِ: نَحْنُ الْيَوْمَ أَهْلُ عُسْرَةٍ فَأَخِّرُونَا إِلَى أَنْ تُدْرِكَ الثَّمَرَةُ، فَأَبَوْا أَنْ يُؤَخِّرُوهُمْ فَأَنْزَلَ اللَّهُ تَعَالَى: {وَإِنْ كَانَ ذُو عُسْرَةٍ} الْآيَةَ."
  },
    {
    "id": 78,
    "sura": 2,
    "aya": 285,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ} {٢٨٥} .أَخْبَرَنَا الْإِمَامُ أَبُو مَنْصُورٍ عَبْدُ الْقَاهِرِ بن طاهر قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَلِيِّ بن زياد قال: حَدَّثَنَا مُحَمَّدُ بْنُ إبراهيم البوشنجي قال: حَدَّثَنَا أُمَيَّةُ بن بسطام قال: حَدَّثَنَايَزِيدُ بْنُ زريع قال: حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: لَمَّا أُنزل على رسول اللَّهُ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - {وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ} الْآيَةَ، اشْتَدَّ ذَلِكَ عَلَى أَصْحَابِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ثُمَّ أَتَوْا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالُوا: كُلِّفْنَا مِنَ الْأَعْمَالِ مَا نُطِيقُ: الصَّلَاةَ وَالصِّيَامَ وَالْجِهَادَ والصدقة، وقد أنزلت عَلَيْكَ هَذِهِ الْآيَةَ وَلَا نُطِيقُهَا، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَتُرِيدُونَ أَنْ تَقُولُوا كَمَا قَالَ أَهْلُ الْكِتَابَيْنِ مِنْ قَبْلِكُمْ؟ \" أَرَاهُ قَالَ: سَمِعْنَا وَعَصَيْنَا \"قُولُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ\" فَلَمَّا اقترأها القوم وجرت بِهَا أَلْسِنَتُهُمْ أَنْزَلَ اللَّهُ تَعَالَى فِي إِثْرِهَا: {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ} الْآيَةَ كُلَّهَا، وَنَسَخَهَا اللَّهُ تَعَالَى فَأَنْزَلَ اللَّهُ: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا} الْآيَةَ إِلَى آخِرِهَا. رَوَاهُ مُسْلِمٌ عَنْ أُمَيَّةَ بْنِ بِسْطَامٍ.</p><p>(٢) - أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بن يحيى قال: حدثنا والدي قال: حَدَّثَنَا مُحَمَّدُ بْنُ إسحاق الثقفي قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ وَيُوسُفُ بْنُ موسى قالا: أخبرنا وكيع قال: حَدَّثَنَا سُفْيَانُ عَنْ آدَمَ بْنِ سُلَيْمَانَ قَالَ: سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ: {وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ} دَخَلَ قُلُوبَهُمْ مِنْهَا شَيْءٌ، لَمْ يَدْخُلْهُ مِنْ شَيْءٍ فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"قُولُوا سَمِعْنَا وَأَطَعْنَا وَسَلَّمْنَا\". فَأَلْقَى اللَّهُ تَعَالَى الْإِيمَانَ فِي قُلُوبِهِمْ، فَقَالُوا: سَمِعْنَا وَأَطَعْنَا فَأَنْزَلَ اللَّهُ تَعَالَى: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا} حَتَّى بَلَغَ {أَوْ أَخْطَأْنَا} فَقَالَ: \"قَدْ فَعَلْتُ\" إِلَى آخِرِ الْبَقَرَةِ، كُلُّ ذَلِكَ يَقُولُ:\"قَدْ فَعَلْتُ\" رَوَاهُ مُسْلِمٌ عَنْ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ عَنْ وَكِيعٍ.قَالَ الْمُفَسِّرُونَ: لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ: {وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ} جَاءَ أَبُو بَكْرٍ وَعُمَرُ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَمُعَاذُ بْنُ جَبَلٍ وَنَاسٌ مِنَ الْأَنْصَارِ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَجَثَوْا عَلَى الرُّكَبِ وَقَالُوا: يَا رَسُولَ اللَّهِ وَاللَّهِ مَا نَزَلَتْ آيَةٌ أَشَدُّ عَلَيْنَا مِنْ هَذِهِ الْآيَةِ، إِنَّ أَحَدَنَا لَيُحِدِّثُ نَفْسَهُ بِمَا لَا يُحِبُّ أَنْ يَثْبُتَ فِي قَلْبِهِ وَأَنَّ له الدنيا وما فيها وإنا لمؤاخذون بِمَا نُحَدِّثُ بِهِ أَنْفُسَنَا هَلَكْنَا وَاللَّهِ فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"هَكَذَا أُنْزِلَتْ\" فَقَالُوا: هَلَكْنَا وَكُلِّفْنَا مِنَ الْعَمَلِ مَا لَا نُطِيقُ قَالَ: \"فَلَعَلَّكُمْ تقولون كما قال بَنُو إِسْرَائِيلَ لِمُوسَى: سَمِعْنَا وَعَصَيْنَا، قُولُوا: سَمِعْنَا وَأَطَعْنَا\" فَقَالُوا: سَمِعْنَا وَأَطَعْنَا وَاشْتَدَّ ذَلِكَ عَلَيْهِمْ، فَمَكَثُوا بِذَلِكَ حَوْلًا فَأَنْزَلَ اللَّهُ تَعَالَى الْفَرَجَ وَالرَّاحَةَ بِقَوْلِهِ: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا} الْآيَةَ، فَنَسَخَتْ هَذِهِ الْآيَةُ مَا قَبْلَهَا، قَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"إِنَّ اللَّهَ قَدْ تَجَاوَزَ لِأُمَّتِي مَا حَدَّثُوا بِهِ أَنْفُسَهُمْ مَا لَمْ يَعْمَلُوا أَوْ يَتَكَلَّمُوا بِهِ\".</p><p>(١) - أخرجه مسلم (١/١١٥ - ح: ١٢٥) والإمام أحمد (الفتح الرباني: ١٨/٩٥ - ح: ٢٠١) وابن جرير (٣/٩٥) وأبو داود في ناسخه وابن المنذر وابن أبي حاتم (فتح القدير: ١/٣٠٥) عن أبي هريرة رضي الله عنه به. ويشهد له: الرواية الآتية:.</p><p>(٢) - أخرجه مسلم (١/١١٦ - ح ١٢٦) والإمام أحمد (الفتح الرباني: ١٨/٩٧ -: ٢٠٢) وابن جرير (٣/٩٥) والترمذي (٥/٢٢١ - ح: ٢٩٩٢) والنسائي وابن المنذر والبيهقي (فتح القدير: ١/٣٠٦) (جامع الأصول: ٢/٦١) والحاكم (المستدرك: ٢/٢٨٦) عن ابن عباس رضي الله عنهما به ويشهد لهما:</p><p>١ - ما أخرجه الإمام أحمد (الفتح الرباني: ١٨/٩٧ - ح: ٢٠٣) وابن جرير (٣/٩٦) وابن المنذر (الفتح الرباني: ١٨/٩٧) من طريق حميد الأعرج عن مجاهد عن ابن عباس رضي الله عنهما نحوه. وصححه ابن كثير (تفسير ابن كثير: ١/٣٣٩) والشيخ أحمد البنا (الفتح الرباني ١٨/٩٧) .</p><p>٢ - ما أخرجه ابن جرير (٣/٩٥) من طريق الزهري عن سالم بن عبد الله بن عمر عن ابن عباس رضي الله عنهما بمعناه. وصححه الحافظ ابن كثير (تفسير ابن كثير: ١/٣٣٩) .</p>"
  },
  {
    "id": 79,
    "sura": 3,
    "aya": 12,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {قُلْ لِلَّذِينَ كَفَرُوا سَتُغْلَبُونَ} الْآيَةَ {١٢} .<p/><p>قَالَ الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ: أَنَّ يَهُودَ أَهْلِ الْمَدِينَةِ قَالُوا لَمَّا هَزَمَ اللَّهُ الْمُشْرِكِينَ يَوْمَ بَدْرٍ: هَذَا وَاللَّهِ النَّبِيُّ الْأُمِّيُّ الَّذِي بَشَّرَنَا بِهِ مُوسَى، وَنَجِدُهُ فِي كِتَابِنَا بِنَعْتِهِ وَصِفَتِهِ، وَإِنَّهُ لَا تُرَدُّ لَهُ رَايَةٌ، فَأَرَادُوا تَصْدِيقَهُ وَاتِّبَاعَهُ، ثُمَّ قَالَ بَعْضُهُمْ لِبَعْضٍ: لَا تَعْجَلُوا حَتَّى نَنْظُرَ إِلَى وَقْعَةٍ لَهُ أُخْرَى فَلَمَّا كَانَ يَوْمُ أُحُدٍ وَنُكِبَ أَصْحَابُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - شَكُّوا، وَقَالُوا: لَا وَاللَّهِ مَا هُوَ بِهِ، وَغَلَبَ عَلَيْهِمُ الشَّقَاءُ فَلَمْ يُسْلِمُوا، وَكَانَ بَيْنَهُمْ وَبَيْنَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَهْدٌ إِلَى مُدَّةٍ، فَنَقَضُوا ذَلِكَ الْعَهْدَ، وَانْطَلَقَ كَعْبُ بْنُ الْأَشْرَفِ فِي سِتِّينَ رَاكِبًا إِلَى أَهْلِ مَكَّةَ أَبِي سُفْيَانَ وَأَصْحَابِهِ فَوَافَقُوهُمْ وَأَجْمَعُوا أَمْرَهُمْ، وَقَالُوا: لَتَكُونَنَّ كَلِمَتُنَا وَاحِدَةً، ثُمَّ رَجَعُوا إِلَى الْمَدِينَةِ، فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِمْ هَذِهِ الْآيَةَ.<p/><p>(٢) - وَقَالَ مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ يَسَارٍ: لَمَّا أَصَابَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قُرَيْشًا بِبَدْرٍ، فَقَدِمَ الْمَدِينَةَ جمع اليهود وقال: يَا مَعْشَرَ الْيَهُودِ احْذَرُوا مِنَ اللَّهِ مِثْلَ مَا نَزَلَ بِقُرَيْشٍ يَوْمَ بَدْرٍ، وَأَسْلِمُوا قَبْلَ أَنْ يَنْزِلَ بِكُمْ مَا نَزَلَ بِهِمْ، فَقَدْ عَرَفْتُمْ أَنِّي نَبِيٌّ مُرْسَلٌ، تَجِدُونَ ذَلِكَ فِي كِتَابِكُمْ وَعَهْدِ اللَّهِ إِلَيْكُمْ، فَقَالُوا: يَا مُحَمَّدُ، لَا يَغُرَّنَّكَ أَنَّكَ لَقِيتَ قَوْمًا أَغْمَارًا لَا عِلْمَ لَهُمْ بِالْحَرْبِ، فَأَصَبْتَ فِيهِمْ فُرْصَةً، أَمَا وَاللَّهِ لَوْ قَاتَلْنَاكَ لَعَرَفْتَ أَنَّا نَحْنُ النَّاسُ، فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلْ لِلَّذِينَ كَفَرُوا} يَعْنِي الْيَهُودَ {سَتُغْلَبُونَ} تُهْزَمُونَ {وَتُحْشَرُونَ إِلَى جَهَنَّمَ}فِي الْآخِرَةِ، هذه رِوَايَةُ عِكْرِمَةَ وَسَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ.<p/><p>(١) - قد علمت فيما سبق قيمة هذه الرواية وأنها موضوعة.</p><p>(٢) - أخرجه ابن جرير (٣/١٢٨) وأبو داود (٣/٤٠٢ - ح: ٣٠٠١) والبيهقي (دلائل النبوة: ٣/١٧٣) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما به. وسنده حسن.</p>"
  },    {
    "id": 80,
    "sura": 3,
    "aya":18 ,
    "text": "<p>قَوْلُهُ تَعَالَى: {شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ} {١٨} .</p><p>قَالَ الْكَلْبِيُّ: لَمَّا ظَهَرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِالْمَدِينَةِ قَدِمَ عَلَيْهِ حَبْرَانِ مِنْ أَحْبَارِ أَهْلِ الشَّامِ، فَلَمَّا أَبْصَرَا الْمَدِينَةَ، قَالَ أَحَدُهُمَا لِصَاحِبِهِ: مَا أَشْبَهَ هَذِهِ الْمَدِينَةَ بِصِفَةِ مَدِينَةِ النَّبِيِّ الَّذِي يَخْرُجُ فِي آخِرِ الزَّمَانِ، فَلَمَّا دَخَلَا عَلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَرَفَاهُ بِالصِّفَةِ وَالنَّعْتِ، فَقَالَا لَهُ: أَنْتَ مُحَمَّدٌ؟ قَالَ: \"نَعَمْ\"، قَالَا: وَأَنْتَ أَحْمَدُ؟ قَالَ: \"نَعَمْ\"، قَالَا: إِنَّا نَسْأَلُكَ عَنْ شَهَادَةٍ، فَإِنْ أَنْتَ أَخْبَرْتَنَا بِهَا آمَنَّا بِكَ وَصَدَّقْنَاكَ، فَقَالَ لَهُمَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"سَلَانِي\"، فَقَالَا: أَخْبِرْنَا عَنْ أَعْظَمِ شَهَادَةٍ فِي كِتَابِ اللَّهِ فَأَنْزَلَ اللَّهُ تَعَالَى عَلَى نَبِيِّهِ: {شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ} فَأَسْلَمَ الرجلان وصدّقا برسول اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - .</p>"
  },    {
    "id": 81,
    "sura":3 ,
    "aya": 23,
    "text": "<p>قَوْلُهُ تَعَالَى: {أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ} الْآيَةَ {٢٣} .</p><p>اخْتَلَفُوا فِي سَبَبِ نُزُولِهَا، فَقَالَ السُّدِّيُّ: دَعَا النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الْيَهُودَ إِلَى الْإِسْلَامِ فَقَالَ لَهُ النُّعْمَانُ ابن أَوْفَى: هَلُمَّ يَا مُحَمَّدُ نُخَاصِمْكَ إِلَى الْأَحْبَارِ، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"بَلْ إِلَى كِتَابِ اللَّهِ\"، فَقَالَ: بَلْ إِلَى الْأَحْبَارِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - وَرَوَى سَعِيدُ بْنُ جُبَيْرٍ وَعِكْرِمَةُ عَنِ ابْنِ عَبَّاسٍ قَالَ: دَخَلَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَيْتَ الْمِدْرَاسِ عَلَى جَمَاعَةٍ مِنَ الْيَهُودِ، فَدَعَاهُمْ إِلَى اللَّهِ، فَقَالَ لَهُ نُعَيْمُ بْنُ عَمْرٍو وَالْحَارِثُ بْنُ زَيْدٍ: عَلَى أَيِّ دِينٍ أَنْتَ يَا مُحَمَّدُ؟ فَقَالَ:\"عَلَى مِلَّةِ إِبْرَاهِيمَ\"، قَالَا: إِنَّ إِبْرَاهِيمَ كَانَ يَهُودِيًّا. فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"فَهَلُمُّوا إِلَى التوراة فهي بينا وَبَيْنَكُمْ فَأَبَيَا عَلَيْهِ\"، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>وَقَالَ الْكَلْبِيُّ: نَزَلَتْ فِي قِصَّةِ اللَّذِينَ زَنَيَا مِنْ خَيْبَرَ، وسؤال اليهود للنبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَنْ حَدِّ الزَّانِيَيْنِ، وَسَيَأْتِي بَيَانُ ذَلِكَ فِي سُورَةِ الْمَائِدَةِ إِنْ شَاءَ اللَّهُ تَعَالَى.</p><p>(١) - أسنده ابن جرير (٣/١٤٥) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٢٢٩) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما به، وسنده حسن.</p>"
  },    {
    "id": 82,
    "sura":3 ,
    "aya": 26,
    "text": "<p>قَوْلُهُ تَعَالَى: {قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ} الْآيَةَ {٢٦} .</p><p>قَالَ ابْنُ عَبَّاسٍ وَأَنَسُ بْنُ مَالِكٍ: لَمَّا فَتَحَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مَكَّةَ وَوَعَدَ أُمَّتَهُ مُلْكَ فَارِسَ وَالرُّومِ، قَالَتِ الْمُنَافِقُونَ وَالْيَهُودُ: هَيْهَاتَ هَيْهَاتَ، مِنْ أَيْنَ لِمُحَمَّدٍ مُلْكُ فَارِسَ وَالرُّومِ هم أَعَزُّ وَأَمْنَعُ مِنْ ذَلِكَ، أَلَمْ يكفِ محمدًا مكبة وَالْمَدِينَةَ حَتَّى طَمِعَ فِي مُلْكِ فَارِسَ وَالرُّومِ؟! فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ الْمَرْوَزِيُّ فِي كِتَابِهِ، أَخْبَرَنَا أَبُو الْفَضْلِ مُحَمَّدُ بْنُ الْحُسَيْنِ الْحَدَّادِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ قَالَ: ذُكِرَ لَنَا أَنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - سَأَلَ رَبَّهُ أَنْ يَجْعَلَ مُلْكَ فَارِسَ وَالرُّومِ فِي أُمَّتِهِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ} الْآيَةَ.(٢) - حَدَّثَنَا الْأُسْتَاذُ أَبُو إِسْحَاقَ الثَّعَالِبِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ حَامِدٍ الْوَزَّانُ، أَخْبَرَنَا مُحَمَّدُ بْنُ جعفر المطيري قال: قال حَمَّادُ بْنُ الْحَسَنِ: حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَثْمَةَ، حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، حَدَّثَنِي أَبِي عَنْ أَبِيهِ قَالَ: خَطَّ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَلَى الْخَنْدَقِ يَوْمَ الْأَحْزَابِ، ثم قطع كل عَشَرَةٍ أَرْبَعِينَ ذِرَاعًا، قَالَ عَمْرُو بْنُ عَوْفٍ: كُنْتُ أَنَا وَسَلْمَانُ وَحُذَيْفَةُ وَالنُّعْمَانُ بْنُ مُقَرِّنٍ الْمُزَنِيُّ وَسِتَّةٌ مِنَ الْأَنْصَارِ فِي أَرْبَعِينَ ذِرَاعًا، فَحَفَرْنَا حَتَّى إِذَا كنا تحت ذي ناب، أَخْرَجَ اللَّهُ مِنْ بَطْنِ الْخَنْدَقِ صَخْرَةً مَرْوَةً كَسَرَتْ حَدِيدَنَا وَشَقَّتْ عَلَيْنَا،فَقُلْنَا: يَا سَلْمَانُ ارْقَ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَخْبِرْهُ خَبَرَ هَذِهِ الصَّخْرَةِ، فَإِمَّا أَنْ نَعْدِلَ عَنْهَا، وَإِمَّا أَنْ يَأْمُرَنَا فِيهَا بِأَمْرِهِ، فَإِنَّا لَا نُحِبُّ أَنْ نُجَاوِزَ خَطَّهُ، قَالَ: فَرَقِيَ سَلْمَانُ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَهُوَ ضَارِبٌ عَلَيْهِ قُبَّةً تُرْكِيَّةً، فَقَالَ: يَا رَسُولَ اللَّهِ خَرَجَتْ صَخْرَةٌ بَيْضَاءُ مَرْوَةٌ مِنْ بَطْنِ الْخَنْدَقِ فَكَسَرَتْ حَدِيدَنَا وَشَقَّتْ عَلَيْنَا حَتَّى مَا يَحِيكُ فِيهَا قَلِيلٌ وَلَا كَثِيرٌ، فمرنا فيها بأمر، فَإِنَّا لَا نُحِبُّ أَنْ نُجَاوِزَ خَطَّكَ، قَالَ: فَهَبَطَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مَعَ سَلْمَانَ الْخَنْدَقَ وَالتِّسْعَةُ عَلَى شَفَةِ الْخَنْدَقِ، فَأَخَذَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الْمِعْوَلَ مِنْ سَلْمَانَ فَضَرَبَهَا ضَرْبَةً صَدَّعَهَا، وَبَرَقَ مِنْهَا بَرْقٌ أَضَاءَ مَا بَيْنَ لَابَتَيْهَا، يَعْنِي المدينة، حتى كأن مِصْبَاحًا فِي جَوْفِ بَيْتٍ مُظْلِمٍ، وَكَبَّرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - تكبير فتح، وكبَّر الْمُسْلِمُونَ، ثُمَّ ضَرَبَهَا رَسُولُ الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الثانية فكسرها، وَبَرَقَ مِنْهَا بَرْقٌ أَضَاءَ ما بين لابيتها حتى كأن مِصْبَاحًا فِي جَوْفِ بَيْتٍ مُظْلِمٍ، وَكَبَّرَ رسول الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - تكبير فتح، وكبَّر الْمُسْلِمُونَ، ثُمَّ ضَرَبَهَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَبَرَقَ مِنْهَا بَرْقٌ أَضَاءَ ما بين لابيتها، حتى كأن مِصْبَاحًا فِي جَوْفِ بَيْتٍ مُظْلِمٍ، وَكَبَّرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - تَكْبِيرَ فَتْحٍ وَكَبَّرَ المسلمون، وأخذ يد سَلْمَانَ وَرَقِيَ، فَقَالَ سَلْمَانُ: بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ، لَقَدْ رَأَيْتُ شَيْئًا مَا رَأَيْتُ مِثْلَهُ قَطُّ، فَالْتَفَتَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى الْقَوْمِ فَقَالَ: \"رَأَيْتُمْ مَا يَقُولُ سَلْمَانُ؟ \"، قَالُوا: نَعَمْ يَا رَسُولَ اللَّهِ، قَالَ: \"ضَرَبْتُ ضَرْبَتِي الْأُولَى فَبَرَقَ الَّذِي رَأَيْتُمْ أَضَاءَتْ لِي مِنْهَا قُصُورُ الْحِيرَةِ وَمَدَائِنُ كِسْرَى كَأَنَّهَا أَنْيَابُ الْكِلَابِ، وَأَخْبَرَنِي جِبْرِيلُ عَلَيْهِ السَّلَامُ أَنَّ أُمَّتِي ظَاهِرَةٌ عَلَيْهَا، ثُمَّ ضَرَبْتُ ضَرْبَتِي الثَّانِيَةَ فَبَرَقَ الَّذِي رَأَيْتُمْ، أَضَاءَتْ لِي مِنْهَا الْقُصُورُ الْحُمْرُ مِنْ أَرْضِ الرُّومِ كَأَنَّهَا أَنْيَابُ الْكِلَابِ، وَأَخْبَرَنِي جِبْرِيلُ عَلَيْهِ السَّلَامُ أَنَّ أُمَّتِي ظَاهِرَةٌ عَلَيْهَا، ثُمَّ ضَرَبْتُ ضَرْبَتِي الثَّالِثَةَ فَبَرَقَ الَّذِي رَأَيْتُمْ أَضَاءَتْ لِي مِنْهَا قُصُورُ صَنْعَاءَ كَأَنَّهَا أَنْيَابُ الْكِلَابِ. وَأَخْبَرَنِي جِبْرِيلُ عَلَيْهِ السَّلَامُ أَنَّ أُمَّتِي ظَاهِرَةٌ عَلَيْهَا، فَأَبْشِرُوا\"، فَاسْتَبْشَرَ الْمُسْلِمُونَ وَقَالُوا: الْحَمْدُ لِلَّهِ مَوْعِدُ صِدْقٍ وَعَدَنَا النَّصْرَ بَعْدَ الْحَفْرِ، فَقَالَالْمُنَافِقُونَ: أَلَا تَعْجَبُونَ يُمَنِّيكُمْ وَيَعِدُكُمُ الْبَاطِلَ، وَيُخْبِرُكُمْ أَنَّهُ يُبْصِرُ مِنْ يَثْرِبَ قُصُورَ الْحِيرَةِ وَمَدَائِنَ كِسْرَى وَأَنَّهَا تُفْتَحُ لَكُمْ، وَأَنْتُمْ إِنَّمَا تَحْفِرُونَ الْخَنْدَقَ مِنَ الْفَرَقِ، وَلَا تَسْتَطِيعُونَ أَنْ تَبْرُزُوا؟ قَالَ: فَنَزَلَ الْقُرْآنُ: {وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلا غُرُورًا} [الأحزاب: ١٢] . وَأَنْزَلَ اللَّهُ تَعَالَى فِي هَذِهِ الْقِصَّةِ قَوْلَهُ: {قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ} الْآيَةَ.</p><p>(١) - إسناده صحيح، وأخرجه ابن جرير (٣/١٤٨) وابن أبي حاتم وعبد بن حميد (فتح القدير: ١/٣٣٠) من وجه آخر به، وهو مرسل صحيح الإسناد.</p><p>(٢) - أخرجه ابن جرير (٢١/٨٥) وابن أبي حاتم (لباب النقول: ١٧٢) والبيهقي في الدلائل (٣/٤١٨) من طريق كثير بن عبد الله به وإسناده ضعيف، لضعف كثير (تقريب التهذيب: ٢/١٣٢ - رقم: ١٧) .</p>"
  },    {
    "id": 83,
    "sura": 3,
    "aya":28 ,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَا يَتَّخِذِ الْمُؤْمِنُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ} {٢٨} .قَالَ ابْنُ عَبَّاسٍ: كَانَ الْحَجَّاجُ بْنُ عَمْرٍو وَكَهْمَسُ بْنُ أَبِي الْحُقَيْقِ وَقَيْسِ بْنِ زَيْدٍ - وَهَؤُلَاءِ كَانُوا مِنَ الْيَهُودِ يُبَاطِنُونَ نَفَرًا مِنَ الْأَنْصَارِ لِيَفْتِنُوهُمْ عَنْ دِينِهِمْ - فَقَالَ رِفَاعَةُ ابن الْمُنْذِرِ وَعَبْدُ اللَّهِ بْنُ جُبَيْرٍ وَسَعِيدُ بْنُ خَيْثَمَةَ لِأُولَئِكَ النَّفَرِ: اجْتَنِبُوا هَؤُلَاءِ الْيَهُودَ وَاحْذَرُوا لُزُومَهُمْ وَمُبَاطَنَتَهُمْ لَا يَفْتِنُوكُمْ عَنْ دِينِكُمْ، فَأَبَى أُولَئِكَ النَّفَرُ إِلَّا مُبَاطَنَتَهُمْ وَمُلَازَمَتَهُمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.وَقَالَ الْكَلْبِيُّ: نَزَلَتْ فِي الْمُنَافِقِينَ: عَبْدِ اللَّهِ بْنِ أُبَيٍّ وَأَصْحَابِهِ، كَانُوا يَتَوَلَّوْنَ الْيَهُودَ وَالْمُشْرِكِينَ وَيَأْتُونَهُمْ بِالْأَخْبَارِ وَيَرْجُونَ أَنْ يَكُونَ لَهُمُ الظَّفَرُ عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ، وَنَهَى الْمُؤْمِنِينَ عَنْ مِثْلِ فِعْلِهِمْ.</p><p>(٢) - وَقَالَ جُوَيْبِرٌ عَنِ الضَّحَّاكِ عَنِ ابْنِ عَبَّاسٍ: نَزَلَتْ فِي عُبَادَةَ بْنِ الصَّامِتِ الْأَنْصَارِيِّ وَكَانَ بَدْرِيًّا نَقِيبًا، وَكَانَ لَهُ حُلَفَاءُ مِنَ الْيَهُودِ، فَلَمَّا خَرَجَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يَوْمَالْأَحْزَابِ. قَالَ عُبَادَةُ: يَا نَبِيَّ اللَّهِ إِنَّ مَعِي خَمْسَمِائَةِ رَجُلٍ مِنَ الْيَهُودِ، وَقَدْ رَأَيْتُ أَنْ يَخْرُجُوا مَعِي فَأَسْتَظْهِرُ بِهِمْ عَلَى الْعَدُوِّ، فَأَنْزَلَ اللَّهُ تَعَالَى: {لَا يَتَّخِذِ الْمُؤْمِنُونَ الْكَافِرِينَ أَوْلِيَاءَ} الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (٢/١٥٢) وابن أبي حاتم (فتح القدير: ١/٣٣٢) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما به، وإسناده حسن.</p><p>(٢) - هذه الرواية - فضلاً عمن أخرجها - ضعيفة جدًا بسبب جويبر، ومنقطعة أيضًا؛ لأن الضحاك لم يلق ابن عباس.</p>"
  },    {
    "id": 84,
    "sura": 3,
    "aya": 31,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {قُلْ إِنْ كُنْتُمْ تُحِبُّونَ} الْآيَةَ {٣١} .قَالَ الْحَسَنُ وَابْنُ جُرَيْجٍ: زَعَمَ أَقْوَامٌ عَلَى عَهْدِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَنَّهُمْ يُحِبُّونَ اللَّهَ، فَقَالُوا: يَا مُحَمَّدُ إِنَّا نُحِبُّ رَبَّنَا فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(٢) - وَرَوَى جُوَيْبِرٌ عَنِ الضَّحَّاكِ عَنِ ابْنِ عَبَّاسٍ قَالَ: وَقَفَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَلَى قُرَيْشٍ وَهُمْ فِي الْمَسْجِدِ الْحَرَامِ، وَقَدْ نَصَبُوا أَصْنَامَهُمْ وَعَلَّقُوا عَلَيْهَا بَيْضَ النَّعَامِ، وَجَعَلُوا فِي آذَانِهَا الشُّنُوفَ وَالْقِرَطَةَ، وَهُمْ يَسْجُدُونَ لَهَا، فَقَالَ: \"يَا مَعْشَرَ قُرَيْشٍ لَقَدْ خَالَفْتُمْ مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ وَإِسْمَاعِيلَ، وَلَقَدْ كَانَا عَلَى الْإِسْلَامِ\"، فَقَالَتْ قُرَيْشٌ: يَا مُحَمَّدُ إِنَّمَا نَعْبُدُ هَذِهِ حُبًّا لِلَّهِ لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى، فَأَنْزَلَ اللَّهُ تَعَالَى: {قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ} وَتَعْبُدُونَ الْأَصْنَامَ لِتُقَرِّبَكُمْ إِلَيْهِ {فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ} \"فَأَنَا رَسُولُهُ إِلَيْكُمْ وَحُجَّتُهُ عَلَيْكُمْ، وَأَنَا أَوْلَى بِالتَّعْظِيمِ مِنْ أَصْنَامِكُمْ.(٣) - وَرَوَى الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ: أَنَّ الْيَهُودَ لَمَّا قَالُوا: نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ، أَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ؛ فَلَمَّا نَزَلَتْ عَرَضَهَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - عَلَى الْيَهُودِ، فَأَبَوْا أَنْ يَقْبَلُوهَا.وَرَوَى مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ يَسَارٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ قَالَ: نَزَلَتْ فِي نَصَارَى نَجْرَانَ، وَذَلِكَ أَنَّهُمْ قَالُوا: إِنَّمَا نُعَظِّمُ الْمَسِيحَ وَنَعْبُدُهُ حُبًّا لِلَّهِ وَتَعْظِيمًا لَهُ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ رَدًّا عَلَيْهِمْ.</p><p>(١) - أخرجه ابن جرير (٣/١٥٥) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٣٣٣) من طريق بكر بن الأسود عن الحسن به. وإسناده ضعيف جدًا بسبب بكر (ميزان الاعتدال: ١/٣٤٢ - رقم: ١٢٧١) وضعف الإمام ابن جرير هذا السبب (تفسير ابن جرير: ٣/١٥٦) .</p><p>(٢) - قد مرّ ضعف هذين السببين بل هلاكهما.</p><p>(٣) - قد مرّ ضعف هذين السببين بل هلاكهما.</p>"
  },    {
    "id": 85,
    "sura": 3,
    "aya":59 ,
    "text": "<p>قَوْلُهُ تَعَالَى: {إِنَّ مَثَلَ عِيسَى عِنْدَ اللَّهِ} الْآيَةَ {٥٩} .قَالَ الْمُفَسِّرُونَ: إِنَّ وَفْدَ نَجْرَانَ قَالُوا لِرَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مَا لَكَ تَشْتُمُ صَاحِبَنَا؟ قَالَ: \"وَمَا أَقُولُ؟ \" قَالُوا: تَقُولُ: إِنَّهُ عَبْدٌ، قَالَ: \"أَجَلْ إِنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ وَكَلِمَتُهُ أَلْقَاهَا إِلَى الْعَذْرَاءِ الْبَتُولِ\"، فَغَضِبُوا وَقَالُوا: هَلْ رَأَيْتَ إِنْسَانًا قَطُّ مِنْ غَيْرِ أَبٍ؟ فَإِنْ كُنْتَ صَادِقًا فَأَرِنَا مِثْلَهُ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - هَذِهِ الْآيَةَ.(١) - أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ محمد الحارثي قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ جَعْفَرٍ، أَخْبَرَنَا أَبُو يَحْيَى الرَّازِيُّ، أَخْبَرَنَا سَهْلُ بْنُ عُثْمَانَ، أَخْبَرَنَا يَحْيَى وَوَكِيعٌ، عَنْ مُبَارَكٍ، عَنِ الْحَسَنِ قَالَ: جَاءَ رَاهِبَا نَجْرَانَ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَعَرَضَ عَلَيْهِمَا الْإِسْلَامَ، فَقَالَ أَحَدُهُمَا: إِنَّا قَدْ أَسْلَمْنَا قَبْلَكَ، فَقَالَ: \"كَذَبْتُمَا إِنَّهُ يمنعكما من الْإِسْلَامِ ثَلَاثَةٌ: عِبَادَتُكُمُ الصَّلِيبَ، وَأَكْلُكُمُ الْخِنْزِيرَ، وَقَوْلُكُمْ لِلَّهِ وَلَدٌ\"؛ قَالَا: مَنْ أَبُو عِيسَى؟ وَكَانَ لَا يَعْجَلُ حَتَّى يَأْمُرَهُ رَبُّهُ، فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ مَثَلَ عِيسَى} الْآيَةَ.(٢) - قَوْلُهُ تَعَالَى: {فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ} الْآيَةَ، {٦١} .أَخْبَرَنَا أَبُو سَعْدٍ عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الزِّمْجَارِيُّ، أَخْبَرَنَا أَحْمَدُ بْنُ جَعْفَرِ بْنِ مَالِكٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ حَنْبَلٍ، حَدَّثَنَا أبي قال: حَدَّثَنَا حسين قال: حَدَّثَنَا حَمَّادُ بْنُسَلَمَةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ قَالَ: جَاءَ رَاهِبَا نَجْرَانَ إِلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ لَهُمَا: \"أَسْلِمَا تَسْلَمَا\"، فَقَالَا: قَدْ أَسْلَمْنَا قَبْلَكَ، فَقَالَ: \"كَذَبْتُمَا، يَمْنَعُكُمَا مِنَ الْإِسْلَامِ ثَلَاثٌ: سُجُودُكُمَا لِلصَّلِيبِ، وَقَوْلُكُمَا اتَّخَذَ اللَّهُ وَلَدًا وَشُرْبُكُمَا الْخَمْرَ\"، فَقَالَا: مَا تَقُولُ فِي عِيسَى؟ قَالَ: فَسَكَتَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَنَزَلَ الْقُرْآنُ: {ذَلِكَ نَتْلُوهُ عَليْكَ مِنَ الْآيَاتِ وَالذِّكْرِ الْحَكِيمِ} إِلَى قَوْلِهِ: {فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ} الْآيَةَ، فَدَعَاهُمَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى الْمُلَاعَنَةِ، وَجَاءَ بِالْحَسَنِ وَالْحُسَيْنِ وَفَاطِمَةَ وَأَهْلِهِ وَوَلَدِهِ عَلَيْهِمُ السَّلَامُ، قَالَ: فَلَمَّا خَرَجَا مِنْ عِنْدِهِ قال أحدهما لصاحبه: أَقْرِرْ بِالْجِزْيَةِ وَلَا تُلَاعِنْهُ، فَأَقَرَّ بِالْجِزْيَةِ، قَالَ: فَرَجَعَا فَقَالَا: نُقِرُّ بِالْجِزْيَةِ وَلَا نُلَاعِنُكَ فَأَقَرَّا بِالْجِزْيَةِ.(٣) - أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الْحَسَنِ الْحَافِظُ فِيمَا أَذِنَ لِي فِي رِوَايَتِهِ حَدَّثَنَا أَبُو حَفْصٍ عُمَرُ بْنُ أَحْمَدَ الْوَاعِظُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ بْنِ الْأَشْعَثِ، حَدَّثَنَا يَحْيَى بْنُ حَاتِمٍ الْعَسْكَرِيُّ، حَدَّثَنَا بِشْرُ بْنُ مِهْرَانَ، حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: قَدِمَ وَفْدُ أَهْلِ نَجْرَانَ عَلَى النَّبِيِّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - الْعَاقِبُ وَالسَّيِّدُ، فَدَعَاهُمَا إِلَى الْإِسْلَامِ، فَقَالَا: أَسْلَمْنَا قَبْلَكَ، قَالَ: \"كَذَبْتُمَا إِنْ شِئْتُمَا أَخْبَرْتُكُمَا بِمَا يَمْنَعُكُمَا مِنَ الْإِسْلَامِ؟ \" فَقَالَا: هَاتِ أَنْبِئْنَا، قَالَ: \"حُبُّ الصَّلِيبِ، وَشُرْبُ الْخَمْرِ، وَأَكْلُ لَحْمِ الْخِنْزِيرِ\"، فَدَعَاهُمَا إِلَى الْمُلَاعَنَةِ، فَوَعَدَاهُ عَلَى أَنْ يُغَادِيَاهُ بِالْغَدَاةِ فَغَدَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَخَذَ بِيَدِ عَلِيٍّ وَفَاطِمَةَ وَبِيَدِ الْحَسَنِ وَالْحُسَيْنِ، ثُمَّ أَرْسَلَ إِلَيْهِمَا فَأَبَيَا أَنْ يُجِيبَا، فَأَقَرَّا لَهُ بِالْخَرَاجِ، فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"وَالَّذِي بَعَثَنِي بِالْحَقِّ لَوْ فَعَلَا لَمُطِرَ الْوَادِي نَارًا\".قَالَ جَابِرٌ: فَنَزَلَتْ فِيهِمْ هَذِهِ الْآيَةُ: {فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ وَنِسَاءَنَا وَنِسَاءَكُمْ وَأَنْفُسَنَا وَأَنْفُسَكُمْ} قَالَ الشَّعْبِيُّ: أَبْنَاءَنَا: الْحَسَنَ وَالْحُسَيْنَ، وَنِسَاءَنَا: فَاطِمَةَ، وَأَنْفُسَنَا عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُمْ.</p><p>(١) - إسناده ضعيف، بسبب عنعنة مبارك بن فضالة وهو مدلّس (تهذيب التهذيب: ١٠/٢٨ - رقم: ٥٠) لكن يتقوى بشواهده، وهي الروايتان الآتيتان.</p><p>(٢) - مرسل صحيح الإسناد.<p></p>(٣) - أخرجه الحاكم (المستدرك: ٢/٥٩٣، ٥٩٤) وابن مردويه وأبو نعيم (فتح القدير: ١/٣٤٧) من طريق داود به وإسناده صحيح. فبهذه الروايات يثبت سبب نزول الآيتين بحمد الله تعالى. وأصل قصة الملاعنة في صحيح البخاري (فتح الباري: ٨/٩٣ - ح: ٤٣٨٠) ومسند الإمام أحمد (الفتح الرباني: ٢٢/٣٩٣ - ح: ٤٠٤) عن حذيفة رضي الله عنه.</p>"
  },    {
    "id": 86,
    "sura": 3,
    "aya": 68,
    "text": "<p>قَوْلُهُ تَعَالَى: {إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَهَذَا النَّبِيُّ} الْآيَةَ {٦٨} .</p><p>قَالَ ابْنُ عَبَّاسٍ: قَالَ رُؤَسَاءُ الْيَهُودِ: وَاللَّهِ يَا مُحَمَّدُ لَقَدْ عَلِمْتَ أَنَّا أَوْلَى بِدِينِ إِبْرَاهِيمَ مِنْكَ وَمِنْ غَيْرِكَ، وَأَنَّهُ كَانَ يَهُودِيًّا، وَمَا بِكَ إِلَّا الْحَسَدُ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.وَرَوَى الْكَلْبِيُّ عَنْ أَبِي صَالِحٍ عَنِ ابْنِ عَبَّاسٍ، وَرَوَى أَيْضًا عَبْدُ الرَّحْمَنِ بْنُ غَنْمٍ عَنْ أَصْحَابِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَذَكَرَهُ مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ يَسَارٍ، وَقَدْ دَخَلَ حَدِيثُ بَعْضِهِمْ فِي بَعْضٍ قَالُوا: لَمَّا هَاجَرَ جَعْفَرُ بْنُ أَبِي طَالِبٍ وَأَصْحَابُهُ إِلَى الْحَبَشَةِ، وَاسْتَقَرَّتْ بِهِمُ الدَّارُ، وَهَاجَرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى الْمَدِينَةِ، وَكَانَ مِنْ أَمْرِ بَدْرٍ مَا كَانَ، اجْتَمَعَتْ قُرَيْشٌ فِي دَارِ النَّدْوَةِ وَقَالُوا: إِنَّ لَنَا فِي أَصْحَابِ مُحَمَّدٍ الَّذِينَ عِنْدَ النَّجَاشِيِّ ثَأْرًا بِمَنْ قُتِلَ مِنْكُمْ بِبَدْرٍ، فَاجْمَعُوا مَالًا وَأَهْدُوهُ إِلَى النَّجَاشِيِّ لَعَلَّهُ يَدْفَعُ إِلَيْكُمْ مَنْ عِنْدَهُ مِنْ قَوْمِكُمْ، وَلْيَنْتَدِبَ لِذَلِكَ رَجُلَانِ مِنْ ذَوِي آرَائِكُمْ، فَبَعَثُوا عَمْرَو بْنَ الْعَاصِ وَعُمَارَةَ بْنَ أَبِي مُعَيْطٍ مَعَ الْهَدَايَا: الْأُدْمِ وَغَيْرِهِ، فَرَكِبَا الْبَحْرَ وَأَتَيَا الْحَبَشَةَ؛ فَلَمَّا دَخَلَا عَلَى النَّجَاشِيِّ سَجَدَا لَهُ وَسَلَّمَا عَلَيْهِ وَقَالَا لَهُ: إِنَّ قَوْمَنَا لَكَ نَاصِحُونَ شَاكِرُونَ، وَلِصَلَاحِكَ مُحِبُّونَ، وَإِنَّهُمْ بَعَثُونَا إِلَيْكَ لِنُحَذِّرَكَ هَؤُلَاءِ الْقَوْمَ الَّذِينَ قَدِمُوا عَلَيْكَ، لِأَنَّهُمْ قَوْمُ رَجُلٍ كَذَّابٍ خَرَجَ فِينَا يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ، وَلَمْ يُتَابِعْهُ أَحَدٌ مِنَّا إِلَّا السُّفَهَاءَ، وَكُنَّا قَدْ ضَيَّقْنَا عَلَيْهِمُ الْأَمْرَ وَأَلْجَأْنَاهُمْ إِلَى شِعْبٍ بِأَرْضِنَا لَا يَدْخُلُ عَلَيْهِ أَحَدٌ وَلَا يَخْرُجُ مِنْهُمْ أَحَدٌ، قَدْ قَتَلَهُمُ الْجُوعُ وَالْعَطَشُ، فَلَمَّا اشْتَدَّ عَلَيْهِمُ الْأَمْرُ بَعَثَ إِلَيْكَ ابْنَ عَمِّهِ لِيُفْسِدَ عَلَيْكَ دِينَكَ وَمُلْكَكَ وَرَعِيَّتَكَ، فَاحْذَرْهُمْ وَادْفَعْهُمْ إِلَيْنَالِنَكْفِيَكَهُمْ، قَالُوا: وَآيَةُ ذَلِكَ أَنَّهُمْ إِذَا دَخَلُوا عَلَيْكَ لَا يَسْجُدُونَ لك ولا يحيوك بِالتَّحِيَّةِ الَّتِي يُحَيِّيكَ بِهَا النَّاسُ رَغْبَةً عَنْ دِينِكَ وَسُنَّتِكَ. قَالَ: فَدَعَاهُمُ النَّجَاشِيُّ، فَلَمَّا حَضَرُوا صَاحَ جَعْفَرٌ بِالْبَابِ: يَسْتَأْذِنُ عَلَيْكَ حِزْبُ اللَّهِ، فَقَالَ النَّجَاشِيُّ: نَعَمْ، فَلْيَدْخُلُوا بِأَمَانِ اللَّهِ وَذِمَّتِهِ، فَنَظَرَ عَمْرُو بْنُ الْعَاصِ إِلَى صَاحِبِهِ، فَقَالَ: أَلَا تَسْمَعُ كَيْفَ يَرْطُنُونَ بِحِزْبِ اللَّهِ وَمَا أَجَابَهُمْ بِهِ النَّجَاشِيُّ، فَسَاءَهُمَا ذَلِكَ، ثُمَّ دَخَلُوا عَلَيْهِ وَلَمْ يَسْجُدُوا لَهُ، فَقَالَ عَمْرُو بْنُ الْعَاصِ وَعُمَارَةُ بْنُ أَبِي مُعَيْطٍ: أَلَا تَرَى أَنَّهُمْ يَسْتَكْبِرُونَ أَنْ يَسْجُدُوا لَكَ؟ فَقَالَ لَهُمُ النَّجَاشِيُّ: مَا يَمْنَعُكُمْ أَنْ تَسْجُدُوا لِي وَتُحَيُّونِي بِالتَّحِيَّةِ الَّتِي يُحَيِّينِي بها من أتاني مَنْ الْآفَاقِ؟ قَالُوا: نَسْجُدُ لِلَّهِ الَّذِي خَلَقَكَ وَمَلَّكَكَ، وَإِنَّمَا كانت تلك التحية لَنَا وَنَحْنُ نَعْبُدُ الْأَوْثَانَ، فَبَعَثَ اللَّهُ فِينَا نَبِيًّا صَادِقًا وَأَمَرَنَا بِالتَّحِيَّةِ الَّتِي يَرْتَضِيهَا اللَّهُ لَنَا، وَهِيَ السَّلَامُ تَحِيَّةُ أَهْلِ الْجَنَّةِ؛ فَعَرَفَ النَّجَاشِيُّ أَنَّ ذَلِكَ حَقٌّ وَأَنَّهُ فِي التَّوْرَاةِ وَالْإِنْجِيلِ، قَالَ: أَيُّكُمُ الْهَاتِفُ يَسْتَأْذِنُ عَلَيْكَ حِزْبُ اللَّهِ؟ قَالَ جَعْفَرٌ: أَنَا، قَالَ: فَتَكَلَّمْ. قَالَ: إِنَّكَ مَلِكٌ مِنْ مُلُوكِ أَهْلِ الْأَرْضِ وَمِنْ أَهْلِ الْكِتَابِ، وَلَا يَصْلُحُ عِنْدَكَ كَثْرَةُ الْكَلَامِ وَلَا الظُّلْمُ، وَأَنَا أُحِبُّ أَنْ أُجِيبَ عَنْ أَصْحَابِي، فَمُرْ هَذَيْنِ الرَّجُلَيْنِ فليتكلم أحدهما وليسكت الْآخَرُ فَتَسْمَعُ مُحَاوَرَتَنَا، فَقَالَ عَمْرٌو لِجَعْفَرٍ: تَكَلَّمْ، فَقَالَ جَعْفَرٌ لِلنَّجَاشِيِّ: سَلْ هَذَا الرَّجُلَ أَعَبِيدٌ نَحْنُ أَمْ أَحْرَارٌ؟ فَإِنْ كُنَّا عَبِيدًا أَبَقْنَا مِنْ أَرْبَابِنَا فَارْدُدْنَا إِلَيْهِمْ، فقال النجاشي: أعبيدهم أَمْ أَحْرَارٌ؟ فَقَالَ: بَلْ أَحْرَارٌ كِرَامٌ؟ فَقَالَ النَّجَاشِيُّ: نَجَوْا مِنَ الْعُبُودِيَّةِ. قَالَ جَعْفَرٌ: سَلْهُمَا هَلْ أَهْرَقْنَا دَمًا بِغَيْرِ حَقٍّ فَيُقْتَصُّ مِنَّا؟ فَقَالَ عَمْرٌو: لَا، وَلَا قَطْرَةٌ، قَالَ جَعْفَرٌ: سَلْهُمَا هَلْ أَخَذْنَا أَمْوَالَ النَّاسِ بِغَيْرِ حَقٍّ فَعَلَيْنَا قَضَاؤُهَا؟ قَالَ النَّجَاشِيُّ: يَا عَمْرُو إِنْ كَانَ قِنْطَارًا فَعَلَيَّ قَضَاؤُهُ، فَقَالَ عَمْرٌو: لا، ولا قيراط، قَالَ النَّجَاشِيُّ: فَمَا تَطْلُبُونَ مِنْهُمْ؟ قَالَ عَمْرٌو: كُنَّا وَهُمْ عَلَى دِينٍ وَاحِدٍ عَلَى دِينِ آبَائِنَا، فَتَرَكُوا ذَلِكَ الدِّينَ واتبعوا غيره ولزمنا نَحْنُ، فَبَعَثَنَا إِلَيْكَ قَوْمُهُمْ لِتَدْفَعَهُمْ إِلَيْنَا، فَقَالَ النَّجَاشِيُّ: مَا هَذَا الدِّينُالَّذِي كُنْتُمْ عَلَيْهِ وَالدِّينُ الَّذِي اتَّبَعْتُمُوهُ؟ اصْدُقْنِي، قَالَ جَعْفَرٌ: أَمَّا الدين الذي كنا عليه فتركناه فهو دين الشيطان وأمره، كنا نكفر بالله - عز وجل - ونعبد الحجارة؛ وأما الدِّينُ الَّذِي تَحَوَّلْنَا إِلَيْهِ، فَدِينُ اللَّهِ الْإِسْلَامُ، جَاءَنَا به الله رَسُولُ وَكِتَابٌ مِثْلُ كِتَابِ ابْنِ مَرْيَمَ مُوَافِقًا لَهُ، فَقَالَ النَّجَاشِيُّ: يَا جَعْفَرُ لَقَدْ تَكَلَّمْتَ بِأَمْرٍ عَظِيمٍ فَعَلَى رِسْلِكَ، ثُمَّ أَمَرَ النَّجَاشِيُّ فَضُرِبَ بِالنَّاقُوسِ، فَاجْتَمَعَ إِلَيْهِ كُلُّ قِسِّيسٍ وَرَاهِبٍ؛ فَلَمَّا اجْتَمَعُوا عِنْدَهُ قَالَ النَّجَاشِيُّ: أَنْشُدُكُمُ اللَّهَ الَّذِي أَنْزَلَ الْإِنْجِيلَ عَلَى عِيسَى هَلْ تَجِدُونَ بَيْنَ عِيسَى وَبَيْنَ الْقِيَامَةِ نَبِيًّا مُرْسَلًا فَقَالُوا: اللَّهُمَّ نَعَمْ، قَدْ بَشَّرَنَا بِهِ عِيسَى وَقَالَ: مَنْ آمَنَ بِهِ فَقَدْ آمَنَ بِي، وَمَنْ كَفَرَ بِهِ فَقَدْ كَفَرَ بِي؛ فَقَالَ النَّجَاشِيُّ لِجَعْفَرٍ: مَاذَا يَقُولُ لَكُمْ هَذَا الرَّجُلُ وَيَأْمُرُكُمْ بِهِ وَمَا يَنْهَاكُمْ عَنْهُ؟ قَالَ: يَقْرَأُ عَلَيْنَا كِتَابَ اللَّهِ وَيَأْمُرُ بِالْمَعْرُوفِ، وَيَنْهَى عَنِ الْمُنْكَرِ، وَيَأْمُرُ بِحُسْنِ الْجِوَارِ وَصِلَةِ الرَّحِمِ وَبِرِّ الْيَتِيمِ، وَيَأْمُرُنَا أَنْ نَعْبُدَ اللَّهَ وَحْدَهُ لَا شَرِيكَ لَهُ، فَقَالَ: اقْرَأْ عَلَيْنَا شَيْئًا مما كان يقرأعليكم، فقرأ عَلَيْكُمْ سُورَةَ \"الْعَنْكَبُوتِ\" \"وَالرُّومِ\"، فَفَاضَتْ عَيْنَا النَّجَاشِيِّ وَأَصْحَابِهِ مِنَ الدَّمْعِ وَقَالُوا: يَا جَعْفَرُ زِدْنَا مِنْ هَذَا الْحَدِيثِ الطَّيِّبِ، فَقَرَأَ عَلَيْهِمْ سُورَةَ \"الْكَهْفِ\" فَأَرَادَ عَمْرٌو أَنْ يَغْضَبَ النَّجَاشِيُّ، فَقَالَ: إِنَّهُمْ يَشْتُمُونَ عِيسَى وَأُمَّهُ، فَقَالَ النَّجَاشِيُّ: مَا يَقُولُونَ فِي عِيسَى وَأُمِّهِ؟ فَقَرَأَ عَلَيْهِمْ جَعْفَرٌ سُورَةَ \"مَرْيَمَ\"، فَلَمَّا أَتَى عَلَى ذِكْرِ مَرْيَمَ وَعِيسَى رفع النجاشي بقية مِنْ سِوَاكٍ قَدْرَ مَا يَقْذِي الْعَيْنَ وَقَالَ: وَاللَّهِ مَا زَادَ الْمَسِيحُ عَلَى مَا تَقُولُونَ هَذَا، ثُمَّ أَقْبَلَ عَلَى جَعْفَرٍ وَأَصْحَابِهِ فَقَالَ: اذْهَبُوا فَأَنْتُمْ سُيُومٌ بِأَرْضِي، يَقُولُ: آمِنُونَ، مَنْ سَبَّكُمْ أَوْ آذَاكُمْ غَرِمَ؛ ثُمَّ قَالَ: أَبْشِرُوا وَلَا تَخَافُوا، وَلَا دَهْوَرَةَ الْيَوْمَ عَلَى حِزْبِ إِبْرَاهِيمَ؛ قَالَ عَمْرٌو: يَا نَجَاشِيُّ وَمَنْ حِزْبُ إِبْرَاهِيمَ؟ قَالَ: هَؤُلَاءِ الرَّهْطُ وَصَاحِبُهُمُ الَّذِي جَاءُوا مِنْ عِنْدِهِ وَمَنِ اتَّبَعَهُمْ، فَأَنْكَرَ ذَلِكَ الْمُشْرِكُونَ وَادَّعَوْا دِينِ إِبْرَاهِيمَ، ثُمَّ رَدَّ النَّجَاشِيُّ عَلَى عَمْرٍو وَصَاحِبِهِ الْمَالَ الَّذِي حَمَلُوهُ وَقَالَ: إِنَّمَا هَدِيَّتُكُمْ إِلَيَّ رِشْوَةٌ فَاقْبِضُوهَا، فَإِنَّ اللَّهَ مَلَّكَنِي وَلَمْ يَأْخُذْ مِنِّيرِشْوَةً؛ قَالَ جعفر: وانصرفنا فكنا فِي خَيْرِ دَارٍ وَأَكْرَمِ جِوَارٍ. وَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - ذَلِكَ الْيَوْمَ فِي خُصُومَتِهِمْ فِي إِبْرَاهِيمَ عَلَى رَسُولِهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَهُوَ بِالْمَدِينَةِ قَوْلَهُ تَعَالَى: {إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ} عَلَى مِلَّتِهِ وَسُنَّتِهِ {وَهَذَا النَّبِيُّ} يَعْنِي مُحَمَّدًا - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - {وَالَّذِينَ آمَنُوا وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ} أَخْبَرَنَا أَبُو مُحَمَّدُ أحمد بن الحسن الورّاق، أخبرنا أبو أحمد محمد بْنُ أَحْمَدَ الْجَزَرِيُّ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أبي حاتم، أخبرنا أَبُو سَعِيدٍ الأشجّ قال: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ بْنِ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي الضُّحَى، عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"إِنَّ لِكُلِّ نَبِيٍّ وُلَاةً مِنَ النَّبِيِّينَ، وَأَنَا وَلِيِّي مِنْهُمْ أَبِي وَخَلِيلُ رَبِّي إِبْرَاهِيمُ\"، ثُمَّ قَرَأَ: {إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَهَذَا النَّبِيُّ} الْآيَةَ.</p>"
  },    {
    "id": 87,
    "sura": 3,
    "aya": 69,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَدَّتْ طَائِفَةٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يُضِلُّونَكُمْ} الْآيَةَ {٦٩} .</p><p>نَزَلَتْ فِي مُعَاذِ بْنِ جَبَلٍ وَحُذَيْفَةَ وَعَمَّارِ بْنِ يَاسِرٍ حِينَ دَعَاهُمُ الْيَهُودُ إِلَى دِينِهِمْ، وَقَدْ مَضَتِ الْقِصَّةُ فِي سُورَةِ الْبَقَرَةِ.</p>"
  },    {
    "id": 88,
    "sura": 3,
    "aya": 72,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَقَالَتْ طَائِفَةٌ مِنْ أَهْلِ الْكِتَابِ آمِنُوا} الْآيَةَ {٧٢} .</p><p>قَالَ الْحَسَنُ وَالسُّدِّيُّ: تَوَاطَأَ اثْنَا عَشَرَ حَبْرًا مِنْ يَهُودِ خَيْبَرَ وَقُرَى عُرَيْنَةَ، وَقَالَ بَعْضُهُمْ لِبَعْضٍ: ادْخُلُوا فِي دِينِ مُحَمَّدٍ أَوَّلَ النَّهَارِ بِاللِّسَانِ دُونَ الِاعْتِقَادِ، وَاكْفُرُوا بِهِ فِي آخِرِ النَّهَارِ وَقُولُوا: إِنَّا نَظَرْنَا فِي كُتُبِنَا وَشَاوَرْنَا عُلَمَاءَنَا فَوَجَدْنَا مُحَمَّدًا لَيْسَ بِذَلِكَ وَظَهَرَ لَنَا كَذِبُهُ وَبُطَلَانُ دِينِهِ، فَإِذَا فَعَلْتُمْ ذَلِكَ شَكَّ أَصْحَابُهُ فِي دِينِهِمْ، وَقَالُوا: إِنَّهُمْ أَهْلُ كِتَابٍ وَهُمْ أَعْلَمُبِهِ مِنَّا، فَيَرْجِعُونَ عَنْ دِينِهِمْ إِلَى دِينِكُمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ، وَأَخْبَرَ بِهِ نَبِيَّهُ مُحَمَّدًا - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَالْمُؤْمِنِينَ.وقال مُجَاهِدٌ وَمُقَاتِلٌ وَالْكَلْبِيُّ: هَذَا فِي شَأْنِ الْقِبْلَةِ لَمَّا صُرِفَتْ إِلَى الْكَعْبَةِ شَقَّ ذَلِكَ عَلَى اليهود لمخالفتهم، قال كَعْبُ بْنُ الْأَشْرَفِ وَأَصْحَابُهُ: آمِنُوا بِالَّذِي أُنْزِلَ عَلَى مُحَمَّدٍ مِنْ أَمْرِ الْكَعْبَةِ، وَصَلُّوا إِلَيْهَا أَوَّلَ النَّهَارِ، ثُمَّ اكْفُرُوا بِالْكَعْبَةِ آخِرَ النَّهَارِ، وَارْجِعُوا إِلَى قِبْلَتِكُمُ الصَّخْرَةِ، لَعَلَّهُمْ يَقُولُونَ هَؤُلَاءِ أَهْلُ كِتَابٍ وَهُمْ أَعْلَمُ مِنَّا، فَرُبَّمَا يَرْجِعُونَ إِلَى قِبْلَتِنَا فَحَذَّرَ اللَّهُ تَعَالَى نَبِيَّهُ مَكْرَ هَؤُلَاءِ، وَأَطْلَعَهُ عَلَى سِرِّهِمْ، وَأَنْزَلَ: {وَقَالَتْ طَائِفَةٌ مِنْ أَهْلِ الْكِتَابِ} الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (٣/٢٢٠) وغيره من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما قال: قال عبد الله بن الصيف وعدي بن زيد والحارث بن عوف بعضهم لبعض تعالوا نؤمن بما أنزل على محمد وأصحابه غدوة ونكفر به عشية، حتى نلبس عليهم دينهم لعلهم يصنعون كما نصنع فيرجعوا عن دينهم فأنزل الله الآية. إسناده حسن.</p>"
  },    {
    "id": 89,
    "sura": 3,
    "aya": 77,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} الْآيَةَ {٧٧} .</p><p>أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ الْحَسَنِ الْقَاضِي، أَخْبَرَنَا حَاجِبُ بْنُ أَحْمَدَ أَخْبَرَنَا مُحَمَّدُ بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"مَنْ حَلَفَ عَلَى يَمِينٍ هو فِيهَا فَاجِرٌ لِيَقْطَعَ مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ\"، فَقَالَ الْأَشْعَثُ بْنُ قَيْسٍ: فِيَّ وَاللَّهِ نَزَلَتْ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ، فَجَحَدَنِي، فَقَدَّمْتُهُ إِلَى النبيّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فقال: \"لك بَيِّنَةٌ؟ \" قُلْتُ: لَا، فَقَالَ لليهودي: \"أتحلف\"، قلت يَا رَسُولَ اللَّهِ: إِذَنْ يَحْلِفُ فَيَذْهَبُ بِمَالِي، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} الْآيَةَ، رَوَاهُ الْبُخَارِيُّ عَنْ عَبْدَانَ عَنْ أَبِي حَمْزَةَ عَنِ الْأَعْمَشِ.أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْمِهْرَجَانِيُّ: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ مُحَمَّدٍ الزَّاهِدُ، أَخْبَرَنَا أَبُو الْقَاسِمِ البغوي قال: حَدَّثَنِي مُحَمَّدُ بْنُ سليمان قال: حدثني صَالِحُ بْنُ عُمَرَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ قَالَ: قَالَ عَبْدُ اللَّهِ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"مَنْ حَلَفَ عَلَى يَمِينٍ هُوَ فِيهَا فَاجِرٌ لِيَقْطَعَ بِهَا مَالًا لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ\"، فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} إِلَى آخِرِ الْآيَةِ، فَأَتَى الْأَشْعَثُ بْنُ قَيْسٍ فَقَالَ: مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ؟ قُلْنَا: كَذَا وَكَذَا، قَالَ: لَفِيَّ نَزَلَتْ؛ خَاصَمْتُ رَجُلًا إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: \"أَلَكَ بَيِّنَةٌ؟ \" قُلْتُ: لَا، قَالَ: \"فَيَحْلِفُ؟ \" قُلْتُ: إِذَنْ يحلف، قال رسول الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -\"مَنْ حَلَفَ عَلَى يَمِينٍ هُوَ فِيهَا فَاجِرٌ لِيَقْتَطِعَ بِهَا مَالًا لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَا\"، فَأَنْزَلَ اللَّهُ: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} الْآيَةَ، رَوَاهُ الْبُخَارِيُّ عَنْ حَجَّاجِ بْنِ مِنْهَالٍ، عَنْ أَبِي عَوَانَةَ. وَرَوَاهُ مُسْلِمٌ عَنْ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ عَنْ وَكِيعٍ، وَعَنِ ابْنِ نُمَيْرٍ، عَنْ أَبِي مُعَاوِيَةَ. كُلُّهُمْ عَنِ الْأَعْمَشِ.أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ الشَّاذْيَاخِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ زَكَرِيَّا، أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْفَقِيهُ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَالْأَعْمَشِ، عَنْ أَبِي وَائِلٍ قَالَ: قَالَ عَبْدُ اللَّهِ، قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -\"لَا يَحْلِفُ رَجُلٌ عَلَى يمين صبر ليقطع بِهَا مَالًا فَاجِرًا إِلَّا لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ\"، قَالَ: فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} قَالَ: فَجَاءَ الْأَشْعَثُ وَعَبْدُ اللَّهِ يحدثهم، قال: فِيَّ نَزَلَتْ، وَفِي رَجُلٍ خَاصَمْتُهُ فِي بِئْرٍ، وَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَلَكَ بَيِّنَةٌ؟ \" قُلْتُ: لَا، قَالَ:\"فَلْيَحْلِفْ لك\"، قلت: إذن يَحْلِفُ، قَالَ: فَنَزَلَتْ: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا} الْآيَةَ.(٢) - أَخْبَرَنَا عَمْرُو بْنُ أَبِي عَمْرٍو الْمُزَكِّي، أَخْبَرَنَا مُحَمَّدُ بْنُ الْمَكِّيِّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ الْبُخَارِيُّ، حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ سَمِعَ هُشَيْمًا يَقُولُ: أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى أَنَّ رَجُلًا أَقَامَ سِلْعَةً فِي السُّوقِ، فَحَلَفَ: لَقَدْ أُعْطِيَ بِهَا ما لم يُعْطَ؛ لِيُوقِعَ فِيهَا رَجُلًا مِنَ الْمُسْلِمِينَ، فَنَزَلَتْ: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} إِلَى آخِرِ الْآيَةِ.وَقَالَ الْكَلْبِيُّ: إِنَّ نَاسًا مِنْ عُلَمَاءِ الْيَهُودِ أُولِي فَاقَةٍ أَصَابَتْهُمْ سَنَةٌ فَاقْتَحَمُوا إِلَى كَعْبِ بْنِ الْأَشْرَفِ بِالْمَدِينَةِ، فَسَأَلَهُمْ كَعْبٌ: هَلْ تَعْلَمُونَ أَنَّ هَذَا الرَّجُلَ رَسُولُ اللَّهِ فِي كِتَابِكُمْ؟ قَالُوا: نَعَمْ، وَمَا تَعْلَمُهُ أَنْتَ؟ قَالَ: لَا، فَقَالُوا: فَإِنَّا نَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ، قَالَ كَعْبٌ: لَقَدْ حَرَمَكُمُ اللَّهُ خَيْرًا كَثِيرًا، لَقَدْ قَدِمْتُمْ عَلَيَّ وَأَنَا أُرِيدُ أَنْ أَبَرَّكُمْ وَأَكْسُوا عِيَالَكُمْ، فَحَرَمَكُمُ اللَّهُ وَحَرَمَ عِيَالَكُمْ، قَالُوا: فَإِنَّهُ شُبِّهَ لَنَا، فَرُوَيْدًا حتى نلقاه، فانطلقوه فَكَتَبُوا صِفَةً سِوَى صِفَتِهِ، ثُمَّ انْتَهَوْا إِلَى نَبِيِّ اللَّهِ فَكَلَّمُوهُ وَسَأَلُوهُ، ثُمَّ رَجَعُوا إِلَى كَعْبٍ وَقَالُوا: لَقَدْ كُنَّا نَرَى أَنَّهُ رَسُولُ اللَّهِ، فَلَمَّا أَتَيْنَاهُ إِذَا هُوَ لَيْسَ بِالنَّعْتِ الَّذِي نُعِتَ لَنَا، وَوَجَدْنَا نَعْتَهُ مُخَالِفًا لِلَّذِي عِنْدَنَا، وَأَخْرَجُوا الَّذِي كَتَبُوا فَنَظَرَ إِلَيْهِ كَعْبٌ، ففرح ومارهم وأنقق عَلَيْهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.وَقَالَ عِكْرِمَةُ: نَزَلَتْ فِي أَبِي رَافِعٍ كنانة بْنِ أَبِي الْحُقَيْقِ وَحُيَيِّ بْنِ أَخْطَبَ وغيرهم من رؤوساء الْيَهُودِ، كَتَمُوا مَا عَهِدَ اللَّهُ إِلَيْهِمْ فِي التَّوْرَاةِ مِنْ شَأْنِ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَبَدَّلُوهُ وَكَتَبُوا بِأَيْدِيهِمْ غَيْرَهُ، وَحَلَفُوا أَنَّهُ مِنْ عِنْدِ اللَّهِ لِئَلَّا يَفُوتَهُمُ الرِّشَا وَالْمَآكِلُ الَّتِي كَانَتْ لَهُمْ عَلَى أَتْبَاعِهِمْ.</p><p>(١) - أخرجه البخاري (فتح الباري: ٥/٢٧٩ - ح ٢٦٦٦) (٨/٢١٢ - ح: ٤٥٤٩) ومسلم (١/١٢٢ - ح: ١٣٨) (١/١٢٣ ح: ٢٢١) والإمام أحمد (الفتح الرباني: ١٨/١٠٣ - ح: ٢١٥) وأصحاب السنن (فتح القدير: ١/٣٥٤) والشافعي (الفتح الرباني: ١٤/١٧٣) وابن جرير (٣/٢٢٩) والطبراني (المعجم الكبير: ١/٢٠٥ - ح: ٦٤٠ - ٦٤٣) كلهم من طريق الأعمش به. وألفاظهم متقاربة، والروايتان القادمتان تشهدان لهذه، وأسانيدها صحيحة.</p><p>(٢) - أخرجه البخاري (فتح الباري: ٨/٢١٣ - ح: ٤٤٥١) وابن أبي حاتم (تفسير ابن كثير: ١/٣٧٦) عن عبد الله بن أبي أوفى به. قال الحافظ ابن حجر\"لا منافاة بين الحديثين - حديث ابن مسعود وابن أبي أوفى - بل يحمل ذلك على نزولها بالسببين معا\" (فتح الباري: ٨/٢١٣) .</p>"
  },    {
    "id": 90,
    "sura": 3,
    "aya": 79,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {مَا كَانَ لِبَشَرٍ أَنْ يُؤْتِيَهُ اللَّهُ} الْآيَةَ {٧٩} .</p><p>قَالَ الضَّحَّاكُ وَمُقَاتِلٌ: نَزَلَتْ فِي نَصَارَى نَجْرَانَ عَبَدُوا عِيسَى، وَقَوْلُهُ: {لِبَشَرٍ} يَعْنِي عِيسَى، {أَنْ يُؤْتِيَهُ اللَّهُ الْكِتَابَ} يَعْنِي الْإِنْجِيلَ.</p><p>وَقَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الْكَلْبِيِّ وَعَطَاءٍ: إِنَّ أَبَا رافع اليهودي والرئيس مِنْ نَصَارَى نَجْرَانَ قَالَا: يَا مُحَمَّدُ أَتُرِيدُ أَنْ نَعْبُدَكَ وَنَتَّخِذَكَ رَبًّا؟ فَقَالَ رَسُولُ الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"معاذ بالله أَنْ يُعْبَدَ غَيْرُ اللَّهِ أَوْ نَأْمُرَ بِعِبَادَةِ غَيْرِ اللَّهِ، مَا بِذَلِكَ بَعَثَنِي، وَلَا بِذَلِكَ أَمَرَنِي\"، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.(٢) - وَقَالَ الْحَسَنُ: بَلَغَنِي أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ نُسَلِّمُ عَلَيْكَ كَمَا يُسَلِّمُ بَعْضُنَا عَلَى بَعْضٍ، أَفَلَا نَسْجُدُ لَكَ؟ قَالَ: \"لَا يَنْبَغِي أَنْ يُسْجَدَ لِأَحَدٍ مِنْ دُونِ الله، ولكن أكزموا نَبِيَّكُمْ وَاعْرِفُوا الْحَقَّ لِأَهْلِهِ\"، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(١) - أخرجه ابن جرير (٣/٢٣٢) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٣٥٥) والبيهقي في الدلائل (٥/٣٨٤) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما بأفضل منه. وإسناده حسن.</p><p>(٢) - أخرجه عبد الرزاق (لباب النقول: ٥٤) وعبد بن حميد (فتح القدير: ١/٣٥٦) عن الحسن به. وهو مرسل إسناده صحيح إلى الحسن.</p>"
  },    {
    "id": 91,
    "sura": 3,
    "aya": 83,
    "text": "<p>قَوْلُهُ تَعَالَى: {أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ} {٨٣} .</p><p>قَالَ ابْنُ عَبَّاسٍ: اخْتَصَمَ أَهْلُ الْكِتَابَيْنِ إِلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِيمَا اخْتَلَفُوا بَيْنَهُمْ مِنْ دِينِ إِبْرَاهِيمَ، كُلُّ فِرْقَةٍ زَعَمَتْ أَنَّهَا أَوْلَى بِدِينِهِ، فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"كِلَا الْفَرِيقَيْنِ بَرِيءٌ مِنْ دِينِ إِبْرَاهِيمَ\" فَغَضِبُوا، وَقَالُوا: وَاللَّهِ مَا نَرْضَى بِقَضَائِكَ وَلَا نَأْخُذُ بِدِينِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى: {أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ}</p>"
  },    {
    "id": 92,
    "sura": 3,
    "aya":86 ,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ} الْآيَةَ {٨٦} .</p><p>أَخْبَرَنَا أَبُو بَكْرٍ الْحَارِثِيُّ، أَخْبَرَنَا أَبُو مُحَمَّدِ بْنُ حَيَّانَ، أَخْبَرَنَا أَبُو يَحْيَى عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ عَنْ خَالِدٍ وَدَاوُدَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مِنَ الْأَنْصَارِ ارْتَدَّ فَلَحِقَ بِالْمُشْرِكِينَ، فَأَنْزَلَ اللَّهُ تَعَالَى: {كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ} إِلَى قَوْلِهِ: {إِلَّا الَّذِينَ تَابُوا} فَبَعَثَ بِهَا قَوْمَهُ إِلَيْهِ، فَلَمَّا قُرِئَتْ عَلَيْهِ قَالَ: وَاللَّهِ مَا كَذَبَنِي قُومِي عَلَى رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَلَا كَذَبَ رَسُولُ اللَّهِ عَلَى اللَّهِ، وَاللَّهُ - عَزَّ وَجَلَّ - أَصْدَقُ الثَّلَاثَةِ، فَرَجَعَ تَائِبًا، فَقَبِلَ مِنْهُ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَتَرَكَهُ.</p><p>(٢) - أَخْبَرَنَا أَبُو بَكْرٍ، أَخْبَرَنَا أَبُو مُحَمَّدٍ، أَخْبَرَنَا أَبُو يَحْيَى، حَدَّثَنَا سَهْلٌ، عَنْ يَحْيَى بْنِ أَبِي زَائِدَةَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ: ارْتَدَّ رَجُلٌ مِنَ الْأَنْصَارِ عَنِ الْإِسْلَامِ وَلَحِقَ بِالشِّرْكِ، فَنَدِمَ، فَأَرْسَلَ إِلَى قَوْمِهِ أَنْ يَسْأَلُوا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - هَلْ لِي مِنْ تَوْبَةٍ، فَإِنِّي قَدْ نَدِمْتُ، فَنَزَلَتْ: {كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا} حَتَّى بَلَغَ {إِلَّا الَّذِينَ تَابُوا} فَكَتَبَ بِهَا قَوْمُهُ إِلَيْهِ، فَرَجَعَ فَأَسْلَمَ.</p><p>(٣) - أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ بْنُ أَبِي حَامِدٍ، أَخْبَرَنَا أَبُو بَكْرِ بْنُ زَكَرِيَّا أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْفَقِيهُ، حَدَّثَنَا أَحْمَدُ بْنُ سَيَّارٍ، حَدَّثَنَا مُسَدَّدُ بْنُ مَسْرَهَدٍ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ مُجَاهِدٍ قَالَ: كَانَ الْحَارِثُ بْنُ سُوَيْدٍ قَدْ أَسْلَمَ، وَكَانَ مَعَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ثُمَّ لَحِقَ بقومه وكفر فأنزلت فيه هَذِهِ الْآيَةَ: {كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ} إِلَى قَوْلِهِ: {فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ} حملها إِلَيْهِ رَجُلٌ مِنْ قَوْمِهِ،فَقَرَأَهَا عَلَيْهِ فَقَالَ الْحَارِثُ: وَاللَّهِ إِنَّكَ مَا عَلِمْتُ لَصَدُوقٌ وَإِنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لَأَصْدَقُ مِنْكَ، وَإِنَّ اللَّهَ لَأَصْدَقُ الثَّلَاثَةِ، ثُمَّ رَجَعَ فَأَسْلَمَ إِسْلَامًا حَسَنًا.</p><p>(١) - إسناده حسن، ويشهد له: الرواية الآتية.</p><p>(٢) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٤ - ح: ٢١٦) والحاكم (المستدرك: ٤/٣٦٦) والنسائي (جامع الأصول: ٢/٦٨) وابن جرير (٣/٢٤١) وابن أبي حاتم وابن حبان والبيهقي (فتح القدير: ١/٣٥٩) (تفسير ابن كثير: ١/٣٧٩) من طريق داود به. وإسناده حسن (وانظر للمزيد: الفتح الرباني: ١٨/١٠٤) (حاشية جامع الأصول: ٢/٦٨) ، ويشهد له: الرواية الأتية:.</p><p>(٣) - أخرجه ابن جرير (٣/٢٤٢) ومسدّد في مسنده، وعبد الرزاق (لباب النقول: ٥٥) وابن المنذر (فتح القدير: ١/٣٥٩) من طريق حميد الأعرج به وهو مرسل، إسناده لا بأس به، ويتحسن بما قبله.</p>"
  },    {
    "id": 93,
    "sura": 3,
    "aya": 93,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {كُلُّ الطَّعَامِ كَانَ حِلًّا لِبَنِي إِسْرَائِيلَ} {٩٣} .</p> <p>قَالَ أَبُو رَوْقٍ وَالْكَلْبِيُّ: نَزَلَتْ حِينَ قال النبيّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إنه عَلَى مِلَّةِ إِبْرَاهِيمَ، فَقَالَتِ الْيَهُودُ: كَيْفَ وَأَنْتَ تَأْكُلُ لُحُومَ الْإِبِلِ وَأَلْبَانَهَا؟ فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"كَانَ ذَلِكَ حَلَالًا لِإِبْرَاهِيمَ، فَنَحْنُ نُحِلُّهُ\"، فَقَالَتِ اليهود: كل شي، أَصْبَحْنَا الْيَوْمَ نُحَرِّمُهُ فَإِنَّهُ كَانَ عَلَى نُوحٍ وَإِبْرَاهِيمَ حَتَّى انْتَهَى إِلَيْنَا، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - تَكْذِيبًا لَهُمْ: {كُلُّ الطَّعَامِ كَانَ حِلًّا لِبَنِي إِسْرَائِيلَ} الْآيَةَ.</p>"
  },    {
    "id": 94,
    "sura": 3,
    "aya": 96,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ} الْآيَةَ {٩٦} .</p><p>قَالَ مُجَاهِدٌ: تَفَاخَرَ الْمُسْلِمُونَ وَالْيَهُودُ، فَقَالَتِ الْيَهُودُ: بَيْتُ الْمَقْدِسِ أَفْضَلُ وَأَعْظَمُ مِنَ الْكَعْبَةِ لِأَنَّهُ مُهَاجَرُ الْأَنْبِيَاءِ وَفِي الْأَرْضِ الْمُقَدَّسَةِ، وَقَالَ الْمُسْلِمُونَ: بَلِ الْكَعْبَةُ أَفْضَلُ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p>"
  },    {
    "id": 95,
    "sura": 3,
    "aya": 100,
    "text": "<p>(١) - قوله تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تُطِيعُوا فَرِيقًا} الْآيَةَ {١٠٠} .</p><p>أَخْبَرَنَا أَبُو عَمْرٍو الْقَنْطَرِيُّ فِيمَا أَذِنَ لِي فِي روايته قال: أَخْبَرَنِي مُحَمَّدُ بن الحسين الحداد قَالَ: أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بن خالد قال: أَخْبَرَنَا إِسْحَاقُ بْنُ إبراهيم قال: أَخْبَرَنَا الْمُؤَمَّلُ بْنُ إسماعيل قال: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ قَالَ: كَانَ بَيْنَ هَذَيْنِ الْحَيَّيْنِ مِنَ الْأَوْسِ وَالْخَزْرَجِ قتال في الْجَاهِلِيَّةِ، فَلَمَّا جَاءَ الْإِسْلَامُ اصْطَلَحُوا وَأَلَّفَ اللَّهُ بَيْنَ قُلُوبِهِمْ، وَجَلَسَ يَهُودِيٌّ فِي مَجْلِسٍ فِيهِ نَفَرٌ مِنَ الْأَوْسِ وَالْخَزْرَجِ، فَأَنْشَدَ شِعْرًا قَالَهُ أَحَدُ الْحَيَّيْنِ فِي حَرْبِهِمْ، فَكَأَنَّهُمْ دَخَلَهُمْ مِنْ ذَلِكَ، فَقَالَ الْحَيُّ الْآخَرُونَ: وقد قَالَ شَاعِرُنَا فِي يَوْمِ كَذَا: كَذَا وَكَذَا، فَقَالَ الْآخَرُونَ: وَقَدْ قَالَ شَاعِرُنَا فِي يَوْمِ كَذَا: كَذَا وَكَذَا، قَالَ: فَقَالُوا: تَعَالَوْا نَرُدُّ الْحَرْبَ جَذَعًا كَمَا كَانَتْ، فَنَادَى هَؤُلَاءِ: يَا آلَ أَوْسٍ، وَنَادَى هَؤُلَاءِ يَا آلَ خَزْرَجٍ؛ فَاجْتَمَعُوا وَأَخَذُوا السِّلَاحَ وَاصْطَفُّوا لِلْقِتَالِ، فَنَزَلَتْ هَذِهِ الْآيَةُ، فَجَاءَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - حَتَّى قَامَ بَيْنَ الصَّفَّيْنِ فَقَرَأَهَا وَرَفَعَ صَوْتَهُ، فَلَمَّا سَمِعُوا صَوْتَهُ أَنْصَتُوا لَهُ وَجَعَلُوا يَسْتَمِعُونَ إِلَيْهِ، فَلَمَّا فَرَغَ أَلْقَوُا السِّلَاحَ وَعَانَقَ بَعْضُهُمْ بَعْضًا وَجَثَوْا يَبْكُونَ.</p><p>(٢) - وَقَالَ زَيْدُ بْنُ أَسْلَمَ: مِرْشَاسُ بْنُ قَيْسٍ الْيَهُودِيُّ وكان شيخًا قد عسا فِي الْجَاهِلِيَّةِ عَظِيمَ الْكُفْرِ شَدِيدَ الضَّغْنِ عَلَى الْمُسْلِمِينَ شَدِيدَ الْحَسَدِ لَهُمْ، فَمَرَّ عَلَى نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - مِنَ الْأَوْسِ وَالْخَزْرَجِ فِي مَجْلِسٍ قَدْ جَمَعَهُمْ يَتَحَدَّثُونَ فِيهِ، فَغَاظَهُ مَا رَأَى مِنْ جَمَاعَتِهِمْ وَأُلْفَتِهِمْ وَصَلَاحِ ذَاتِ بَيْنِهِمْ فِي الْإِسْلَامِ بَعْدَ الَّذِي كَانَ بَيْنَهُمْ فِي الْجَاهِلِيَّةِ مِنَالْعَدَاوَةِ، فَقَالَ: قَدِ اجْتَمَعَ مَلَأُ بَنِي قَيْلَةَ بِهَذِهِ الْبِلَادِ، لَا وَاللَّهِ مَا لَنَا مَعَهُمْ إِذَا اجْتَمَعُوا بِهَا مِنْ قَرَارٍ، فَأَمَرَ شَابًّا مِنَ الْيَهُودِ كَانَ مَعَهُ، فَقَالَ: اعْمَدْ إِلَيْهِمْ فَاجْلِسْ مَعَهُمْ، ثُمَّ ذَكِّرْهُمْ بِيَوْمِ بُعَاثٍ وَمَا كَانَ فِيهِ، وَأَنْشِدْهُمْ بَعْضَ مَا كَانُوا تَقَاوَلُوا فِيهِ مِنَ الْأَشْعَارِ، وَكَانَ بُعَاثٌ يَوْمًا اقْتَتَلَتْ فِيهِ الْأَوْسُ والخزرج، وكان الظافر فِيهِ لِلْأَوْسِ عَلَى الْخَزْرَجِ، فَفَعَلَ فَتَكَلَّمَ الْقَوْمُ عِنْدَ ذَلِكَ، فَتَنَازَعُوا وَتَفَاخَرُوا حَتَّى تَوَاثَبَ رَجُلَانِ مِنَ الْحَيَّيْنِ أَوْسِ بْنِ قَيْظِيٍّ أَحَدِ بَنِي حَارِثَةَ مِنَ الْأَوْسِ، وَجَبَّارِ بْنِ صَخْرٍ أَحَدِ بَنِي سَلَمَةَ مِنَ الْخَزْرَجِ فَتَقَاوَلَا وَقَالَ أَحَدُهُمَا لِصَاحِبِهِ: إِنْ شِئْتَ وَاللَّهِ رَدَدْتُهَا الْآنَ جَذَعَةً، وَغَضِبَ الْفَرِيقَانِ جَمِيعًا وَقَالَا: قَدْ فَعَلْنَا، السِّلَاحَ السِّلَاحَ، مَوْعِدُكُمُ الظَّاهِرَةُ وَهِيَ حَرَّةٌ، فخرجوا إليها فانضمت الأوس والخزرخ بَعْضُهَا إِلَى بَعْضٍ عَلَى دَعْوَاهُمُ الَّتِي كَانُوا عَلَيْهَا فِي الْجَاهِلِيَّةِ، فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَخَرَجَ إِلَيْهِمْ فِيمَنْ مَعَهُ مِنَ الْمُهَاجِرِينَ حَتَّى جَاءَهُمْ فَقَالَ: \"يَا معشر المسلمين، بدعوى الْجَاهِلِيَّةِ وَأَنَا بَيْنَ أَظْهُرِكُمْ بَعْدَ أَنْ أَكْرَمَكُمُ اللَّهُ بِالْإِسْلَامِ وَقَطَعَ بِهِ عَنْكُمْ أَمْرَ الْجَاهِلِيَّةِ وَأَلَّفَ بَيْنَكُمْ، فَتَرْجِعُونَ إِلَى مَا كُنْتُمْ عَلَيْهِ كُفَّارًا؟ اللَّهَ اللَّهَ\"، فَعَرَفَ الْقَوْمُ أَنَّهَا نَزْغَةٌ مِنَ الشَّيْطَانِ وَكَيْدٌ مِنَ عَدُوِّهِمْ فَأَلْقَوُا السِّلَاحَ من أيديهم وكبوا، وَعَانَقَ بَعْضُهُمْ بَعْضًا، ثُمَّ انْصَرَفُوا مَعَ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - سَامِعِينَ مُطِيعِينَ، فَأَنْزَلَ اللَّهُ - عز وجل - {يَا أَيُّهَا الَّذِينَ آمَنُوا} يَعْنِي الْأَوْسَ وَالْخَزْرَجَ {إِنْ تُطِيعُوا فَرِيقًا مِنَ الَّذِينَ أُوتُوا الْكِتَابَ} يَعْنِي شَاسًا وَأَصْحَابَهُ {يَرُدُّوكُمْ بَعْدَ إِيمَانِكُمْ كَافِرِينَ} قَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ: مَا كَانَ مِنْ طَالِعٍ أَكْرَهَ إِلَيْنَا مِنْ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَأَوْمَأَ إِلَيْنَا بِيَدِهِ، فَكَفَفْنَا وَأَصْلَحَ اللَّهُ تَعَالَى مَا بَيْنَنَا، فَمَا كَانَ شَخْصٌ أَحَبَّ إِلَيْنَا مِنْ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَمَا رَأَيْتُ قَطُّ يَوْمًا أَقْبَحَ وَلَا أَوْحَشَ أَوَّلًا وَأَحْسَنَ آخِرًا مِنْ ذَلِكَ الْيَوْمِ.</p><p>(١) - إسناده ضعيف بسبب المؤمل بن إسماعيل (تقريب التهذيب: ٢/٢٩٠ - رقم: ١٥٣١) (ميزان الاعتدال: ٤/٢٢٨ - رقم: ٨٩٤٩) ويشهد له: الرواية الآتية:.</p><p>(٢) - قلت: أخرجه ابن جرير (٤/١٦) وابن إسحاق وابن المنذر وأبن أبي حاتم وأبو الشيخ (فتح القدير: ١/٣٦٧) عن زيد به وهو مرسل، وفي إسناده رجل مبهم. ويشهد لهما:</p><p>١ - ما أخرجه ابن جرير (٤/١٧) عن مجاهد بإسناد صحيح نحوه.</p><p>٢ - رواية ابن عباس الآتية، وفيها ضعف.</p>"
  },    {
    "id": 96,
    "sura": 3,
    "aya": 101,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَكَيْفَ تَكْفُرُونَ} الْآيَةَ {١٠١} .</p><p>أَخْبَرَنَا أَحْمَدُ بْنُ الحسن الحيري قال: حَدَّثَنَا مُحَمَّدُ بْنُ يَعْقُوبَ، حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ، حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا قَيْسُ بْنُ الرَّبِيعِ عَنِ الْأَغَرِّ، عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ، عَنْ أَبِي نَصْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ بَيْنَ الْأَوْسِ وَالْخَزْرَجِ شَرٌّ فِي الْجَاهِلِيَّةِ، فَذَكَرُوا مَا بَيْنَهُمْ، فَثَارَ بَعْضُهُمْ إِلَى بَعْضٍ بِالسُّيُوفِ فأتي النبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فذ كر ذَلِكَ لَهُ، فَذَهَبَ إِلَيْهِمْ، فَنَزَلَتْ هَذِهِ الْآيَةُ: {وَكَيْفَ تَكْفُرُونَ وَأَنْتُمْ تُتْلَى عَلَيْكُمْ آيَاتُ اللَّهِ وَفِيكُمْ رَسُولُهُ} إِلَى قَوْلِهِ: {وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا}</p><p>أَخْبَرَنَا الشَّرِيفُ إِسْمَاعِيلُ بْنُ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ الْحُسَيْنِ النَّقِيبُ قَالَ: أَخْبَرَنَا جَدِّي مُحَمَّدُ بْنُ الْحُسَيْنِ قَالَ: أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الحسن الحافظ قال: حَدَّثَنَا حَاتِمُ بْنُ يونس الجرجاني قال: حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الليث قال: حَدَّثَنَا الْأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ، عَنْ أَبِي نَصْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ الْأَوْسُ وَالْخَزْرَجُ يَتَحَدَّثُونَ، فَغَضِبُوا، حَتَّى كَادَ يَكُونُ بَيْنَهُمْ حَرْبٌ، فَأَخَذُوا السِّلَاحَ وَمَشَى بَعْضُهُمْ إِلَى بَعْضٍ، فَنَزَلَتْ: {وَكَيْفَ تَكْفُرُونَ وَأَنْتُمْ تُتْلَى عَلَيْكُمْ آيَاتُ اللَّهِ} إِلَى قَوْلِهِ تَعَالَى: {فَأَنْقَذَكُمْ مِنْهَا}</p><p>(١) - أخرجه ابن جرير (٤/١٩) والفريابي وابن أبي حاتم (لباب النقول: ٥٥) عن أبي نصر به. وإسناده ضعيف، بسبب أبي نصر الأسدي (تقريب التهذيب: ٢/٤٨٠ - رقم: ٧) وقل في الرواية الآتية مثل هذا.</p><p>والخلاصة: أن هذه القصة لم ترد في حديث صحيح مسند، وإنما هي مراسيل وأحاديث ضعيفة، ولعلهُ يشدّ بعضها بعضًا فيثبت أصل الرواية، والله تعالى أعلم.</p>"
  },    {
    "id": 97,
    "sura": 3,
    "aya": 110,
    "text": "<p>قَوْلُهُ تَعَالَى: {كُنْتُمْ خَيْرَ أُمَّةٍ} الْآيَةَ {١١٠} .</p><p>قَالَ عِكْرِمَةُ وَمُقَاتِلٌ: نَزَلَتْ فِي ابْنِ مَسْعُودٍ وَأُبَيِّ بْنِ كَعْبٍ وَمُعَاذِ بْنِ جَبَلٍ وَسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ، وَذَلِكَ أَنَّ مالك بن الضيف، وَوَهْبَ بْنَ يَهُوذَا الْيَهُودِيَّيْنِ قَالَا لَهُمْ: إِنَّدِينَنَا خير مما تدعونا إِلَيْهِ، وَنَحْنُ خَيْرٌ وَأَفْضَلُ مِنْكُمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p>"
  },    {
    "id": 98,
    "sura": 3,
    "aya": 111,
    "text": "<p>قَوْلُهُ تَعَالَى: {لَنْ يَضُرُّوكُمْ إِلَّا أَذًى} {١١١} .</p><p>قَالَ مُقَاتِلٌ: إِنَّ رُؤُوسَ الْيَهُودِ كَعْبٌ وَبَحْرَى وَالنُّعْمَانُ وَأَبُو رَافِعٍ وَأَبُو يَاسِرٍ وَابْنُ صُورِيَّا عَمَدُوا إِلَى مُؤْمِنِهِمْ عَبْدِ اللَّهِ بْنِ سَلَامٍ وَأَصْحَابِهِ فَآذَوْهُمْ لِإِسْلَامِهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p>"
  },    {
    "id": 99,
    "sura": 3,
    "aya": 113,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَيْسُوا سَوَاءً} الْآيَةَ {١١٣} .</p><p>قَالَ ابْنُ عَبَّاسٍ وَمُقَاتِلٌ: لَمَّا أَسْلَمَ، عَبْدُ اللَّهِ بْنُ سَلَامٍ وَثَعْلَبَةُ بْنُ سَعْيَةَ وَأَسِيدُ بْنُ سَعْيَةَ وَأَسَدُ بْنُ عُبَيْدٍ وَمَنْ أَسْلَمَ مِنَ الْيَهُودِ، قَالَتْ أَحْبَارُ الْيَهُودِ: مَا آمَنَ لِمُحَمَّدٍ إِلَّا شِرَارُنَا، وَلَوْ كَانُوا مِنْ أَخْيَارِنَا لَمَا تَرَكُوا دِينَ آبَائِهِمْ، وَقَالُوا لَهُمْ: لَقَدْ خَسِرْتُمْ حِينَ اسْتَبْدَلْتُمْ بِدِينِكُمْ دِينًا غَيْرَهُ، فَأَنْزَلَ اللَّهُ تَعَالَى: {لَيْسُوا سَوَاءً} الْآيَةَ.</p><p>وَقَالَ ابْنُ مَسْعُودٍ: نَزَلَتِ الْآيَةُ فِي صَلَاةِ الْعَتَمَةِ يُصَلِّيهَا الْمُسْلِمُونَ، وَمَنْ سِوَاهُمْ مِنْ أَهْلِ الْكِتَابِ لَا يُصَلِّيهَا.</p><p>(٢) - أَخْبَرَنَا أَبُو سَعِيدٍ مُحَمَّدُ بْنُ عَبْدِ الرحمن الغازي قال. أَخْبَرَنَا أَبُو عَمْرٍو مُحَمَّدُ بْنُ أحمد الحيري قال: أَخْبَرَنَا أَحْمَدُ بْنُ عَلِيِّ بن المثنى قال: حَدَّثَنَا أَبُو خيثمة قال: حَدَّثَنَا هَاشِمُ بْنُ القاسم قال: حَدَّثَنَا شَيْبَانُ عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنِ ابْنِ مَسْعُودٍ قَالَ: أَخَّرَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لَيْلَةَ صلاة العشاء، تم خَرَجَ إِلَى الْمَسْجِدِ، فَإِذَا النَّاسُ يَنْتَظِرُونَ الصَّلَاةَ فَقَالَ: \"إِنَّهُ لَيْسَمِنْ أَهْلِ الْأَدْيَانِ أَحَدٌ يَذْكُرُ اللَّهَ فِي هَذِهِ السَّاعَةِ غَيْرُكُمْ\"، قَالَ: فَأُنْزِلَتْ هَذِهِ الْآيَاتُ: {لَيْسُوا سَوَاءً مِنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ} إِلَى قَوْلِهِ: {وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ}</p><p>(٣) - أَخْبَرَنَا سَعِيدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ بن نوح قال: أَخْبَرَنَا أَبُو عَلِيِّ بْنُ أحمد الفقيه قال: أَخْبَرَنَا مُحَمَّدُ بن المسيب قال: حَدَّثَنَا يُونُسُ بْنُ عبد الأعلى قال: حَدَّثَنَا عَبْدُ اللَّهِ بن وهب قال: أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، عَنِ ابْنِ زَحْرٍ، عَنْ سُلَيْمَانَ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: احْتَبَسَ عَلَيْنَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - ذَاتَ لَيْلَةٍ، وَكَانَ عِنْدَ بَعْضِ أَهْلِهِ أَوْ نِسَائِهِ فَلَمْ يَأْتِنَا لِصَلَاةِ الْعِشَاءِ حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ، فَجَاءَ وَمِنَّا الْمُصَلِّي وَمِنَّا الْمُضْطَجِعُ، فَبَشَّرَنَا فَقَالَ: \"إِنَّهُ لَا يُصَلِّي هَذِهِ الصَّلَاةَ أَحَدٌ مِنْ أَهْلِ الْكِتَابِ\"، وَأُنْزِلَتْ: {لَيْسُوا سَوَاءً مِنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ}</p><p>(١) - أخرجه ابن جرير (٤/٣٥) وابن المنذر وابن أبي حاتم والطبراني وابن منده في \"الصحابة\" وأبو نعيم وابن عساكر (فتح القدير: ١/٣٧٤) والبيهقي في \"الدلائل\" (٢/٥٣٤) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما نحوه، وسنده حسن.</p><p>(٢) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٦ - ح ٢٢٢) وابن جرير (٤/٣٦) والنسائي والبزار وأبو يعلى وابن النذر وابن أبي حاتم (فتح القدير: ١/٣٧٥) من طريق عاصم به. وبالرغم من الاختلاف في حفظ عاصم، إلا أن السيوطي حسّنه، وهو كما قال (راجع: فتح القدير: ١/٣٧٥، الفتح الرباني: ١٨/١٠٧، مجمع الزوائد: ١/٣١٢) ، ويشهد له: الرواية الآتية:.</p><p>(٣) - أخرجه ابن جرير (٤/٣٦) والطبراني (المعجم الكببر: ١٠/١٦٢ - ح: ١٠٢٠٩) من طريق ابن زحر به. وفيه ضعف بسبب ابن زحر (تهذيب التهذيب: ٧/١٢) لكن يتحسن بما قبله.</p>"
  },    {
    "id": 100,
    "sura": 3,
    "aya": 118,
    "text": "<p>(١) - قوله تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا بِطَانَةً مِنْ دُونِكُمْ} الْآيَةَ {١١٨} .</p><p>قَالَ ابْنُ عَبَّاسٍ وَمُجَاهِدٌ: نَزَلَتْ فِي قَوْمٍ مِنَ الْمُؤْمِنِينَ كَانُوا يُصَافُّونَ الْمُنَافِقِينَ وَيُوَاصِلُونَ رِجَالًا مِنَ الْيَهُودِ لِمَا كَانَ بَيْنَهُمْ مِنَ الْقَرَابَةِ وَالصَّدَاقَةِ وَالْحِلْفِ وَالْجِوَارِ وَالرَّضَاعِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ يَنْهَاهُمْ عَنْ مُبَاطَنَتِهِمْ خَوْفَ الْفِتْنَةِ مِنْهُمْ عَلَيْهِمْ.</p><p>(١) - أخرج أثر ابن عباس ابن جرير (٤/٤٠) وابن المنذر وابن أبي حاتم (فتح القدير: ١/٣٧٧) من طريق ابن إسحاق بسنده عن ابن عباس رضي الله عنهما به وإسناده حسن.</p>"
  },    {
    "id": 101,
    "sura": 3,
    "aya": 121,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ} الْآيَةَ {١٢١} .</p><p>نَزَلَتْ هَذِهِ الْآيَةُ فِي غَزْوَةِ أُحُدٍ، أَخْبَرَنَا سَعِيدُ بْنُ محمد الزاهد قال: أَخْبَرَنَا أَبُو عليالفقيه قال: أَخْبَرَنَا أَبُو القاسم البغوي قال: حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْحَمِيدِ الحماني قال: حَدَّثَنَا عَبْدُ اللَّهِ بن جعفر المخزمي، عَنِ ابْنِ عَوْنٍ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ: قُلْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ: أَيْ خَالِي أَخْبِرْنِي عَنْ قِصَّتِكُمْ يَوْمَ أُحُدٍ، فَقَالَ: اقْرَأِ الْعِشْرِينَ وَمِائَةً مِنْ آلِ عِمْرَانَ تَجِدْ {وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ الْمُؤْمِنِينَ} إِلَى قَوْلِهِ تَعَالَى: {ثُمَّ أَنْزَلَ عَلَيْكُمْ مِنْ بَعْدِ الْغَمِّ أَمَنَةً نُعَاسًا}</p>"
  },    {
    "id": 102,
    "sura": 3,
    "aya": 128,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ} {١٢٨} .</p><p>أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ محمد التميمي قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ محمد جعفر قال: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ محمد الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ العسكري قال: حَدَّثَنَا عُبَيْدَةُ بْنُ حُمَيْدٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: كُسِرَتْ رَبَاعِيَّةُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يَوْمَ أُحُدٍ وَدُمِيَ وَجْهُهُ، فَجَعَلَ الدَّمُ يَسِيلُ عَلَى وَجْهِهِ وَيَقُولُ: \"كَيْفَ يُفْلِحُ قَوْمٌ خَضَّبُوا وَجْهَ نَبِيِّهِمْ بِالدَّمِ وَهُوَ يَدْعُوهُمْ إِلَى رَبِّهِمْ؟ \" قَالَ: فَأَنْزَلَ اللَّهُ تَعَالَى: {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ}</p><p>(٢) - أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الغازي قال: أَخْبَرَنَا أَبُو عَمْرِو بن حمدان قال: أَخْبَرَنَا أَحْمَدُ بْنُ عَلِيِّ بن المثنى قال: حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي إسرائيل قال: حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ محمد قال: حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ قَالَ: لَعَنَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي صَلَاةِ الصُّبْحِ فُلَانًا وَفُلَانًا نَاسًا مِنَ الْمُنَافِقِينَ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْيَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ} رَوَاهُ الْبُخَارِيُّ، عَنْ حَيَّانَ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ مَعْمَرٍ، ورواه مسلم من طَرِيقِ ثَابِتٍ، عَنْ أَنَسٍ.</p><p>(٣) - أَخْبَرَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ إبراهيم الفارسي قال: أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى بن عمرويه قال: أَخْبَرَنَا إِبْرَاهِيمُ بن محمد قال: أَخْبَرَنَا مُسْلِمُ بن الحجاج قال: حدثنا القعنبي قال: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ، عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - كُسِرَتْ رَبَاعِيَّتُهُ يَوْمَ أُحُدٍ وَشُجَّ فِي رَأْسِهِ وَجَعَلَ يَسِيلُ الدَّمُ عَنْهُ وَيَقُولُ: \"كَيْفَ يُفْلِحُ قَوْمٌ شَجُّوا نَبِيَّهُمْ وَكَسَرُوا رَبَاعِيَّتَهُ وَهُوَ يَدْعُوهُمْ إِلَى رَبِّهِمْ\"، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ}</p><p>(٢) - أَخْبَرَنَا أَبُو إسحاق الثعالبي، أخبر عَبْدُ اللَّهِ بْنُ حامد الوزان قال: أَخْبَرَنَا أَبُو حَامِدِ ابن الشرقي قال: حَدَّثَنَا مُحَمَّدُ بن يحيى قال: حدثناعبد الرزاق قال: أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ فِي صَلَاةِ الْفَجْرِ حِينَ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ: \"رَبَّنَا لَكَ الْحَمْدُ، اللَّهُمَّ الْعَنْ فُلَانًا وَفُلَانًا\"، دَعَا عَلَى نَاسٍ مِنَ الْمُنَافِقِينَ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ} رَوَاهُ الْبُخَارِيُّ مِنْ طَرِيقِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَسِيَاقُهُ أَحْسَنُ مِنْ هَذَا.</p><p>أَخْبَرَنَا الْقَاضِي أَبُو بَكْرٍ أَحْمَدُ بْنُ الْحَسَنِ قال: حَدَّثَنَا أَبُو الْعَبَّاسِ مُحَمَّدُ بْنُ يَعْقُوبَ قَالَ: حَدَّثَنَا بَحْرُ بْنُ نَصْرٍ قَالَ: قُرِئَ عَلَى بن وَهْبٍ، أَخْبَرَكَ يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يَقُولُ: كَانَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - حِينَ يَفْرَغُ فِي صَلَاةِ الْفَجْرِ مِنَ الْقِرَاءَةِ وَيُكَبِّرُ وَيَرْفَعُ رَأْسَهُ ويقول: \"سَمِعَ اللَّهُ لِمَنِ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ\" ثُمَّ يَقُولُ وَهُوَ قَائِمٌ: \"اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ: اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ، اللَّهُمَّ الْعَنْ لَحْيَانَ وَرِعْلًا وَذَكْوَانَ وَعَصِيَّةَ عَصَتِ اللَّهَ وَرَسُولَهُ\"، ثُمَّ بَلَغَنَا أَنَّهُ تَرَكَ لَمَّا نَزَلَتْ: {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ} رَوَاهُ الْبُخَارِيُّ، عَنْ مُوسَى بْنِ إِسْمَاعِيلَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ.</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٨ - ح: ٢٢٤) والترمذي (٥/٢٢٦ - ح: ٣٠٠٢) وابن جرير (٤/٥٧) والنسائي (فتح الباري: ٧/٣٦٥) وابن إسحاق (السيرة النبوية لابن هشام: ٣/٢٨) وأبو جعفر النحاس في \"الناسخ\" (تفسير الطبري بتحقيق أحمد شاكر: ٧/١٩٦) من طريق حميد به. وفيه عنعنة حميد وهو مدلّس (تقريب التهذيب: ١/٢٠٢ - رقم: ٥٨٩) لكن يتقوّى بشواهده، لا سيما وقد ذكره البخاري في صحيحه معلقًا مجزومًا به (فتح الباري: ٧/٣٦٥) ومن شواهده الروايه بعد الآتية.</p><p>(٢) - تخريجه في الرواية بعد القادمة.</p><p>(٣) - هذا متابع للرواية السابقة عن أنس رضي الله عنه وقد أخرجه مسلم (٣/١٤١ - ح: ١٧٩١) والبيهقي في \"الدلائل\" (٣/٢٦٢) من طريق حماد به. وأخرجه البخاري في صحيحه معلقًا مجزومًا به (فتح الباري: ٧/٣٦٥) .</p><p>(٢) - أخرجه البخاري (فتح الباري: ٨/٢٢٥ - ح: ٤٥٥٩) والإمام أحمد (الفتح الرباني: ٣/٢٩٩ - ح: ٦٩٤) والطبراني (المعجم الكبير: ١٢/٢٨٠ - ح: ١٣١١٣) والنسائي وعبد الرزاق (تفسير ابن كثير: ١/٤٠٢) وأبو جعفر النحاس في \"ناسخه\" (تفسير الطبري بتحقيق أحمد محمد شاكر: ٧/٢٠٠) من طريق معمر به، ويشهد له:</p><p>١ - ما أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٧ - ح: ٢٢٣) . والترمذي (٥/٢٢٧ - ح: ٣٠٠٤) والنسائي (جامع الأصل: ٢/٧٠) وابن جرير (٤/٥٨) عن ابن عمر رضي الله عنهما نحوه وإسناده ضعيف، بسبب عمر بن حمزة بن عبد الله بن عمر (تقريب التهذيب: ٢/٥٣ - رقم: ٤٠٩) .</p><p>٢ - ما أخرجه الإمام أحمد (تفسير ابن كثير: ١/٤٠٢) والترمذي (٥/٢٢٨ - ح: ٣٠٠٥) وابن جرير (٤/٥٨) من طريق محمد بن عجلان عن نافع بن عمر مختصرًا بمعناه. وإسناده حسن.</p><p>٣ - الرواية الآتية.</p>"
  },    {
    "id": 103,
    "sura": 3,
    "aya": 135,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً} الْآيَةَ {١٣٥} .</p><p>قَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ عَطَاءٍ: نَزَلَتِ الْآيَةُ فِي نَبْهَانَ التَّمَّارِ، أَتَتْهُ امْرَأَةٌ حَسْنَاءُ تَبْتَاعُ مِنْهُ تَمْرًا فَضَمَّهَا إِلَى نَفْسِهِ وَقَبَّلَهَا ثُمَّ نَدِمَ عَلَى ذَلِكَ، فَأَتَى النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَذَكَرَ ذَلِكَ لَهُ، فَنَزَلَتْ هَذِهِ الْآيَةُ.</p><p>وَقَالَ فِي رِوَايَةِ الْكَلْبِيِّ: إِنَّ رَجُلَيْنِ أَنْصَارِيًّا وَثَقَفِيًّا آخَى رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بَيْنَهُمَا، فَكَانَا لَا يَفْتَرِقَانِ، فَخَرَجَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فِي بَعْضِ مَغَازِيهِ، وَخَرَجَ مَعَهُ الثَّقَفِيُّ وَخَلَّفَ الْأَنْصَارِيَّ فِي أَهْلِهِ وَحَاجَتِهِ، وَكَانَ يَتَعَاهَدُ أَهْلَ الثَّقَفِيِّ، فَأَقْبَلَ ذَاتَ يَوْمٍ فَأَبْصَرَ امْرَأَةَ صَاحِبِهِ قَدِ اغْتَسَلَتْ وَهِيَ نَاشِرَةٌ شَعْرَهَا، فَوَقَعَتْ فِي نَفْسِهِ، فَدَخَلَ وَلَمْ يَسْتَأْذِنْ حَتَّى انْتَهَى إليها، فذهب ليقبلها فَوَضَعَتْ كَفَّهَا عَلَى وَجْهِهَا، فَقَبَّلَ ظَاهِرَ كَفِّهَا ثُمَّ نَدِمَ وَاسْتَحْيَا، فَأَدْبَرَ رَاجِعًا فَقَالَتْ: سُبْحَانَ اللَّهِ! خُنْتَ أَمَانَتَكَ، وَعَصَيْتَ رَبَّكَ، وَلَمْ تُصِبْ حَاجَتَكَ، قَالَ: فَنَدِمَ عَلَى صَنِيعِهِ، فَخَرَجَ يَسِيحُ فِي الْجِبَالِ وَيَتُوبُ إِلَى اللَّهِ تَعَالَى مِنْ ذَنْبِهِحَتَّى وَافَى الثَّقَفِيَّ، فَأَخْبَرَتْهُ أَهْلُهُ بِفِعْلِهِ، فَخَرَجَ يَطْلُبُهُ حَتَّى دُلَّ عَلَيْهِ، فَوَافَقَهُ سَاجِدًا وَهُوَ يَقُولُ: رَبِّ ذَنْبِي ذَنْبِي! قَدْ خُنْتُ أَخِي، فَقَالَ لَهُ: يا فلان ثم فَانْطَلِقْ إِلَى رسول الله - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فسله عَنْ ذَنْبِكَ لَعَلَّ اللَّهَ أَنْ يَجْعَلَ لك فرجًا وتوبًا، فَأَقْبَلَ مَعَهُ حَتَّى رَجَعَ إِلَى الْمَدِينَةِ، وَكَانَ ذَاتَ يَوْمٍ عِنْدَ صَلَاةِ الْعَصْرِ نَزَلَ جِبْرِيلُ عَلَيْهِ السَّلَامُ بِتَوْبَتِهِ، فَتَلَا عَلَيْهِمَا رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - {وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً} إِلَى قَوْلِهِ: {وَنِعْمَ أَجْرُ الْعَامِلِينَ} فَقَالَ عُمَرُ: يَا رَسُولَ اللَّهِ أَخَاصٌّ هَذَا لِهَذَا الرَّجُلِ أَمْ لِلنَّاسِ عَامَّةً؟ قَالَ: \"بَلْ لِلنَّاسِ عَامَّةً\".</p><p>أَخْبَرَنِي أَبُو عَمْرٍو مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ المروزي إجازة قال: أَخْبَرَنَا مُحَمَّدُ بْنُ الحسين الحدادي قال: أَخْبَرَنَا مُحَمَّدُ بن يحيى قال: أَخْبَرَنَا إِسْحَاقُ بن إبراهيم قال: أخبرنا روح قال: حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِيهِ، عَنْ عَطَاءٍ: أَنَّ الْمُسْلِمِينَ قالوا للنبي - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أبَنُوا إِسْرَائِيلَ أَكْرَمُ عَلَى اللَّهِ مِنَّا؟ كَانُوا إِذَا أَذْنَبَ أَحَدُهُمْ أَصْبَحَتْ كَفَّارَةُ ذَنْبِهِ مَكْتُوبَةً فِي عَتَبَةِ بَابِهِ: اجْدَعْ أُذُنَكَ، اجْدَعْ أَنْفَكَ، افْعَلْ كَذَا، فَسَكَتَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَنَزَلَتْ: {وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً} فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَلَا أُخْبِرُكُمْ بِخَيْرٍ مِنْ ذَلِكَ؟ \" فَقَرَأَ هَذِهِ الْآيَاتِ.</p>"
  },    {
    "id": 104,
    "sura": 3,
    "aya": 139,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تَهِنُوا وَلَا تَحْزَنُوا} الْآيَةَ {١٣٩} .</p><p>قَالَ ابْنُ عَبَّاسٍ: انْهَزَمَ أَصْحَابُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يوم أُحُد، فبينما هُمْ كَذَلِكَ إِذْ أَقْبَلَ خَالِدُ بْنُ الْوَلِيدِ بِخَيْلِ الْمُشْرِكِينَ يُرِيدُ أَنْ يَعْلُوَ عَلَيْهِمُ الْجَبَلَ، فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"اللَّهُمَّ لَا يَعْلُونَ عَلَيْنَا، اللَّهُمَّ لَا قُوَّةَ لَنَا إِلَّا بِكَ، اللَّهُمَّ لَيْسَ يَعْبُدُكَ بِهَذِهِ الْبَلْدَةِ غَيْرُ هَؤُلَاءِ النَّفَرِ\"، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَاتِ، وَثَابَ نَفَرٌ مِنَ الْمُسْلِمِينَ رُمَاةٌ، فَصَعِدُوا الْجَبَلَ وَرَمَوْا خَيْلَ الْمُشْرِكِينَ حَتَّى هَزَمُوهُمْ، فَذَلِكَ قَوْلُهُ: {وَأَنْتُمُ الْأَعْلَوْنَ}.</p><p>(١) - أخرجه ابن جرير (٤/٦٧) موصولا عن ابن عباس رضي الله عنهما من طريق العوفي، وإسناده ضعيف، ولم يذكر ابن جرير ما بعد قوله: اللهم لا يعلون علينا.</p>"
  },    {
    "id": 105,
    "sura": 3,
    "aya": 140,
    "text": "<p>قَوْلُهُ تَعَالَى: {إِنْ يَمْسَسْكُمْ قَرْحٌ} الْآيَةَ {١٤٠} .</p><p>قَالَ رَاشِدُ بْنُ سَعْدٍ: لَمَّا انْصَرَفَ رَسُولُ اللَّهِ كَئِيبًا حَزِينًا يَوْمَ أُحُدٍ، جَعَلَتِ الْمَرْأَةُ تَجِيءُ بِزَوْجِهَا وَابْنِهَا مَقْتُولَيْنِ وَهِيَ تَلْتَدِمُ، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"أَهَكَذَا يُفْعَلُ بِرَسُولِكَ؟ \" فَأَنْزَلَ اللَّهُ تَعَالَى: {إِنْ يَمْسَسْكُمْ قَرْحٌ} الْآيَةَ.</p>"
  },    {
    "id": 106,
    "sura": 3,
    "aya": 144,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَمَا مُحَمَّدٌ إِلا رَسُولٌ} الآيات {١٤٤} .</p><p>قَالَ عَطِيَّةُ الْعَوْفِيُّ: لَمَّا كَانَ يَوْمُ أُحُدٍ انْهَزَمَ النَّاسُ، فَقَالَ بَعْضُ النَّاسِ: قَدْ أُصِيبَ مُحَمَّدٌ فَأَعْطُوهُمْ بِأَيْدِيكُمْ، فَإِنَّمَا هم إخوانكم، وقاد بَعْضُهُمْ: إِنْ كَانَ مُحَمَّدٌ أُصِيبَ ألا ما تَمْضُونَ عَلَى مَا مَضَى عَلَيْهِ نَبِيُّكُمْ حَتَّى تَلْحَقُوا بِهِ، فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ: {وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ} إِلَى {وَكَأَيِّنْ مِنْ نَبِيٍّ قَاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَمَا وَهَنُوا لِمَا أَصَابَهُمْ فِي سَبِيلِ اللَّهِ وَمَا ضَعُفُوا} لِقَتْلِ نَبِيِّهِمْ إِلَى قَوْلِهِ: {فَآتَاهُمُ اللَّهُ ثَوَابَ الدُّنْيَا}.</p><p>(١) - أخرج معناه ابن جرير (٤/٧٢) عن قتادة مرسلاً بإسناد صحيح، وأخرجه كذلك (٤/٧٤) عن القاسم بن عبد الرحمن بن رافع مرسلاً نحوه.</p>"
  },    {
    "id": 107,
    "sura": 3,
    "aya": 151,
    "text": "<p>قَوْلُهُ تَعَالَى: {سَنُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ} الْآيَةَ {١٥١} .</p><p>قَالَ السُّدِّيُّ: لَمَّا ارْتَحَلَ أبو سفيان والمشركين يَوْمَ أُحُدٍ مُتَوَجِّهِينَ إِلَى مَكَّةَ، انْطَلَقُوا حَتَّى بَلَغُوا بَعْضَ الطَّرِيقِ ثُمَّ إِنَّهُمْ نَدِمُوا وَقَالُوا: بِئْسَ مَا صَنَعْنَا قَتَلْنَاهُمْ حَتَّى إِذَا لَمْ يَبْقَ مِنْهُمْ إِلَّا الشَّرِيدُ تَرَكْنَاهُمْ، ارْجِعُوا فَاسْتَأْصِلُوهُمْ، فَلَمَّا عَزَمُوا عَلَى ذَلِكَ أَلْقَى اللَّهُ تَعَالَى فِي قُلُوبِهِمُ الرُّعْبَ حَتَّى رَجَعُوا عَمَّا عَزَمُوا، وَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p>"
  },    {
    "id": 108,
    "sura": 3,
    "aya": 152,
    "text": "<p>قَوْلُهُ تَعَالَى: {وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُ} الْآيَةَ {١٥٢} .</p><p>قَالَ مُحَمَّدُ بْنُ كَعْبٍ الْقُرَظِيُّ: لَمَّا رَجَعَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - إِلَى الْمَدِينَةِ وَقَدْ أُصِيبُوا بِمَا أُصِيبُوا يَوْمَ أُحُدٍ، قَالَ نَاسٌ مِنْ أَصْحَابِهِ: مِنْ أَيْنَ أَصَابَنَا هَذَا وَقَدْ وَعَدَنَا اللَّهُ النَّصْرَ؟ فَأَنْزَلَ اللَّهُ تَعَالَى: {وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُ} الْآيَةَ إِلَى قَوْلِهِ: {مِنْكُمْ مَنْ يُرِيدُ الدُّنْيَا} يَعْنِي الرُّمَاةَ الَّذِينَ فَعَلُوا مَا فَعَلُوا يَوْمَ أُحُدٍ.</p>"
  },    {
    "id": 109,
    "sura": 3,
    "aya": 161,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ} الْآيَةَ {١٦١} .</p><p>أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن المطوعي قال: أَخْبَرَنَا أَبُو عَمْرٍو مُحَمَّدُ بْنُ أحمد الحيري قال: أَخْبَرَنَا أبو يعلى قال: حَدَّثَنَا أَبُو عَبْدِ اللَّهِ بْنُ عُمَرَ بْنِ أبان قال: حَدَّثَنَا ابْنُ المبارك قال: حَدَّثَنَا شَرِيكٌ عَنْ خُصَيْفٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: فَقَدْتُ قَطِيفَةً حَمْرَاءَ يَوْمَ بَدْرٍ مِمَّا أُصِيبَ مِنَ الْمُشْرِكِينَ، فَقَالَ أُنَاسٌ: لَعَلَّ النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَخَذَهَا، فَأَنْزَلَ اللَّهُ تَعَالَى: {وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ} قال حصيف: فَقُلْتُ لِسَعِيدِ بْنِ جُبَيْرٍ: مَا كَانَ لِنَبِيٍّ أَنْ يُغَلَّ، فَقَالَ: بَلْ يُغَلُّ وَيُقْتَلُ.</p><p>أَخْبَرَنَا أَبُو الْحَسَنِ أَحْمَدُ بْنُ إبراهيم النجار قال: حَدَّثَنَا أَبُو الْقَاسِمِ سُلَيْمَانُ بْنُ أيوب الطبراني قال: حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ يَزِيدَ النَّرْسِيُّ حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عُمَرَ الدُّورِيُّ عَنْ أَبِي محمد اليزيدي قال عَنْ أَبِي عَمْرِو بْنِ الْعَلَاءِ، عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ: أَنَّهُ كَانَ يُنْكِرُ عَلَى مَنْ يَقْرَأُ: {وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ} وَيَقُولُ: كَيْفَ لَا يَكُونُ لَهُ أَنْ يُغَلَّ وَقَدْ كَانَ يُقْتَلُ؟ قَالَ اللَّهُ تَعَالَى: {وَيَقْتُلُونَ الْأَنْبِيَاءَ} (٢) ولكن المنافقين استهموا النَّبِيَّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -فِي شَيْءٍ مِنَ الْغَنِيمَةِ، فَأَنْزَلَ اللَّهُ - عَزَّ وَجَلَّ - {وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ}</p><p>(٣) - أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أحمد الأصفهاني قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الأصفهاني قال: حَدَّثَنَا أَبُو يَحْيَى الرازي قال: حَدَّثَنَا سَهْلُ بْنُ عثمان قال: حَدَّثَنَا وَكِيعٌ عَنْ سَلَمَةَ عَنِ الضَّحَّاكِ قَالَ: بَعَثَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - طَلَائِعَ، فَغَنِمَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - غَنِيمَةً وَقَسَّمَهَا بَيْنَ النَّاسِ وَلَمْ يُقَسِّمْ لِلطَّلَائِعِ شَيْئًا، فَلَمَّا قَدِمَتِ الطَّلَائِعُ قَالُوا: قَسَّمَ الْفَيْءَ وَلَمْ يُقَسِّمْ لَنَا، فَنَزَلَتْ: {وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ} قَالَ سَلَمَةُ: قَرَأَهَا الضَّحَّاكُ يُغَلَّ.</p><p>وَقَالَ ابْنُ عَبَّاسٍ فِي رِوَايَةِ الضَّحَّاكِ: إِنَّ رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لَمَّا وَقَعَ فِي يَدِهِ غَنَائِمُ هَوَازِنَ يَوْمَ حُنَيْنٍ غَلَّهُ رَجُلٌ بِمَخِيطٍ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>وَقَالَ قَتَادَةُ: نَزَلَتْ وَقَدْ غَلَّ طَوَائِفُ مِنْ أَصْحَابِهِ.</p><p>وَقَالَ الْكَلْبِيُّ وَمُقَاتِلٌ: نزلت حين ترك الرُّمَاةُ الْمَرْكَزَ يَوْمَ أُحُدٍ طَلَبًا لِلْغَنِيمَةِ، وَقَالُوا: نَخْشَى أَنْ يَقُولَ رسول الله صلى الله عيه وسلم: "مَنْ أَخَذَ شَيْئًا فَهُوَ لَهُ"، وَأَنْ لَا يُقَسِّمَ الْغَنَائِمَ كَمَا لَمْ يُقَسِّمْ يَوْمَ بَدْرٍ، فَقَالَ النَّبِيُّ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - "ظَنَنْتُمْ أَنَّا نَغُلُّ وَلَا نُقَسِّمُ لَكُمْ"، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَة.</p><p>وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ: أَنَّ أَشْرَافَ النَّاسِ اسْتَدْعَوْا رَسُولَ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَنْ يَخْصُصَهُمْ بِشَيْءٍ مِنَ الْغَنَائِمِ، فَنَزَلَتْ هَذِهِ الْآيَةُ.</p><p>(١) - أخرجه أبو داود (٤/٢٨٠ - ح: ٣٩٣١) والترمذي (٥/٢٣٠ - ح: ٣٠٠٩) وابن جرير (٤/١٠٢) وابن أبي حاتم وعبد بن حميد (فتح القدير: ١/٣٩٥) وابن عدي (الكامل في الضعفاء: ٣/٩٤٢) وأبو يعلى في "مسنده" (٤/٣٢٧ - ح: ٢٤٣٨، ٥/٦٠ - ح: ٢٦٥١) من طريق خصيف به وإسناده ضعيف بسبب خصيف (تقريب التهذيب: ١/٢٢٤ - رقم: ١٢٦) لكن يتقوى بشواهده، ومنها:</p><p>١ - ما أخرجه ابن جرير (٤/١٠٢) من طريق الأعمش عن ابن عباس رضي الله عنهما، وفيه انقطاع.</p><p>٢ - الرواية الآتية.</p><p>(٣) سورة آل عمران: الآية ١١٢.</p><p>() - حديث معضل - أي سقط من إسناده أكثر من راو متتابعين -.</p>"
  },    {
    "id": 110,
    "sura": 3,
    "aya": 165,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {أَوَلَمَّا أَصَابَتْكُمْ مُصِيبَةٌ} الْآيَةَ {١٦٥} .</p><p>قَالَ ابْنُ عَبَّاسٍ: حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَ: لَمَّا كَانَ يَوْمُ أُحُدٍ مِنَ الْعَامِ الْمُقْبِلِ عُوقِبُوا بِمَا صَنَعُوا يَوْمَ بَدْرٍ مِنْ أَخْذِهِمُ الْفِدَاءَ، فَقُتِلَ مِنْهُمْ سَبْعُونَ وَفَرَّ أَصْحَابُ رَسُولِ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَكُسِرَتْ رَبَاعِيَّتُهُ وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ، وَسَالَ الدَّمُ عَلَى وَجْهِهِ، فَأَنْزَلَ اللَّهُ تَعَالَى: {أَوَلَمَّا أَصَابَتْكُمْ مُصِيبَةٌ} إِلَى قَوْلِهِ: {قُلْ هُوَ مِنْ عِنْدِ أَنْفُسِكُمْ} قال: يأخذكم الْفِدَاءَ.</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٤/١٠٢ - ح: ٢٩٢) وابن أبي حاتم (تفسير ابن كثير: ١/٤٢٤) من طريق سماك الحنفي عن ابن عباس به، وهو أطول من هذا السياق، وإسناده صحيح (انظر الفتح الرباني: ٢١/٣٣) وأصله في صحيح مسلم (٣/١٣٨٣ - ح: ١٧٦٣) وإسنادهم واحد، ويشهد له:</p><p>ما أخرجه ابن جرير (٤/١١٠) عن علي مرفوعا بمعناه، وإسناده صحيح وأصله في جامع الترمذي (٤/١٣٥ - ح: ١٥٦٧) وسنن النسائي (تفسير ابن كثير: ١/٤٢٥) ومصنف ابن أبي شيبة وتفسير ابن مردويه (فتح القدير: ١/٣٩٧) .</p>"
  },    {
    "id": 111,
    "sura": 3,
    "aya":169 ,
    "text":  "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا} {١٦٩} .</p><p>أَخْبَرَنَا مُحَمَّدُ بْنُ مُحَمَّدِ بن يحيى قال: أَخْبَرَنَا أَبُو سَعِيدٍ إِسْمَاعِيلُ بْنُ أحمد الخلالي قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ زَيْدَانَ بْنِ يزيد البجلي قال: حَدَّثَنَا أبو كريب قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي أُمَيَّةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"لَمَّا أُصِيبَ إِخْوَانُكُمْ بِأُحُدٍ جَعَلَ اللَّهُ أَرْوَاحَهُمْ فِي أَجْوَافِ طَيْرٍ خُضْرٍ تَرِدُ أَنْهَارَ الْجَنَّةِ وَتَأْكُلُ مِنْ ثِمَارِهَا وَتَأْوِي إِلَى قَنَادِيلَ مِنْ ذَهَبٍ مُعَلَّقَةٍ فِي ظِلِّ الْعَرْشِ، فَلَمَّا وَجَدُوا طِيبَ مَأْكَلِهِمْ وَمَشْرَبِهِمْ وَمَقِيلِهِمْ قَالُوا: مَنْ يُبَلِّغُ إِخْوَانَنَا عَنَّا أَنَّا فِي الْجَنَّةِ نُرْزَقُ، لِئَلَّا يَزْهَدُوا فِي الْجِهَادِ وَلَا يَنْكُلُوا فِي الْحَرْبِ\"، فَقَالَ اللَّهُ عَزَّ وَجَلَّ: \"أَنَا أُبَلِّغُهُمْ عَنْكُمْ\"، فَأَنْزَلَ اللَّهُ تَعَالَى: {وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ} رَوَاهُ الْحَاكِمُ أَبُو عَبْدِ اللَّهِ فِي صَحِيحِهِ مِنْ طَرِيقِعُثْمَانَ بْنِ أَبِي شَيْبَةَ.</p><p>أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الغازي قال: أَخْبَرَنَا مُحَمَّدُ بن حمدان قال: أَخْبَرَنَا حَامِدُ بْنُ شعيب البلخي قال: حدثناعثمان بْنُ أبي شيبة قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ فَذَكَرَهُ. رَوَاهُ الْحَاكِمُ عَنْ عَلِيِّ بْنِ عِيسَى الْحِيرِيِّ، عَنْ مُسَدَّدٍ، عَنْ عُثْمَانَ بْنِ أَبِي شَيْبَةَ.</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٩ - ح: ٢٢٦) وأبو داود (٣/٣٢ - ح: ٢٥٢٠) والحاكم (المستدرك: ٢/٢٩٧) وابن جرير (٢/١١٣) والبيهقي في الدلائل (٣/٣٠٤) وعبد بن حميد (فتح القدير: ١/٤٠١) وأبو يعلى في مسنده (٤/٢١٩ - ح: ٢٣٣١) من طريق ابن إسحاق (السيرة النبوية لابن هشام: ٣/٥٧) عن إسماعيل بن أبي أمية عن أبي الزبير عن سعيد بن جبير عن ابن عباس به، وفيه عنعنة ابن إسحاق وأبي الزبير وهما مدلّسان (تقريب التهذيب: ٢/١٤٤ - رقم: ٤٠) (٢/٢٠٧ - رقم: ٦٩٧) وصرّح ابن إسحاق بالتحديث عند أحمد، ولم يصرح به أبو الزبير لكن يتقوى ويتحسن بشواهده، لا سيما وقد صححه الحاكم (انظر للمزيد: تفسير الطبري بتحقيق أحمد شاكر: ٧/٣٨٥) ، ومن شواهده: الرواية الآتية.</p><p>(١) - قَوْلُهُ تَعَالَى: {وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا} {١٦٩} .</p><p>أَخْبَرَنَا مُحَمَّدُ بْنُ مُحَمَّدِ بن يحيى قال: أَخْبَرَنَا أَبُو سَعِيدٍ إِسْمَاعِيلُ بْنُ أحمد الخلالي قال: أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ زَيْدَانَ بْنِ يزيد البجلي قال: حَدَّثَنَا أبو كريب قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي أُمَيَّةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - \"لَمَّا أُصِيبَ إِخْوَانُكُمْ بِأُحُدٍ جَعَلَ اللَّهُ أَرْوَاحَهُمْ فِي أَجْوَافِ طَيْرٍ خُضْرٍ تَرِدُ أَنْهَارَ الْجَنَّةِ وَتَأْكُلُ مِنْ ثِمَارِهَا وَتَأْوِي إِلَى قَنَادِيلَ مِنْ ذَهَبٍ مُعَلَّقَةٍ فِي ظِلِّ الْعَرْشِ، فَلَمَّا وَجَدُوا طِيبَ مَأْكَلِهِمْ وَمَشْرَبِهِمْ وَمَقِيلِهِمْ قَالُوا: مَنْ يُبَلِّغُ إِخْوَانَنَا عَنَّا أَنَّا فِي الْجَنَّةِ نُرْزَقُ، لِئَلَّا يَزْهَدُوا فِي الْجِهَادِ وَلَا يَنْكُلُوا فِي الْحَرْبِ\"، فَقَالَ اللَّهُ عَزَّ وَجَلَّ: \"أَنَا أُبَلِّغُهُمْ عَنْكُمْ\"، فَأَنْزَلَ اللَّهُ تَعَالَى: {وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ} رَوَاهُ الْحَاكِمُ أَبُو عَبْدِ اللَّهِ فِي صَحِيحِهِ مِنْ طَرِيقِعُثْمَانَ بْنِ أَبِي شَيْبَةَ.</p><p>أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرحمن الغازي قال: أَخْبَرَنَا مُحَمَّدُ بن حمدان قال: أَخْبَرَنَا حَامِدُ بْنُ شعيب البلخي قال: حدثناعثمان بْنُ أبي شيبة قال: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ فَذَكَرَهُ. رَوَاهُ الْحَاكِمُ عَنْ عَلِيِّ بْنِ عِيسَى الْحِيرِيِّ، عَنْ مُسَدَّدٍ، عَنْ عُثْمَانَ بْنِ أَبِي شَيْبَةَ.</p><p>(١) - أخرجه الإمام أحمد (الفتح الرباني: ١٨/١٠٩ - ح: ٢٢٦) وأبو داود (٣/٣٢ - ح: ٢٥٢٠) والحاكم (المستدرك: ٢/٢٩٧) وابن جرير (٢/١١٣) والبيهقي في الدلائل (٣/٣٠٤) وعبد بن حميد (فتح القدير: ١/٤٠١) وأبو يعلى في مسنده (٤/٢١٩ - ح: ٢٣٣١) من طريق ابن إسحاق (السيرة النبوية لابن هشام: ٣/٥٧) عن إسماعيل بن أبي أمية عن أبي الزبير عن سعيد بن جبير عن ابن عباس به، وفيه عنعنة ابن إسحاق وأبي الزبير وهما مدلّسان (تقريب التهذيب: ٢/١٤٤ - رقم: ٤٠) (٢/٢٠٧ - رقم: ٦٩٧) وصرّح ابن إسحاق بالتحديث عند أحمد، ولم يصرح به أبو الزبير لكن يتقوى ويتحسن بشواهده، لا سيما وقد صححه الحاكم (انظر للمزيد: تفسير الطبري بتحقيق أحمد شاكر: ٧/٣٨٥) ،ومن شواهده: الرواية الآتية.</p>"
  },    {
    "id": 112,
    "sura": 3,
    "aya": 173,
    "text":  "<p>(١) - قَوْلُهُ تَعَالَى: {الَّذِينَ قَالَ لَهُمُ النَّاسُ} الْآيَةَ {١٧٣} .أَخْبَرَنَا أَبُو إسحاق الثعالبي قال: أَخْبَرَنَا أَبُو صَالِحٍ شُعَيْبُ بن محمد قال: أَخْبَرَنَا أَبُو حَاتِمٍ التميمي قال: أَخْبَرَنَا أَحْمَدُ بْنُ الأزهر قال: حَدَّثَنَا رَوْحُ بْنُ عبادة قال: حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ قَالَ: ذَاكَ يَوْمُ أُحُدٍ بَعْدَ الْقَتْلِ وَالْجِرَاحَةِ وَبَعْدَمَا انْصَرَفَ الْمُشْرِكُونَ أَبُو سُفْيَانَ وَأَصْحَابُهُ قَالَ نَبِيُّ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - لِأَصْحَابِهِ: 'أَلَا عِصَابَةٌ تُشَدِّدُ لِأَمْرِ اللَّهِ فَتَطْلُبُ عَدُوَّهَا فَإِنَّهُ أَنَكَى لِلْعَدُوِّ وَأَبْعَدُ لِلسَّمْعِ'، فَانْطَلَقَ عِصَابَةٌ عَلَى مَا يَعْلَمُ اللَّهُ مِنَ الْجَهْدِ حَتَّى إِذَا كَانُوا بِذِي الْحُلَيْفَةِ جَعَلَ الْأَعْرَابُ وَالنَّاسُ يَأْتُونَ عَلَيْهِمْ، يَقُولُونَ هَذَا أَبُو سُفْيَانَ مَائِلٌ بِالنَّاسِ، فَقَالُوا: حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ، فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِمْ: {الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ} إِلَى قَوْلِهِ تَعَالَى: {وَاللَّهُ ذُو فَضْلٍ عَظِيمٍ} </p><p>(١) - مرسل إسناده حسن، ويشهد له: \n* ما أخرجه ابن جرير (٤/١٢٠) عن قتادة نحوه، وإسناده صحيح.</p>"
  },    {
    "id": 113,
    "sura": 3,
    "aya": 179,
    "text": "<p>قَوْلُهُ تَعَالَى: {مَا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَى مَا أَنْتُمْ عَلَيْهِ} {١٧٩} .قَالَ السُّدِّيُّ: قَالَ رَسُولُ اللَّهِ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - 'عُرِضَتْ عَلَيَّ أُمَّتِي فِي صُوَرِهَا كَمَا عُرِضَتْ عَلَى آدَمَ، وَأُعْلِمْتُ مِنِيهِم مَنْ يُؤْمِنُ بِي وَيُطِيعِيهِ، وَمَنْ يَكْفُرُ بِي وَيَغْلِبِيهِ'، فَبَلَغَ ذلك المنافقين فاستهزأوا وَقَالُوا: يَزْعُمُ مُحَمَّدٌ أَنَّهُ يَعْلَمُ مَنْ يُؤْمِنُ بِهِ وَمَنْ يَكْفُرُ، وَنَحْنُ مَعَهُ وَلَا يَعْرِفُنَا، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.وَقَالَ الْكَلْبِيُّ: قَالَتْ قُرَيْشٌ: تَزْعُمُ يَا مُحَمَّدُ أَنَّ مَنْ خَالَفَكَ فَهُوَ فِي النَّارِ وَاللَّهُ عَلَيْهِ غَضْبَانُ، وَأَنَّ مَنِ اتَّبَعَكَ عَلَى دِينِكَ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ وَاللَّهُ عَنْهُ رَاضٍ، فَأَخْبِرْنَا بِمَنْ يُؤْمِنُ بِكَ وَمَنْ لَا يُؤْمِنُ بِكَ؟ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.وَقَالَ أَبُو الْعَالِيَةِ: سَأَلَ الْمُؤْمِنُونَ أَنْ يُعْطَوا عَلَامَةً يُفْرِقُونَ بِهَا بَيْنَ الْمُؤْمِنِ وَالْمُنَافِقِ، فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ.</p><p>(٢) - أخرجه ابن ماجة في المنافقين (٢٣٣) من طريق عمرو بن عمارة عن هشام عن أبي صالح mountanya، وحسنته.</p>"
  },    {
    "id": 114,
    "sura": 3,
    "aya": 180,
    "text": "<p>(١) - قَوْلُهُ تَعَالَى: {وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ} الْآيَةَ {١٨٠} .أَجْمَعَ جُمْهُورُ الْمُفَسِّرِينَ عَلَى أَنَّهَا نَزَلَتْ فِي مَانِعِي الزَّكَاةِ.</p><p>وَرَوَى عَطِيَّةُ الْعَوْفِيُّ عَنِ ابْنِ عَبَّاسٍ: أَنَّ الْآيَةَ نَزَلَتْ فِي أَحْبَارِ الْيَهُودِ الَّذِينَ كَتَمُوا صِفَةَ مُحَمَّدٍ - صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَنُبُوَّتِهِ، وَأَرَادَ بِالْبُخْلِ: كِتْمَانَ الْعِلْمِ الَّذِي آتَاهُمُ اللَّهُ تَعَالَى.</p><p>(١) - أخرجه ابن جرير (٤/١٢٦) وابن أبي حاتم (فتح القدير: ١/٤٠٥) موصولاً من طريق العوفي عن ابن عباس وإسناده ضعيف.</p>"
  },
]
